[
  {
    "Date": "February 5, 2010",
    "Location": "Madison, Alabama !Madison, Alabama",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "14-year-old student, Hammad Memon, killed 14-year-old Todd Brown at Discovery Middle School as classes were changing. The shooting was possibly related to gang activitiy. In May 2013, Memon pleaded guilty to the murder and was sentenced to thirty years of prison. After Memon is released from prison, he is likely to be deported to his native Pakistan.[386]",
    "coords": {
      "lat": 34.6992579,
      "lon": -86.74833180000002
    }
  },
  {
    "Date": "February 12, 2010",
    "Location": "Huntsville, Alabama !Huntsville, Alabama",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0013",
    "Description": "2010 University of Alabama in Huntsville shooting: 44-year-old biology professor, Amy Bishop, killed the chairman of the biology department, 52-year-old Gopi K. Podila, and biology professors, 50-year-old, Maria Ragland Davis and 52-year-old Adriel D. Johnson. She also wounded biology professors, Luis Rogelio Cruz-Vera and Joseph G. Leahy, and staff assistant, Stephanie Monticciolo.[385]",
    "coords": {
      "lat": 34.7303688,
      "lon": -86.5861037
    }
  },
  {
    "Date": "February 19, 2010",
    "Location": "DeKalb, Illinois !DeKalb, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Less than a week after Northern Illinois University solemnly marked the second anniversary of a mass shooting on campus that claimed the lives of five students, the DeKalb school was the scene of further gun violence. 24-year-old NIU student, Brian Mulder, refused entry to 22-year-old Zachary R. Isaacman, when he had tried to follow a female resident into the Stevenson Residence Hall North, where they were living, because he was not a resident. Moments later, while outside the dorm smoking with a friend, Mulder was shot by Isaacman, with a handgun in the leg above the knee. Isaacman tried to flee, but was caught by police within minutes.[387]",
    "coords": {
      "lat": 41.9294736,
      "lon": -88.75036469999999
    }
  },
  {
    "Date": "February 23, 2010",
    "Location": "Littleton, Colorado !Littleton, Colorado",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "At Deer Creek Middle School, 32-year-old Bruco Strong Eagle Eastwood opened fire from a rifle in a parking lot, and wounded two eighth-graders Reagan Webber and Matt Thieu, before being restrained by 57-year-old Math teacher, David Benke, and held until his arrest. The boy's wounds were critical for the four days following the shooting.[388] In October 2011, Eastwood was found not guilty by reason of insanity.[389][385]",
    "coords": {
      "lat": 39.613321,
      "lon": -105.0166498
    }
  },
  {
    "Date": "March 9, 2010",
    "Location": "Columbus, Ohio !Columbus, Ohio",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0011",
    "Description": "51-year-old Ohio State University custodian, Nathaniel Brown, killed a co-worker and wounded another.[385]",
    "coords": {
      "lat": 39.9611755,
      "lon": -82.99879419999999
    }
  },
  {
    "Date": "September 8, 2010",
    "Location": "Detroit, Michigan !Detroit, Michigan",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Two students were wounded in front of Mumford High School by 17-year-old Steven Jamal Hare. He was tried as an adult and charged with assault with intent to kill. In 2012, Hare was sentenced to 27 years in prison.[390]",
    "coords": {
      "lat": 42.331427,
      "lon": -83.0457538
    }
  },
  {
    "Date": "September 28, 2010",
    "Location": "Austin, Texas  !Austin, Texas",
    "Deaths": "1",
    "Injuries": "0,000,0010",
    "Description": "A 19-year-old sophomore student Colton Tooley, wielding an AK-47 and wearing a ski mask, opened fire and then killed himself in a University of Texas library[391]",
    "coords": {
      "lat": 30.267153,
      "lon": -97.7430608
    }
  },
  {
    "Date": "October 1, 2010",
    "Location": "Salinas, California !Salinas, California",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "15-year-old student Jose Daniel Cisneros was killed after being shot several times on an athletic field at Alisal High School while walking to school. Police said that the shooting was gang-related.[392]",
    "coords": {
      "lat": 36.6777372,
      "lon": -121.6555013
    }
  },
  {
    "Date": "October 8, 2010",
    "Location": "Carlsbad, California !Carlsbad, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "41-year-old Brendan O'Rourke climbed over a fence and opened fire with a handgun in a playground of Kelly Elementary School, which had 230 students; two second-grade female students were grazed in the arms before O'Rourke was subdued by a construction worker. He was found guilty of seven counts of attempted murder and was sentenced to 189 years to life in prison.[393]",
    "coords": {
      "lat": 33.1580933,
      "lon": -117.3505939
    }
  },
  {
    "Date": "November 29, 2010",
    "Location": "Marinette, Wisconsin !Marinette, Wisconsin",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "15-year-old Samuel Hengel, took 23 students and a teacher hostage inside a classroom of Marinette High School for five hours. He had stormed into the class, firing with a handgun at a movie projector. Police persuaded Hengel to release the hostages. After officers entered the building, Hengel shot himself in the head. He died the next day.[394]",
    "coords": {
      "lat": 45.0999849,
      "lon": -87.6306623
    }
  },
  {
    "Date": "December 6, 2010",
    "Location": "Aurora, Colorado !Aurora, Colorado",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "In a gang-related attack outside Aurora Central High School, a 17-year-old girl was paralysed. She was one of a group of students outside the school. 20-year-old Luis Enrique Guzman-Rincon, had fired shots from a car trying to hit gang rivals. Guzman-Ricon was sentenced to thirty-five years in prison.[395]",
    "coords": {
      "lat": 39.7294319,
      "lon": -104.8319195
    }
  },
  {
    "Date": "January 5, 2011",
    "Location": "Omaha, Nebraska !Omaha, Nebraska",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0012",
    "Description": "At Millard South High School, 18-year-old student, Robert Butler Jr., killed assistant principal Dr. Vicki Kaspar and wounded principal Curtis Case before opening fire at police in the front office area, causing the school nurse to be wounded by gunshot debris. Butler then drove to a parking lot and shot himself as police cornered him.[396]",
    "coords": {
      "lat": 41.2523634,
      "lon": -95.99798829999999
    }
  },
  {
    "Date": "March 25, 2011",
    "Location": "Martinsville, Indiana !Martinsville, Indiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Michael Phelps, a 15-year-old suspended student, returned to Martinsville West Middle School with a handgun. In the entrance of the school, Phelps shot 15-year-old Chance Jackson twice in the abdomen, critically wounding him. Phelps fled the school and dropped the handgun; he was arrested shortly after. Jackson had to undergo surgery three times to save his life; he suffers from post-traumatic stress disorder. Phelps was convicted of attempted murder in August 2011, and was sentenced to thirty years in prison and five years of probation.[397]",
    "coords": {
      "lat": 39.42782529999999,
      "lon": -86.4283279
    }
  },
  {
    "Date": "March 31, 2011",
    "Location": "Houston, Texas !Houston, Texas",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0015",
    "Description": "Multiple gunmen opened fire during a powder puff football game at Worthing High School. One man, an 18-year-old former student named Tremaine De Ante’ Paul, died. Five other people were injured.[398]",
    "coords": {
      "lat": 29.7604267,
      "lon": -95.3698028
    }
  },
  {
    "Date": "May 23, 2011",
    "Location": "Pearl City, Hawaii !Pearl City, Hawaii",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 14-year-old male student is accused of firing a handgun on the campus of Highlands Intermediate School, wounding one student. The gunman was arrested on suspicion of attempted murder. Two other suspects were arrested in connection with the shooting.[399]",
    "coords": {
      "lat": 21.3972222,
      "lon": -157.9733333
    }
  },
  {
    "Date": "October 24, 2011",
    "Location": "Fayetteville, North Carolina !Fayetteville, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Cape Fear High School shooting: 15-year-old Catilyn Abercrombie, was shot in the neck with a rifle by fellow student, 15-year-old Charles Underwood, at Cape Fear High School. She was hospitalized for two months in a serious condition. Underwood was arrested and charged with attempted murder. He was convicted of attempted first-degree murder and sentenced to fifteen years in prison.[400]",
    "coords": {
      "lat": 35.0526641,
      "lon": -78.87835849999999
    }
  },
  {
    "Date": "December 8, 2011",
    "Location": "Blacksburg, Virginia !Blacksburg, Virginia",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "22-year-old, Ross Truett Ashley, part-time business student at Radford University, killed a police officer engaged in an unrelated traffic stop on the campus of Virginia Tech, he then committed suicide in a nearby parking lot.[401]",
    "coords": {
      "lat": 37.2295733,
      "lon": -80.4139393
    }
  },
  {
    "Date": "December 9, 2011",
    "Location": "Edinburg, Texas !Edinburg, Texas",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Two students were shot after school at Harwell Middle School in Edinburg, Texas while trying out for their school's basketball team. The shooting allegedly was done by an adult off campus, who was shooting at a target range.[402]",
    "coords": {
      "lat": 26.3017374,
      "lon": -98.1633432
    }
  },
  {
    "Date": "January 10, 2012",
    "Location": "Houston, Texas !Houston, Texas",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A student opened fire with a handgun at North Forest High School, wounding another student. The shooter said that he had been confronted by three students who had been bullying him and he shot in self-defense. He hit a 16-year-old bystander in the leg. The 18-year-old suspect was charged with aggravated assault with a deadly weapon.[403]",
    "coords": {
      "lat": 29.7604267,
      "lon": -95.3698028
    }
  },
  {
    "Date": "February 27, 2012",
    "Location": "Chardon, Ohio !Chardon, Ohio",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0013",
    "Description": "Chardon High School shooting: 17-year-old Thomas \"T. J.\" Lane, took a semi-automatic handgun and a knife to Chardon High School, where he fired ten shots at a group of students sitting in the cafeteria. He killed three boys and wounded three other students. One 16-year-old died immediately, two others died the following day. Lane was arrested early the next morning while standing near his car.[404] He was charged as an adult with murder, attempted murder, and firearms offenses. In March 2013, he was convicted and sentenced to three life sentences without the possibility of parole.[405]",
    "coords": {
      "lat": 41.5786639,
      "lon": -81.2133262
    }
  },
  {
    "Date": "March 6, 2012",
    "Location": "Jacksonville, Florida !Jacksonville, Florida",
    "Deaths": "2",
    "Injuries": "0",
    "Description": "A murder-suicide resulted in two deaths on the campus of the Episcopal School of Jacksonville. Shane Schumerth, a Spanish teacher who had been fired that morning returned to the campus in the early afternoon via a pedestrian entrance, armed with an AK-47 which he concealed in a guitar case. He entered the office of the Head of School, Dale Regan, and fired multiple shots, fatally wounding her. Schumerth then killed himself, in the office.[406]",
    "coords": {
      "lat": 30.3321838,
      "lon": -81.65565099999999
    }
  },
  {
    "Date": "April 2, 2012",
    "Location": "Oakland, California !Oakland, California",
    "Deaths": "0,000,0017",
    "Injuries": "0,000,0013",
    "Description": "Oikos University shooting: 43-year-old One L. Goh, was accused of shooting dead seven students with a handgun and wounding three others at Oikos University, a Christian college. He fled the scene, stealing a victim's car, and was apprehended hours later nearby. Goh was charged with seven counts of murder. In January 2013, Goh was determined to be mentally unfit for trial and committed for treatment.[407]",
    "coords": {
      "lat": 37.8043637,
      "lon": -122.2711137
    }
  },
  {
    "Date": "August 16, 2012",
    "Location": "Memphis, Tennessee !Memphis, Tennessee",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Two Hamilton High School students were wounded in the parking lot of the school. The attack was believed to be gang-related.[408]",
    "coords": {
      "lat": 35.1495343,
      "lon": -90.0489801
    }
  },
  {
    "Date": "August 27, 2012",
    "Location": "Perry Hall, Maryland !Perry Hall, Maryland",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "15-year-old Robert Gladden, fired two shots with a shotgun inside the cafeteria at Perry Hall School. He hit a 17-year-old senior in the lower back, causing critical wounds. The youth has Down syndrome. Gladden was subdued by two school faculty members, and arrested. In February 2013, he was sentenced to thirty-five years in prison on attempted murder charges.[409]",
    "coords": {
      "lat": 39.4126073,
      "lon": -76.463574
    }
  },
  {
    "Date": "September 7, 2012",
    "Location": "Normal, Illinois !Normal, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "A 14-year-old student fired multiple gunshots in a classroom ceiling at Normal Community High School, and was tackled by a teacher. Nobody was injured. The student was arrested and charged with sixteen felony counts.[410][411]",
    "coords": {
      "lat": 40.5142026,
      "lon": -88.9906312
    }
  },
  {
    "Date": "October 6, 2012",
    "Location": "Mobile, Alabama !Mobile, Alabama",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A University of South Alabama student, Gil Collar, was fatally shot by a campus police officer. Collar, 18, was at the time under the influence of a hallucinogenic, 25I-NBOMe. Acting erratically, he had repeatedly approached the police officer \"in a fighting stance\", while naked and unarmed. Officer Trevis Austin, equipped with pepper spray and a baton, felt his life was threatened and shot him, once through the chest. [412] Austin was cleared of any wrongdoing by the university.[413]",
    "coords": {
      "lat": 30.6953657,
      "lon": -88.0398912
    }
  },
  {
    "Date": "October 19, 2012",
    "Location": "Chicago, Illinois !Chicago, Illinois",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "18-year-old Banner Academy South student, Terrance Wright, was killed during an attempted robbery. Wright was approached by five would-be robbers as he left the school about 3:40 p.m.. He was shot in the chest as he fought back when one assailant was going through his pockets. Wright had been picked on at his previous high school because he was gay, which led him to transfer to Banner.[414]",
    "coords": {
      "lat": 41.8781136,
      "lon": -87.6297982
    }
  },
  {
    "Date": "October 31, 2012",
    "Location": "Los Angeles, California !Los Angeles, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0014",
    "Description": "At a Halloween party on the University of Southern California campus, an argument escalated and 20-year-old Brandon Spencer, used a handgun to shoot rival gang member, Geno Hall, seven times, critically wounding him. Spencer wounded three other people, none were students at USC, they were hospitalized with less serious injuries. Spencer was arrested just minutes after the shooting, which took place outside USC’s Grand Ballroom at around 11:30 p.m.[415] In April 2014, he was convicted of attempted murder and sentenced to forty years to life in prison.[416]",
    "coords": {
      "lat": 34.0522342,
      "lon": -118.2436849
    }
  },
  {
    "Date": "December 14, 2012",
    "Location": "Newtown, Connecticut !Newtown, Connecticut",
    "Deaths": "0,000,00128",
    "Injuries": "0,000,0012",
    "Description": "Sandy Hook Elementary School shooting: 20-year-old Adam Lanza, killed twenty-six people and himself. He first killed his mother at their shared home before taking her guns and driving to the school. Lanza brought four guns with him. He killed twenty first-grade children aged six and seven during the attack at school, along with six adults, including four teachers, the principal, and the school psychologist. Two other persons were injured. Lanza then killed himself as police arrived at the school.[404][417]",
    "coords": {
      "lat": 41.4141172,
      "lon": -73.3035651
    }
  },
  {
    "Date": "January 7, 2013",
    "Location": "Fort Myers, Florida !Fort Myers, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "Shots were fired at Apostolic Revival Center Christian School, leaving 27-year-old Kristopher Smith dead in what was believed to be a retaliation killing, possibly for his talking with police about a previous incident.[418][419]",
    "coords": {
      "lat": 26.640628,
      "lon": -81.8723084
    }
  },
  {
    "Date": "January 10, 2013",
    "Location": "Taft, California !Taft, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "16-year-old student, Bryan Oliver, entered a science classroom of Taft Union High School with a shotgun and opened fire, critically wounding 16-year-old student Bowe Cleveland. He shot at but missed another student. The classroom teacher Ryan Heber convinced Oliver, to drop his weapon. He was later arrested. On January 14, he was charged with two counts of attempted murder and assault with a firearm.[420] He was convicted and accepted a plea deal with a sentence of 27 years and 4 months.[421] According to the attorney[422] for the Cleveland family, they were not satisfied with the sentence.",
    "coords": {
      "lat": 35.1424671,
      "lon": -119.4565078
    }
  },
  {
    "Date": "January 12, 2013",
    "Location": "Detroit, Michigan !Detroit, Michigan",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 16-year-old Osborn High School student is wounded after a basketball game.[420]",
    "coords": {
      "lat": 42.331427,
      "lon": -83.0457538
    }
  },
  {
    "Date": "January 15, 2013",
    "Location": "St. Louis, Missouri !St. Louis, Missouri",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "A 34-year-old gunman wounded an administrator in his office on the fourth floor of Stevens Institute of Business and Arts. The suspected gunman, Sean Johnson, a part-time student, wounded himself in a stairwell. Both the administrator and Johnson were hospitalized in stable conditions. Johnson was charged with three felony charges, including assault.[423][424]",
    "coords": {
      "lat": 38.6270025,
      "lon": -90.19940419999999
    }
  },
  {
    "Date": "January 15, 2013",
    "Location": "Hazard, Kentucky !Hazard, Kentucky",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0010",
    "Description": "Two people were killed and a third person was wounded at the parking lot of Hazard Community and Technical College.[425] The third victim, 12-year-old Taylor Cornett, died from her wounds the next day.[426] 21-year-old Dalton Lee Stidham, was arrested and charged with three counts of murder.",
    "coords": {
      "lat": 37.24954,
      "lon": -83.1932284
    }
  },
  {
    "Date": "January 16, 2013",
    "Location": "Chicago, Illinois !Chicago, Illinois",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A 17-year-old boy, Tyrone Lawson, was killed in a parking lot of Chicago State University. The shooting happened after high school basketball games held on the campus, where Lawson had been a spectator. Police arrested two brothers, Michael McNabb, 33, and Brian Hewlett (under the alias Stephen Gilbert), 30 after the shooting and recovered a weapon.[420][427][428]",
    "coords": {
      "lat": 41.8781136,
      "lon": -87.6297982
    }
  },
  {
    "Date": "January 22, 2013",
    "Location": "Houston, Texas !Houston, Texas",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "Lone Star College–North Harris shooting: Outside Lone Star College–North Harris, two men got into an argument. One wounded the other. He also wounded a maintenance man, and accidentally shot himself in the leg. The shooter fled into the woods and was arrested hours later. The charges against the initial suspect were dropped and another man was arrested.[429]",
    "coords": {
      "lat": 29.7604267,
      "lon": -95.3698028
    }
  },
  {
    "Date": "January 31, 2013",
    "Location": "Phoenix, Arizona !Phoenix, Arizona",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "An argument between two rival gangs escalated to what police described as a \"gun battle\" at Cesar Chavez High School. Approximately fifteen shots were fired in the vicinity of people waiting to get into a scheduled boys' basketball game. No one was injured.[430]",
    "coords": {
      "lat": 33.4483771,
      "lon": -112.0740373
    }
  },
  {
    "Date": "January 31, 2013",
    "Location": "Atlanta, Georgia !Atlanta, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "A 14-year-old male student was wounded at Price Middle School. The gunman, a 15-year-old student, was believed to be arguing with the other student before using a handgun to shoot him. A teacher was also wounded. Afterward, the gunman was disarmed by a school resource officer and arrested; police charged him with aggravated assault.[431][432]",
    "coords": {
      "lat": 33.7489954,
      "lon": -84.3879824
    }
  },
  {
    "Date": "March 18, 2013",
    "Location": "Orlando, Florida !Orlando, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "At the University of Central Florida, 30-year-old student James Oliver Seevakumaran pulled a fire alarm at the Tower One dormitory, to attract a crowd. He pointed a handgun at his roommate and threatened to shoot him in their room; he released the roommate, who ran out and called 9-1-1. Seevakumaran then fatally shot himself in the head. Authorities found an assault weapon, a couple hundred rounds of ammunition and four homemade bombs inside his backpack.[433]",
    "coords": {
      "lat": 28.5383355,
      "lon": -81.3792365
    }
  },
  {
    "Date": "April 12, 2013",
    "Location": "Dublin, Virginia !Dublin, Virginia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "New River Community College shooting incident: Two women were wounded during a shooting at the campus of New River Community College. 18-year-old Neil Allen MacInnis, was taken into custody. In June 2014, he was sentenced to 38 years in prison.[434]",
    "coords": {
      "lat": 37.1056784,
      "lon": -80.6853433
    }
  },
  {
    "Date": "April 16, 2013",
    "Location": "Grambling, Louisiana !Grambling, Louisiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "Three students were injured on the campus of Grambling State University.[435]",
    "coords": {
      "lat": 32.5276503,
      "lon": -92.7140402
    }
  },
  {
    "Date": "April 18, 2013",
    "Location": "Cambridge, Massachusetts !Cambridge, Massachusetts",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0011",
    "Description": "At the Massachusetts Institute of Technology, near Building 32, the Ray and Maria Stata Center, a campus police officer was shot multiple times and killed. The shooting was believed to be perpetrated by the suspects of the Boston Marathon bombings three days prior to this shooting. The two suspects were brothers Dzhokhar Tsarnaev and Tamerlan Tsarnaev. About three hours after the MIT shooting, Tamerlan died in a gunfight with police in Watertown, Massachusetts. Another officer was seriously wounded. Dzhokhar was arrested 18 hours afterward in Watertown, and was hospitalized in critical condition from a gunshot wound to the neck.[436]",
    "coords": {
      "lat": 42.3736158,
      "lon": -71.10973349999999
    }
  },
  {
    "Date": "May 14, 2013",
    "Location": "Birmingham, Alabama !Birmingham, Alabama",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "Allegedly responding to a student fight, a mother of a student fired a weapon on the campus of Ossie Ware Mitchell Middle School. No one was injured.[437]",
    "coords": {
      "lat": 33.5206608,
      "lon": -86.80248999999999
    }
  },
  {
    "Date": "June 7, 2013",
    "Location": "Santa Monica, California !Santa Monica, California",
    "Deaths": "0,000,0016",
    "Injuries": "0,000,0014",
    "Description": "2013 Santa Monica shooting: 23-year-old John Zawahri, began a killing spree at his home. After killing his 55-year-old father, Samir \"Sam\" Zawahri, and 25-year-old brother, Chris Zawahri, he set the house ablaze. Dressed all in black with body armor and wielding an AR-15-type semi-automatic rifle, Zawahri carjacked 41-year-old Laura Siska, shooting 50-year-old Debra Fine, as she attempted to intervene, before forcing Siska to drive to Santa Monica College. Upon arriving on the college campus, Zawahri began shooting at passing vehicles, including a police car and a city bus, leaving three people with minor injuries. Zawahri next targeted a Ford Explorer, killing the driver, 68-year-old campus groundskeeper, Carlos Navarro Franco, and fatally wounding the passenger, his 26-year-old daughter Marcela Diaz-Franco, a student at the college, who died two days later. 68-year-old Margarita Gomez, who was collecting cans outside the library, died after being shot in the abdomen and chest. Zawahri opened fire on students who were trying to run away. It ended at the college library where he opened fire on students studying for finals, before being fatally wounded in an exchange of gunfire with responding police officers.[438]",
    "coords": {
      "lat": 34.0194543,
      "lon": -118.4911912
    }
  },
  {
    "Date": "August 20, 2013",
    "Location": "Decatur, Georgia !Decatur, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "Armed with an automatic rifle, 21-year-old Michael Brandon Hill fired six shots inside the front office of Ronald E. McNair Discovery Learning Academy. He barricaded himself in the office, where police returned fire. Nobody was injured. Children were evacuated. After talking with school bookkeeper, Antoinette Tuff in the front office, he was persuaded to surrender before anyone was hurt. Hill was arrested and charged.[439][440]",
    "coords": {
      "lat": 33.7748275,
      "lon": -84.2963123
    }
  },
  {
    "Date": "August 23, 2013",
    "Location": "Sardis, Mississippi !Sardis, Mississippi",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "15-year-old student, Roderick Bobo, was killed during a football game at North Panola High School in what was termed a gang-related shooting. Two others were injured in the shooting. Three men were charged as being responsible for the crime.[441]",
    "coords": {
      "lat": 34.4370511,
      "lon": -89.9159227
    }
  },
  {
    "Date": "August 30, 2013",
    "Location": "Winston-Salem, North Carolina !Winston-Salem, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 15-year-old male student was shot at Carver High School, at 2:30 p.m.. He was hospitalized with minor injuries.[439] An 18-year-old male student was apprehended without further incident. The suspected gunman is charged with assault with a deadly weapon inflicting serious injury, carrying a concealed gun, possessing and discharging a firearm, and carrying a firearm onto educational property. The shooting was believed related to a dispute between the suspect and the victim.[442]",
    "coords": {
      "lat": 36.09985959999999,
      "lon": -80.244216
    }
  },
  {
    "Date": "October 4, 2013",
    "Location": "Pine Hills, Florida !Pine Hills, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "A 16-year-old student was shot in the hip outside Agape Christian Academy after a fight broke out at 2 p.m.. An innocent bystander was hit by a stray bullet or shrapnel. The two victims were treated for minor injuries. The suspected shooter reportedly fled in a car with several other males, and was not caught.[443]",
    "coords": {
      "lat": 28.5577794,
      "lon": -81.4534046
    }
  },
  {
    "Date": "October 21, 2013",
    "Location": "Sparks, Nevada !Sparks, Nevada",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0012",
    "Description": "12-year-old seventh-grade student Jose Reyes opened fire with a handgun at the basketball courts of Sparks Middle School, injuring one student in the shoulder. Michael Landsberry, a teacher and veteran, tried to intervene and was killed by Reyes. Reyes also wounded a student trying to help the teacher. Reyes then committed suicide by shooting himself in the head.[404][439] The shooting happened before classes, and the school was evacuated and was closed for the week.[444]",
    "coords": {
      "lat": 39.5349112,
      "lon": -119.7526886
    }
  },
  {
    "Date": "November 2, 2013",
    "Location": "Greensboro, North Carolina !Greensboro, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 21-year-old student was wounded at North Carolina A&T State University. The victim was hospitalized for serious but non-life-threatening injuries. The university was temporarily locked down that night. No suspects are in custody.[445]",
    "coords": {
      "lat": 36.0726354,
      "lon": -79.7919754
    }
  },
  {
    "Date": "November 3, 2013",
    "Location": "Lithonia, Georgia !Lithonia, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "A Stephenson High School student and a janitor were shot in an apparent confrontation between football team members and a group of teens who were not attending the school. Both were innocent bystanders.[446]",
    "coords": {
      "lat": 33.7123305,
      "lon": -84.1051939
    }
  },
  {
    "Date": "November 13, 2013",
    "Location": "Pittsburgh, Pennsylvania !Pittsburgh, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "After classes ended, at least one gunman came out of the woods and opened fire on three students as they were walking to their cars at Brashear High School. One student was grazed in the head, another was struck in the neck and shoulder, and a third was hit in the leg and foot. Six people were taken into custody. The shooting is believed to be drug-related.[447]",
    "coords": {
      "lat": 40.44062479999999,
      "lon": -79.9958864
    }
  },
  {
    "Date": "December 4, 2013",
    "Location": "Winter Garden, Florida !Winter Garden, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 15-year-old student was wounded by a 17-year-old student near a soccer field on the campus of West Orange High School. The shooting occurred after a fight broke out between the two students. The 17-year-old suspected shooter was taken into custody several miles away from the school, and is charged with attempted murder, aggravated battery with a firearm, possession of a firearm by a minor and possession of a firearm on school grounds. In October 2014, the shooter was sentenced to twenty-five years in prison.[448]",
    "coords": {
      "lat": 28.5652787,
      "lon": -81.58618469999999
    }
  },
  {
    "Date": "December 13, 2013",
    "Location": "Centennial, Colorado !Centennial, Colorado",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "18-year-old Karl Pierson, shot 17-year-old student Claire Davis in the head, fatally injuring her, in a hallway in Arapahoe High School. Pierson then took his own life.[404] Pierson was armed with a shotgun, three Molotov cocktails, and a machete. His intention was to shoot the librarian who had disciplined him. Claire Davis died from her injuries on December 21, 2013.[449]",
    "coords": {
      "lat": 39.5807452,
      "lon": -104.8771726
    }
  },
  {
    "Date": "December 19, 2013",
    "Location": "Fresno, California !Fresno, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Four teens (16, 16, 16 and 17 years old) entered Edison High School in what was believed as a gang-initiation process. After accosting a 62-year-old woman about a mile away from school grounds, they found an athletic trainer who taught at Edison High and shot him several times in the leg and stomach.[450]",
    "coords": {
      "lat": 36.7468422,
      "lon": -119.7725868
    }
  },
  {
    "Date": "January 9, 2014",
    "Location": "Jackson, Tennessee !Jackson, Tennessee",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 16-year-old student was charged with bringing a gun to school at Liberty Technology Magnet High School and shooting a classmate in the thigh. The incident occurred outside the front of the school.[451]",
    "coords": {
      "lat": 35.6145169,
      "lon": -88.81394689999999
    }
  },
  {
    "Date": "January 13, 2014",
    "Location": "New Haven, Connecticut !New Haven, Connecticut",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 14-year-old boy was shot outside of a basketball game at the Hillhouse High School athletic facility, suffering wounds in his hand and leg.[cite]",
    "coords": {
      "lat": 41.308274,
      "lon": -72.9278835
    }
  },
  {
    "Date": "January 14, 2014",
    "Location": "Roswell, New Mexico !Roswell, New Mexico",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "Two people were wounded inside the gymnasium of Berrendo Middle School, at about 8:10 a.m.. An 11-year-old boy and a 13-year-old girl were airlifted to a hospital in Lubbock, Texas in critical condition. The 12-year-old suspected shooter, Mason Campbell, a seventh grade student, was apprehended at the scene after he was talked down by a staff member and dropped the shotgun. A staff member received minor injuries. Campbell was charged with three counts of aggravated battery with a deadly weapon. He was sentenced to a maximum sentence of confinement in a juvenile detention facility until he is twenty one years old.[452]",
    "coords": {
      "lat": 33.3942655,
      "lon": -104.5230242
    }
  },
  {
    "Date": "January 17, 2014",
    "Location": "Philadelphia, Pennsylvania !Philadelphia, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "A student allegedly shot two other students in the gymnasium at Delaware Valley Charter School. Both victims, a male and a female, were shot in the arm. They were taken to a nearby hospital and are in stable condition, police say. Police Commissioner Charles Ramsey said at a news conference that the shooter ran out of the school after the shooting but was taken into custody near his home. 17-year-old Raisheem Rochwell was arrested and charged as an adult for aggravated assault, recklessly endangering another person and firearms offenses. Rochwell was sentenced to two years of juvenile detention.[453]",
    "coords": {
      "lat": 39.9525839,
      "lon": -75.1652215
    }
  },
  {
    "Date": "January 20, 2014",
    "Location": "Chester, Pennsylvania !Chester, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "One person was critically injured at Widener University. The incident occurred around 10 p.m. outside the university sport’s complex and led to an 8-hour university lock-down. The suspect was not immediately found.[454]",
    "coords": {
      "lat": 39.849557,
      "lon": -75.3557457
    }
  },
  {
    "Date": "January 21, 2014",
    "Location": "West Lafayette, Indiana !West Lafayette, Indiana",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A 21-year-old student, Andrew Boldt, was killed in a classroom building on the campus of Purdue University. 24-year-old student Cody Cousins was found guilty of the murder and was sentenced to sixty-five years of prison. In October 2014, Cousins committed suicide in his cell.[455]",
    "coords": {
      "lat": 40.4258686,
      "lon": -86.90806549999999
    }
  },
  {
    "Date": "January 24, 2014",
    "Location": "Orangeburg, South Carolina !Orangeburg, South Carolina",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A 20-year-old student was killed at South Carolina State University. A 19-year-old was arrested and charged with murder.[456]",
    "coords": {
      "lat": 33.4918203,
      "lon": -80.8556476
    }
  },
  {
    "Date": "January 25, 2014",
    "Location": "Los Angeles, California !Los Angeles, California",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A man was killed at Los Angeles Valley College. Two suspects were arrested in the fatal shooting.[457]",
    "coords": {
      "lat": 34.0522342,
      "lon": -118.2436849
    }
  },
  {
    "Date": "January 27, 2014",
    "Location": "Carbondale, Illinois !Carbondale, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A group of students at Rebound High School got in an argument in the school's parking lot. One student pulled out a gun and shot another student in the ensuing altercation. An 18-year-old suspect is facing charges of attempted murder.[458]",
    "coords": {
      "lat": 37.7272727,
      "lon": -89.2167501
    }
  },
  {
    "Date": "January 28, 2014",
    "Location": "Nashville, Tennessee !Nashville, Tennessee",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "One student was shot in the leg in an apparent altercation over a gambling debt at Tennessee State University.[459]",
    "coords": {
      "lat": 36.1626638,
      "lon": -86.7816016
    }
  },
  {
    "Date": "January 30, 2014",
    "Location": "Palm Bay, Florida !Palm Bay, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Three students were fighting in a parking lot of Eastern Florida State College and one pulled out a gun and shot another of the students. All three students claimed self-defense.[460]",
    "coords": {
      "lat": 28.0344621,
      "lon": -80.5886646
    }
  },
  {
    "Date": "January 31, 2014",
    "Location": "Des Moines, Iowa !Des Moines, Iowa",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "After a basketball game at North High School, there was gunfire in a parking lot of the school. Six males in a black jeep had come moments before the shooting and returned at the time it happened. A 15-year-old girl was injured by a ricocheting bullet. While officers were gaining control of the area, teachers on the scene led students into the school building for safety.[461]",
    "coords": {
      "lat": 41.6005448,
      "lon": -93.6091064
    }
  },
  {
    "Date": "February 10, 2014",
    "Location": "Salisbury, North Carolina !Salisbury, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 16-year-old student was shot in the stomach on the campus of Salisbury High School during a dispute in the school gym. 17-year-old suspect was charged with assault with a deadly weapon with intent to kill inflicting serious injury, possession of a firearm on school property and discharging a weapon on school property.[462]",
    "coords": {
      "lat": 35.6709727,
      "lon": -80.4742261
    }
  },
  {
    "Date": "February 10, 2014",
    "Location": "Lyndhurst, Ohio !Lyndhurst, Ohio",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "Five shots were fired in the parking lot of Charles F. Brush High School, including one which hit an unoccupied police car. No one was reported to be injured, though a school basketball game was going on at the time.[463]",
    "coords": {
      "lat": 41.5200523,
      "lon": -81.4887315
    }
  },
  {
    "Date": "February 12, 2014",
    "Location": "Los Angeles, California !Los Angeles, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A male victim was shot in the back in a possible gang-related drive-by shooting near the University of Southern California. The suspect fled into the University Campus. The victim was last reported in stable condition before being transported to a local hospital.[464]",
    "coords": {
      "lat": 34.0522342,
      "lon": -118.2436849
    }
  },
  {
    "Date": "February 22, 2014",
    "Location": "Augusta, Georgia !Augusta, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A shooting involving a campus police officer occurred at a Georgia Regents University dormitory complex. A male suspect entered a vehicle and nearly struck an officer, who opened fire. The suspect was taken to Georgia Regents Medical Center with injuries that were not believed to be critical.[465]",
    "coords": {
      "lat": 33.4734978,
      "lon": -82.0105148
    }
  },
  {
    "Date": "March 12, 2014",
    "Location": "Miami, Florida !Miami, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "An elementary school teacher was killed outside The Academy of Knowledge Preschool by her husband.",
    "coords": {
      "lat": 25.7616798,
      "lon": -80.1917902
    }
  },
  {
    "Date": "March 25, 2014",
    "Location": "College Park, Georgia !College Park, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "An argument between students led to shots being fired in a Benjamin Banneker High School parking lot during the afternoon. Investigators believe multiple people were present when shots were fired, but it was not known how many could face charges for the incident. No one was injured in the shooting.[466]",
    "coords": {
      "lat": 33.6534427,
      "lon": -84.4493725
    }
  },
  {
    "Date": "April 9, 2014",
    "Location": "Greenville, North Carolina !Greenville, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "Just after the lunch hour, at D. H. Conley High School, a car drove past the school and witnesses said an occupant reached out of a car window and fired shots in the direction of the school. This incident occurred on Worthington and Tull Roads, directly in front of the school. No one was injured.[467]",
    "coords": {
      "lat": 35.612661,
      "lon": -77.3663538
    }
  },
  {
    "Date": "April 11, 2014",
    "Location": "Detroit, Michigan !Detroit, Michigan",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "After a Friday evening student awards ceremony called \"Grammy Night\", four men who were affiliated with a gang fired into a crowd in the parking lot of East English Village Preparatory Academy. One 19-year-old, Darryl Smith, was fatally shot in the head. Smith was not a student at the academy.[468]",
    "coords": {
      "lat": 42.331427,
      "lon": -83.0457538
    }
  },
  {
    "Date": "May 4, 2014",
    "Location": "Augusta, Georgia !Augusta, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Two men fired shots inside a dormitory at Paine College on Sunday, injuring one student in the head. Neither of the suspects were students at the college.[469]",
    "coords": {
      "lat": 33.4734978,
      "lon": -82.0105148
    }
  },
  {
    "Date": "May 5, 2014",
    "Location": "Augusta, Georgia !Augusta, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "An active shooter situation was reported at Paine College on Monday with one person reported to be shot. The suspect was apparently apprehended and in custody. It was the second shooting incident to occur at the college campus in two days.[470]",
    "coords": {
      "lat": 33.4734978,
      "lon": -82.0105148
    }
  },
  {
    "Date": "May 8, 2014",
    "Location": "Lawrenceville, Georgia !Lawrenceville, Georgia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A person was shot on a student parking lot roof at Georgia Gwinnett College, receiving an injury. The specific cause has not been identified.[471]",
    "coords": {
      "lat": 33.9562149,
      "lon": -83.9879625
    }
  },
  {
    "Date": "May 14, 2014",
    "Location": "Richmond, California !Richmond, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 14-year-old student was injured during a drive-by shooting in front of John F. Kennedy High School at 8:30 a.m.. He was shot as he was running towards the school campus after a fight took place. The student suffered a serious but stable injury to his leg. Police are searching for a suspect.[472]",
    "coords": {
      "lat": 37.9357576,
      "lon": -122.3477486
    }
  },
  {
    "Date": "June 5, 2014",
    "Location": "Seattle, Washington !Seattle, Washington",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "19-year-old students, Paul Lee and Sarah Williams, and 24-year-old student, Thomas Fowler, were shot inside a hallway of Otto Miller Hall at Seattle Pacific University.[473] Freshman Lee was rushed to Harborview Medical Center but later died. The shooter was subdued with pepper spray and tackled to the ground by student building monitor, Jon Meis, as he paused to reload his shotgun. 26-year-old Aaron Rey Ybarra was arrested at the scene and has been charged with premeditated and attempted murder.[474]",
    "coords": {
      "lat": 47.6062095,
      "lon": -122.3320708
    }
  },
  {
    "Date": "June 10, 2014",
    "Location": "Troutdale, Oregon !Troutdale, Oregon",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0011",
    "Description": "At around 8:30 a.m. shots were fired at Reynolds High School. 14-year-old freshman Emilio Hoffman was killed, a physical education teacher was injured, and the gunman, 15-year-old Jared Padgett, exchanged gunfire with police officers and then committed suicide in a restroom stall.[404][475]",
    "coords": {
      "lat": 45.5392862,
      "lon": -122.3873133
    }
  },
  {
    "Date": "September 9, 2014",
    "Location": "Miami, Florida !Miami, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Towards the end of the school day, one alternative school student in Miami was shot as a small group of students tussled. The injury was minor, requiring hospitalization, and five young adults were later questioned.[476]",
    "coords": {
      "lat": 25.7616798,
      "lon": -80.1917902
    }
  },
  {
    "Date": "September 27, 2014",
    "Location": "Terre Haute, Indiana !Terre Haute, Indiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 20-year-old Indiana State University student was shot by another student on Saturday inside a residence hall. The injuries were not fatal, and a full recovery was expected. The shooter was arrested on the following day.[477]",
    "coords": {
      "lat": 39.4667034,
      "lon": -87.41390919999999
    }
  },
  {
    "Date": "September 30, 2014",
    "Location": "Albemarle, North Carolina !Albemarle, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Two students got in an argument at Albemarle High School around 7:30 a.m. on Tuesday, and one of the students shot the other twice including once in the leg. The student who committed the shooting was allegedly involved in a stabbing of a football player last year at West Montgomery High School, which is only 20 miles (32 km) away in Mount Gilead, North Carolina. The school had held an active shooter training over the summer, which prepared the school for this incident.[478]",
    "coords": {
      "lat": 35.3501426,
      "lon": -80.2000578
    }
  },
  {
    "Date": "September 30, 2014",
    "Location": "Louisville, Kentucky !Louisville, Kentucky",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "One student was injured at Fern Creek Traditional High School. The incident occurred around 1 p.m., reportedly after student became enraged in a hallway and pulled out a gun. The student was arrested later that day.[479]",
    "coords": {
      "lat": 38.2526647,
      "lon": -85.7584557
    }
  },
  {
    "Date": "October 3, 2014",
    "Location": "Fairburn, Georgia !Fairburn, Georgia",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "After a homecoming football game, a fatal shooting of 17-year-old Kristofer Hunter, occurred in the Langston Hughes High School parking lot. The assailant, 18-year-old Eric Dana Johnson Jr., turned himself in a week later.[480]",
    "coords": {
      "lat": 33.5670562,
      "lon": -84.5810418
    }
  },
  {
    "Date": "October 24, 2014",
    "Location": "Marysville, Washington !Marysville, Washington",
    "Deaths": "0,000,0015",
    "Injuries": "0,000,0011",
    "Description": "Marysville Pilchuck High School shooting. 15-year-old freshman, Jaylen Fryberg, shot five students in the school cafeteria of Marysville Pilchuck High School, fatally wounding four, before committing suicide.[404][481]",
    "coords": {
      "lat": 48.0517637,
      "lon": -122.1770818
    }
  },
  {
    "Date": "November 20, 2014",
    "Location": "Tallahassee, Florida !Tallahassee, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0013",
    "Description": "At around 12:40 a.m. EST, a gunman opened fired in or near the Strozier Library at Florida State University. Three people suffered gunshot injuries and were taken to a local area hospital. One was in critical condition, another was in good condition, and the third was shortly released after treatment. The gunman, later identified as Myron May, an alumnus from the school, started firing towards responding police officers and was fatally shot by them on the steps of the library.[482]",
    "coords": {
      "lat": 30.4382559,
      "lon": -84.28073289999999
    }
  },
  {
    "Date": "November 20, 2014",
    "Location": "Miami, Florida !Miami, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0011",
    "Description": "Two teens were shot during a fight at Miami Carol City High School. One of the boys died.[483]",
    "coords": {
      "lat": 25.7616798,
      "lon": -80.1917902
    }
  },
  {
    "Date": "December 5, 2014",
    "Location": "Claremore, Oklahoma !Claremore, Oklahoma",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "38-year-old Thomas Floyd Fees, a former Tulsa police officer, fired two gunshots within the campus of Rogers State University during an attempt to enter a university building, before committing suicide. He had previously been arrested the day before for entering a female student's dormitory room with observable intent to commit a sexual assault.[484]",
    "coords": {
      "lat": 36.3125963,
      "lon": -95.61609
    }
  },
  {
    "Date": "December 12, 2014",
    "Location": "Portland, Oregon !Portland, Oregon",
    "Deaths": "0,000,0010",
    "Injuries": "4",
    "Description": "Rosemary Anderson High School shooting: A gunman shot three students and a man outside Rosemary Anderson High School in north Portland. A 16-year-old girl was in critical condition, while the others suffered minor injuries. Two men, aged eighteen and twenty-two, were arrested in connection with the shooting.[485]",
    "coords": {
      "lat": 45.5230622,
      "lon": -122.6764815
    }
  },
  {
    "Date": "January 15, 2015",
    "Location": "Milwaukee, Wisconsin !Milwaukee, Wisconsin",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "A 15-year-old boy, a student's father, and a teacher were each injured in the school parking lot at Wisconsin Lutheran High School. The student had unspecified injuries that were treated. The father was shot in the knee and the teacher was grazed in the toe. A 36-year-old man was charged in the shooting.[486]",
    "coords": {
      "lat": 43.0389025,
      "lon": -87.9064736
    }
  },
  {
    "Date": "January 16, 2015",
    "Location": "Ocala, Florida !Ocala, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Two were injured in gunfire that occurred after a Friday night basketball game. One was injured directly by a bullet, the other by ricocheting glass.[487]",
    "coords": {
      "lat": 29.1871986,
      "lon": -82.14009229999999
    }
  },
  {
    "Date": "February 4, 2015",
    "Location": "Frederick, Maryland !Frederick, Maryland",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Two students were shot near the gymnasium of Frederick High School during a junior varsity (JV) boys' basketball game. Approximately two hundred students, staff, and faculty were placed on lockdown for several hours after the shooting while police searched for the suspects. No suspects have been apprehended, although witnesses report seeing four black males dressed all in black who are considered by police to be suspects in this shooting.[488]",
    "coords": {
      "lat": 39.41426879999999,
      "lon": -77.4105409
    }
  },
  {
    "Date": "February 14, 2015",
    "Location": "Merced, California !Merced, California",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A teenager was found killed in the parking lot of Tenaya Middle School. The shooting was reported to have occurred after school hours.[489]",
    "coords": {
      "lat": 37.3021632,
      "lon": -120.4829677
    }
  },
  {
    "Date": "February 23, 2015",
    "Location": "Daytona Beach, Florida !Daytona Beach, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "Two students argued outside the music building at Bethune-Cookman University when one pulled out a gun. Both had guns and it is not disclosed who did the shooting, injuring three students. A reward was offered to help solve this case.[490]",
    "coords": {
      "lat": 29.2108147,
      "lon": -81.0228331
    }
  },
  {
    "Date": "March 30, 2015",
    "Location": "University City, Missouri !University City, Missouri",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Police said one person has been arrested for a shooting at Pershing Elementary School. The shooting occurred in the parking lot, with a 34-year-old-man being shot in the buttocks.[491]",
    "coords": {
      "lat": 38.6682407,
      "lon": -90.3324856
    }
  },
  {
    "Date": "April 13, 2015",
    "Location": "Goldsboro, North Carolina !Goldsboro, North Carolina",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A faculty member was killed with a rifle in the school library of Wayne Community College. The suspected 20-year-old gunman, Kenneth Stancil, was arrested in Florida the next day. As of January 2017, Stancil, an admitted Neo-Nazi is being investigated for a hate crime.[492]",
    "coords": {
      "lat": 35.3848841,
      "lon": -77.9927651
    }
  },
  {
    "Date": "April 16, 2015",
    "Location": "Paradis, Louisiana !Paradis, Louisiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A police officer was shot outside a school in a school zone while he was directing school buses into J.B. Martin Middle School, and the suspect was apprehended at the scene.[493]",
    "coords": {
      "lat": 29.8796513,
      "lon": -90.4339715
    }
  },
  {
    "Date": "April 27, 2015",
    "Location": "Lacey, Washington !Lacey, Washington",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "A 15-year-old student at North Thurston High School walked into the commons area and fired two shots into the ceiling from a .357 magnum pistol. Brady Olson, a teacher at the school, was able to tackle the student before they could turn the gun on other students. No one was injured or killed. The student is facing charges of firing and possessing a gun on school property.[494]",
    "coords": {
      "lat": 47.03426289999999,
      "lon": -122.8231915
    }
  },
  {
    "Date": "May 12, 2015",
    "Location": "Jacksonville, Florida !Jacksonville, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Police report that a 16-year-old shot five bullets into a school bus and injured two students. Apparently, there was an argument that touched on previous events.[495]",
    "coords": {
      "lat": 30.3321838,
      "lon": -81.65565099999999
    }
  },
  {
    "Date": "May 24, 2015",
    "Location": "Flint, Michigan !Flint, Michigan",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0017",
    "Description": "In the early morning hours of Memorial Day weekend, a group of people were at Southwestern Classical Academy in the parking lot. Shots rang out and seven were injured, with two men being apprehended and charged.[496]",
    "coords": {
      "lat": 43.0125274,
      "lon": -83.6874562
    }
  },
  {
    "Date": "August 27, 2015",
    "Location": "Savannah, Georgia !Savannah, Georgia",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "22-year-old student Christopher Starks was fatally shot in a student union building at Savannah State University. The shooter has not been identified.[497]",
    "coords": {
      "lat": 32.0835407,
      "lon": -81.09983419999999
    }
  },
  {
    "Date": "September 3, 2015",
    "Location": "Sacramento, California !Sacramento, California",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "A man was arguing with at least one other person escalated into a physical fight on the parking lot of Sacramento City College. A man opened fire, killing a 25-year-old student and wounding two others. The shooting suspect has not been arrested.[498]",
    "coords": {
      "lat": 38.5815719,
      "lon": -121.4943996
    }
  },
  {
    "Date": "September 14, 2015",
    "Location": "Cleveland, Mississippi !Cleveland, Mississippi",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "A geography professor at Delta State University fatally shot a fellow history professor. The geography professor was chased by police and eventually died of a self-inflicted gunshot wound.[499]",
    "coords": {
      "lat": 33.7440023,
      "lon": -90.7248187
    }
  },
  {
    "Date": "September 30, 2015",
    "Location": "Harrisburg, South Dakota !Harrisburg, South Dakota",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A principal was shot in the arm and wounded at Harrisburg High School after an argument with a student. The suspect, a 16-year-old student at the school, was taken into custody and is charged with first-degree attempted murder.[500]",
    "coords": {
      "lat": 43.4313663,
      "lon": -96.69727
    }
  },
  {
    "Date": "October 1, 2015",
    "Location": "Roseburg, Oregon !Roseburg, Oregon",
    "Deaths": "0,000,00110",
    "Injuries": "0,000,0019",
    "Description": "Umpqua Community College shooting: At around 10:40 a.m. PDT, a gunman, identified as 26-year-old student Christopher Harper-Mercer, opened fire in a hall on the Umpqua Community College campus, killing eight students and one teacher, and injuring nine others. Mercer then committed suicide after engaging responding police officers in a brief gunfight.[501]",
    "coords": {
      "lat": 43.216505,
      "lon": -123.3417381
    }
  },
  {
    "Date": "October 9, 2015",
    "Location": "Flagstaff, Arizona !Flagstaff, Arizona",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0013",
    "Description": "One student died and three others were wounded in a shooting at Northern Arizona University. It is unclear what sparked the shooting, which took place near Mountain View Hall, a dormitory that houses most of the campus' students involved in Greek organizations. An 18-year-old student was arrested and charged with murder and aggravated assault.[502]",
    "coords": {
      "lat": 35.1982836,
      "lon": -111.651302
    }
  },
  {
    "Date": "October 9, 2015",
    "Location": "Houston, Texas !Houston, Texas",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0011",
    "Description": "One person died and another person was injured after someone opened fire outside a Texas Southern University dorm.[503]",
    "coords": {
      "lat": 29.7604267,
      "lon": -95.3698028
    }
  },
  {
    "Date": "October 22, 2015",
    "Location": "Nashville, Tennessee !Nashville, Tennessee",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0013",
    "Description": "One person was killed and three others were wounded in a shooting at an outdoor courtyard at Tennessee State University. The shooting may have stemmed from an argument over a dice game. A suspect has not been identified or arrested.[504]",
    "coords": {
      "lat": 36.1626638,
      "lon": -86.7816016
    }
  },
  {
    "Date": "November 1, 2015",
    "Location": "Winston-Salem, North Carolina !Winston-Salem, North Carolina",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0011",
    "Description": "One person died and another person was injured after someone opened fire on the campus of Winston-Salem State University. A 21-year-old non-student suspect is sought.[505]",
    "coords": {
      "lat": 36.09985959999999,
      "lon": -80.244216
    }
  },
  {
    "Date": "November 20, 2015",
    "Location": "North Las Vegas, Nevada !North Las Vegas, Nevada",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "A 16-year-old student was fatally shot during a fight after school hours that involved multiple people on the campus of Mojave High School.[506]",
    "coords": {
      "lat": 36.1988592,
      "lon": -115.1175013
    }
  },
  {
    "Date": "January 22, 2016",
    "Location": "Indianapolis, Indiana !Indianapolis, Indiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 15-year-old male was shot in the leg and injured during a night-time basketball game at Lawrence Central High School.[507]",
    "coords": {
      "lat": 39.768403,
      "lon": -86.158068
    }
  },
  {
    "Date": "January 29, 2016",
    "Location": "Philadelphia, Pennsylvania !Philadelphia, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "A gunshot was fired during a fight in a stairwell at Franklin High School, and no injuries were reported. Three people were detained.[508]",
    "coords": {
      "lat": 39.9525839,
      "lon": -75.1652215
    }
  },
  {
    "Date": "February 9, 2016",
    "Location": "Muskegon Heights, Michigan !Muskegon Heights, Michigan",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0014",
    "Description": "Four people, including two students, were injured during a basketball game event in the parking lot of Muskegon Heights High School.[509]",
    "coords": {
      "lat": 43.2011264,
      "lon": -86.23894639999999
    }
  },
  {
    "Date": "February 12, 2016",
    "Location": "Glendale, Arizona !Glendale, Arizona",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "Two 15-year-old girls died in an apparent Murder-Suicide at Independence High School.[510]",
    "coords": {
      "lat": 33.5386523,
      "lon": -112.1859866
    }
  },
  {
    "Date": "February 29, 2016",
    "Location": "Middletown, Ohio !Middletown, Ohio",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0014",
    "Description": "15-year-old Cameron Smith, and 14-year-old Cooper Caffrey, were shot when 14-year-old James Austin Hancock, opened fire in the Madison High School cafeteria with a .380 caliber handgun. 15-year-old Brant Murray, and 14-year-old Katherine Douchette, also suffered shrapnel injuries.[511] Hancock was apprehended in a nearby wooded field.[512]",
    "coords": {
      "lat": 39.5150576,
      "lon": -84.39827629999999
    }
  },
  {
    "Date": "April 23, 2016",
    "Location": "Antigo, Wisconsin !Antigo, Wisconsin",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "Two students at a prom at Antigo High School were shot and injured by 18-year-old former student Jakob Wagner. Wagner later exchanged fire with a school resource officer in the school's parking lot, and was captured after being shot and wounded by police. He died hours later in a hospital.",
    "coords": {
      "lat": 45.140245,
      "lon": -89.15233529999999
    }
  },
  {
    "Date": "June 1, 2016",
    "Location": "Los Angeles, California !Los Angeles, California",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "2016 UCLA shooting. Mainak Sarkar, age 38, a Ph.D. student, killed his former professor, William S. Klug, age 39, a professor of mechanical and aerospace engineering, in an engineering building at UCLA. Sarkar then killed himself. Sarkar, who lived in Minnesota, also killed his former wife, Ashley Hasti, age 31, in her Brooklyn Park, Minnesota home.[513][514]",
    "coords": {
      "lat": 34.0522342,
      "lon": -118.2436849
    }
  },
  {
    "Date": "June 8, 2016",
    "Location": "Dorchester, Massachusetts",
    "Deaths": "1",
    "Injuries": "3",
    "Description": "One student was killed and three other individuals were injured when gunfire erupted outside of the Jeremiah Burke High School following a fire-alarm causing an evacuation of the school. Two suspects have been arrested.[515]",
    "coords": {
      "lat": 42.30163049999999,
      "lon": -71.067605
    }
  },
  {
    "Date": "September 9, 2016",
    "Location": "Alpine, Texas !Alpine, Texas",
    "Deaths": "1",
    "Injuries": "2",
    "Description": "A 14-year-old female student shot a 16-year-old girl in an Alpine High School restroom before committing suicide. A police officer accidentally shot another officer during the incident.",
    "coords": {
      "lat": 30.3584919,
      "lon": -103.6610115
    }
  },
  {
    "Date": "September 28, 2016",
    "Location": "Townville, South Carolina !Townville, South Carolina",
    "Deaths": "2",
    "Injuries": "2",
    "Description": "Townville Elementary School shooting: Two students and one teacher were wounded after a teen opened fire at Townville Elementary School. The suspect's father was found dead at his home soon after the shooting. One of the victims, six-year-old Jacob Hall, died 3 days after the shooting.[516][517]",
    "coords": {
      "lat": 34.5637137,
      "lon": -82.8984775
    }
  },
  {
    "Date": "October 11, 2016",
    "Location": "Mobile, Alabama !Mobile, Alabama",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "A student was shot in the abdomen and wounded at Vigor High School. The suspect, a 16-year-old boy, turned himself in and was charged with assault.[518]",
    "coords": {
      "lat": 30.6953657,
      "lon": -88.0398912
    }
  },
  {
    "Date": "October 13, 2016",
    "Location": "Columbus, Ohio !Columbus, Ohio",
    "Deaths": "0",
    "Injuries": "2",
    "Description": "Two students were shot and wounded on the front lawn of Linden McKinley STEM Academy. One was shot in the shoulder, and the other shot in the chest, and were hospitalized in stable condition.[519]",
    "coords": {
      "lat": 39.9611755,
      "lon": -82.99879419999999
    }
  },
  {
    "Date": "October 18, 2016",
    "Location": "San Francisco, California !San Francisco, California",
    "Deaths": "0",
    "Injuries": "4",
    "Description": "Four students were shot outside June Jordan High School for Equity, a San Francisco public high school. One female victim was in critical condition, while three male victims suffered minor injuries. .[520] Two people were arrested in the shooting.[521]",
    "coords": {
      "lat": 37.7749295,
      "lon": -122.4194155
    }
  },
  {
    "Date": "October 25, 2016",
    "Location": "Sandy, Utah",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "Police say the two teens ages 14 and 16 were involved in a confrontation on the far north end of Union Middle School. The boys got into an argument. The argument lead to a shooting. The 14 year old shot the 16 year old twice. He was sent to the hospital in critical but stable condition.[522]",
    "coords": {
      "lat": 40.5649781,
      "lon": -111.8389726
    }
  },
  {
    "Date": "December 1, 2016",
    "Location": "Bountiful, Utah",
    "Deaths": "0",
    "Injuries": "0",
    "Description": "At Mueller Park Junior High School, a 15-year-old student fired one shot into the ceiling and then pointed the weapon at his own neck. The student was confronted verbally by a teacher and another student and later arrested in possession of a shotgun, a handgun, and ammunition for each.[523]",
    "coords": {
      "lat": 40.8893895,
      "lon": -111.880771
    }
  },
  {
    "Date": "January 20, 2017",
    "Location": "West Liberty, Ohio",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "A 17-year-old student was charged with attempted murder and other crimes after bringing a gun to West Liberty-Salem High School and firing two shots at 17-year-old student in a bathroom with a shotgun. The victim was injured. The student was \"also is accused of discharging the weapon in the school’s hallway before returning to the bathroom, where he was eventually taken into custody.\"[524]",
    "coords": {
      "lat": 40.2522771,
      "lon": -83.75576629999999
    }
  },
  {
    "Date": "January 20, 2017",
    "Location": "Seattle, Washington",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "A 34-year-old man was shot in Red Square at University of Washington while protesting the visit of controversial journalist Milo Yiannopoulos. The shooter turned himself in to the university police and later questioned and released without being charged with a crime.[525]",
    "coords": {
      "lat": 47.6062095,
      "lon": -122.3320708
    }
  },
  {
    "Date": "March 21, 2017",
    "Location": "King City, California",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "An 18-year-old King City High School student was shot outside the school's auditorium. The gunman ran across the school's campus and baseball field, and fled the area. The school was then placed on lockdown. The victim was hospitalized with life-threatening injuries.[526] A suspect was arrested in August 2017.[527]",
    "coords": {
      "lat": 36.2127439,
      "lon": -121.1260287
    }
  },
  {
    "Date": "April 10, 2017",
    "Location": "San Bernardino, California",
    "Deaths": "3",
    "Injuries": "1",
    "Description": "North Park Elementary School shooting: Cedric Anderson, age 53, of Riverside, California, died of a self-inflicted gunshot wound after shooting and killing his estranged wife, Karen Elaine Smith, age 53, in a classroom. An eight-year-old student was also fatally shot, and a seven-year-old student was injured.[528]",
    "coords": {
      "lat": 34.1083449,
      "lon": -117.2897652
    }
  },
  {
    "Date": "May 4, 2017",
    "Location": "Irving, Texas",
    "Deaths": "2",
    "Injuries": "0",
    "Description": "North Lake College: Adrian Victor Torres killed a 20-year-old student, Janeera Nickol Gonzalez, whom he was stalking. He fatally shot her three times and the college went into lockdown before discovering that the suspect has died from a self-inflicted gunshot wound.[529]",
    "coords": {
      "lat": 32.8140177,
      "lon": -96.9488945
    }
  },
  {
    "Date": "September 13, 2017",
    "Location": "Rockford, Washington",
    "Deaths": "1",
    "Injuries": "3",
    "Description": "Freeman High School: Three students injured and one killed after a shooter opened fire. The suspect, a 15-year-old student, was taken into police custody.[530]",
    "coords": {
      "lat": 47.45212069999999,
      "lon": -117.1307471
    }
  },
  {
    "Date": "September 20, 2017",
    "Location": "Mattoon, Illinois",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "Mattoon High School: A 14-year-old male student was subdued by a female teacher when he attempted to open fire in the school cafeteria at 11:33 a.m. Multiple shots were fired in the process, and one student was struck in the chest and was driven to a nearby hospital suffering non-life-threatening wounds. The student was taken into custody without further incident.[531][532]",
    "coords": {
      "lat": 39.48308970000001,
      "lon": -88.37282549999999
    }
  },
  {
    "Date": "November 14, 2017",
    "Location": "Rancho Tehama Reserve, California",
    "Deaths": "6",
    "Injuries": "18",
    "Description": "Rancho Tehama Reserve shootings: Neighbor on a rampage injured one student at Rancho Tehama Elementary School and fatally shot five adults at several locations.[533] The secretary heard the gunfire near the school and ordered the school to go on lockdown. After a custodian and the teachers put it into action, 43 year-old Kevin Neal rammed a truck into the gate of the school and fired at the classrooms hitting one student when a bullet pierced the wall. Neal fatally shot himself after sheriff's deputies rammed his vehicle during a pursuit.[533][534]",
    "coords": {
      "lat": 40.0006884,
      "lon": -122.4580469
    }
  },
  {
    "Date": "December 7, 2017",
    "Location": "Aztec, New Mexico",
    "Deaths": "3",
    "Injuries": "0",
    "Description": "Aztec High School shooting: William Atchison, 21-year-old former male student snuck into Aztec High School disguised as a student and hid in an unlocked washroom with a Glock 9mm hidden in his bag. He retreated from the washroom after being spotted by a school custodian who chased him shouting \"active shooter\" and \"lockdown\". Atchinson was able to shoot and kill two students who were caught in the hallway before he killed himself.[535][536] He had been investigated in 2016 by the FBI when he asked \"where to find cheap assault rifles for a mass shooting\" on an online forum.[537][538]",
    "coords": {
      "lat": 36.8222261,
      "lon": -107.9928455
    }
  },
  {
    "Date": "January 9, 2018",
    "Location": "Forest City, Iowa",
    "Deaths": "0",
    "Injuries": "0",
    "Description": "A man shot a pellet gun at a school bus full of children, shattering a window. No one was injured.[539]",
    "coords": {
      "lat": 43.2624685,
      "lon": -93.6371937
    }
  },
  {
    "Date": "January 20, 2018",
    "Location": "Winston-Salem, North Carolina",
    "Deaths": "1",
    "Injuries": "0",
    "Description": "A student was fatally shot on the campus of Wake Forest University.[539]",
    "coords": {
      "lat": 36.09985959999999,
      "lon": -80.244216
    }
  },
  {
    "Date": "January 22, 2018",
    "Location": "Italy, Texas",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "A 16-year-old male student fired at a 15-year-old classmate in the cafeteria of Italy High School. The gunman left the school immediately after opening fire.[540][541][542]",
    "coords": {
      "lat": 32.1840381,
      "lon": -96.8847194
    }
  },
  {
    "Date": "January 22, 2018",
    "Location": "New Orleans, Louisiana",
    "Deaths": "0",
    "Injuries": "1",
    "Description": "Shots were fired from a truck in the parking lot of NET Charter High School, targeting a crowd of students during lunch time. One student was slightly injured, apparently from injuries unrelated to gunfire. One person was arrested in connection with the shooting.[539]",
    "coords": {
      "lat": 29.95106579999999,
      "lon": -90.0715323
    }
  },
  {
    "Date": "January 23, 2018",
    "Location": "Marshall County, Kentucky",
    "Deaths": "2",
    "Injuries": "18",
    "Description": "Marshall County High School shooting: A 15-year-old male student shot 16 people in the lobby at Marshall County High School and caused non-gunshot injuries to 4 others. Two 15-year-old students died: one killed at the scene, another died of wounds at Vanderbilt Medical Center.[543][544][545]",
    "coords": {
      "lat": 36.8573767,
      "lon": -88.4016041
    }
  },
  {
    "Date": "February 1, 2018",
    "Location": "Los Angeles, California",
    "Deaths": "0",
    "Injuries": "5",
    "Description": "Two 15-year-old students, a boy and a girl, were shot and injured inside a classroom at Sal Castro Middle School, which shares a campus with Belmont High School. Three other people suffered injuries unrelated to gunfire. A 12-year-old girl was arrested and put in custody.[546]",
    "coords": {
      "lat": 34.0522342,
      "lon": -118.2436849
    }
  },
  {
    "Date": "February 14, 2018",
    "Location": "Parkland, Florida",
    "Deaths": "0,000,00117",
    "Injuries": "14",
    "Description": "see Marjory Stoneman Douglas High School shooting",
    "coords": {
      "lat": 26.3107774,
      "lon": -80.25322489999999
    }
  },
  {
    "Date": "February 20, 2018",
    "Location": "Jackson Township, Ohio",
    "Deaths": "0,000,0000",
    "Injuries": "0,000,0001",
    "Description": "A male seventh-grade student was taken to the hospital after shooting himself in a bathroom at Jackson Memorial Middle School",
    "coords": {
      "lat": 40.86655,
      "lon": -81.49379929999999
    }
  }
]