[[{"Date":"February 29, 2000","Location":"Flint, Michigan","Deaths":"1","Injuries":"0","Description":"Shooting of Kayla Rolland: At Buell Elementary School, a 6-year-old boy fatally shot 6-year-old classmate Kayla Rolland. To date, the boy is the youngest documented fatal school shooter.[1] See August 22, 2013, below."},{"Date":"May 26, 2000","Location":"Lake Worth, Florida","Deaths":"1","Injuries":"0","Description":"13-year-old honor student, Nathaniel Brazill was sent home for throwing water balloons, but returned to his Lake Worth Middle School with a family pistol. He fatally shot teacher Barry Grunow, who was popular at the school.[1][2]"},{"Date":"June 28, 2000","Location":"Seattle, Washington","Deaths":"2[n 1]","Injuries":"0","Description":"58-year-old Director of the Division of Pathology of the University of Washington Medical Center, Rodger C. Haggitt, was shot dead by 42-year-old Taiwanese immigrant, and then U.S. citizen, Jian Chen, who had just completed his second year of forensic pathology residency training, and had been notified of his contract non-renewal (which Chen wrote would dishonor his family). Chen went on to commit suicide.[3] In 2001 the Rodger C. Haggitt Gastrointestinal Pathology Society was named in memory of Dr. Haggitt."},{"Date":"August 28, 2000","Location":"Fayetteville, Arkansas","Deaths":"2[n 1]","Injuries":"0","Description":"36-year-old James Easton Kelly, a PhD candidate in Comparative Literature at University of Arkansas, killed 67-year-old John R. Locke, the English professor overseeing his coursework. Kelly had been dismissed from this PhD program for lack of progress toward his degree. Kelly shot Locke three times before committing suicide in the director's office, which had been isolated by campus police.[4]"},{"Date":"September 26, 2000","Location":"New Orleans, Louisiana","Deaths":"0","Injuries":"2[n 1]","Description":"13 year-olds Darrel Johnson and Alfred Anderson were initially charged with attempted first-degree murder, in the shooting of 15 year-old William Pennington. Pennington, after being shot, gained control of the gun and shot Johnson in the back.[5] Charges were later reduced to Aggravated Battery.\nTo prevent violence, Carter G. Woodson Middle School had students pass through metal detectors at the time. A 13-year-old student, who recently had been expelled for fighting, slipped the weapon, a .38-caliber revolver, through a chain link fence.[6]"},{"Date":"December 1, 2000","Location":"San Diego, California","Deaths":"0","Injuries":"1[n 1]","Description":"A 15-year-old Junipero Serra High School student who showed off a handgun on campus and threatened to shoot a classmate, ended up accidentally shooting himself, causing minor injuries.[7]"},{"Date":"March 5, 2001","Location":"Santee, California","Deaths":"2","Injuries":"13","Description":"Santana High School shooting: 15-year-old student, Charles Andrew Williams, killed two students, 14-year-old Bryan Zuckor, and 17-year-old Randy Gordon, at Santana High School. In total, he wounded thirteen others. Williams was arrested and convicted of murder and attempted murder. He was sentenced to life with the chance of parole after serving fifty years.[8]"},{"Date":"March 7, 2001","Location":"Williamsport, Pennsylvania","Deaths":"0","Injuries":"1","Description":"14-year-old student, Elizabeth Catherine Bush, wounded fellow student Kimberly Marchese in the cafeteria of Bishop Neumann High School.[9] Bush was released in 2004.[10]"},{"Date":"March 22, 2001","Location":"El Cajon, California","Deaths":"0","Injuries":"6[n 1]","Description":"18-year-old former student, Jason Hoffman, opened fire at Granite Hills High School, injuring five people, before being shot and wounded by a police officer.[11] He was convicted of assault and sentenced to prison, where he committed suicide in 2002.[12]"},{"Date":"March 30, 2001","Location":"Gary, Indiana","Deaths":"1","Injuries":"0","Description":"17-year-old Donald Ray Burt Jr., fatally shot Neal Boyd IV, with one bullet to the head in a parking lot outside Lew Wallace High School.[13] Burt was sentenced to 57 years in prison.[14]"},{"Date":"May 16, 2001","Location":"Parkland, Washington","Deaths":"2[n 1]","Injuries":"0","Description":"40-year-old music instructor and organist James D. Holloway was shot multiple times with a .22-caliber handgun at Pacific Lutheran University by a 55-year-old man from Tacoma. The shooter was not a student or employee of the university and also killed himself. The victim was apparently chosen at random as the shooter had a personal dispute with a different staff member who was not on campus that day.[15]"},{"Date":"January 15, 2002","Location":"New York City, New York","Deaths":"0","Injuries":"2","Description":"17-year-old Vincent Rodriguez wounded two students at Martin Luther King, Jr. High School in Manhattan, with a semi-automatic pistol. He retaliated against the individuals who had harassed his girlfriend. In February 2003, Rodriguez was sentenced to ten years in prison on charges of assault and attempted assault.[16]"},{"Date":"January 16, 2002","Location":"Grundy, Virginia","Deaths":"3","Injuries":"3","Description":"Appalachian School of Law shooting: Recently dismissed graduate student, 42-year-old Peter Odighizuwa, killed three at the Appalachian School of Law. 42-year-old dean, Anthony Sutin, and 41-year-old professor Thomas Blackwell were killed along with 33-year-old student, Angela Dales. Three other students were also wounded.[17] In 2005 Odighizuwa received three life sentences and an additional 28 years without the possibility of parole.[18]"},{"Date":"February 20, 2002","Location":"Milwaukee, Wisconsin","Deaths":"1","Injuries":"0","Description":"16-year-old Washington High School student, Joseph Johnson Jr., was killed by then 22 years old Phillip D. Jackson Jr., when violence erupted between rival supporters in the parking lot, after a basketball game against Vincent High School.[19]"},{"Date":"October 7, 2002","Location":"Bowie, Maryland","Deaths":"0","Injuries":"1","Description":"In the Beltway sniper attacks, one victim of several was 13-year-old Iran Brown, who was wounded as he arrived at Benjamin Tasker Middle School in Bowie, Maryland. His aunt, a nurse who had just dropped him off, rushed him to a hospital emergency room. Despite serious injuries, Brown survived the attack.[20][21] The shooters, Lee Boyd Malvo and John Allen Muhammad, were later convicted of numerous unrelated murders committed during their killing spree. Muhammad was executed in 2009, while Malvo was sentenced to life in prison."},{"Date":"October 28, 2002","Location":"Tucson, Arizona","Deaths":"4[n 1]","Injuries":"0","Description":"Failing nursing college student and Gulf War veteran, 40-year-old Robert Stewart Flores Jr., killed three assistant professors of nursing at the University of Arizona; this included 50-year-old Robin Rogers, 44-year-old Cheryl McGaffic, and 45-year-old Barbara Monroe. Flores finished by turning the gun on himself.[22]"},{"Date":"October 29, 2002","Location":"Jersey City, New Jersey","Deaths":"0","Injuries":"1","Description":"A 15-year-old student was shot in the abdomen and wounded inside the basement of Lincoln High School during an argument with another student. Another 15-year-old student was arrested and charged with attempted murder.[23]"},{"Date":"April 2, 2003","Location":"Washington, D.C.","Deaths":"0","Injuries":"1","Description":"A 10th-grader was shot in the leg near Cardozo high school in Columbia Heights, resulting in a three-hour lockdown at six D.C. public schools to allow for police to search for possible gunmen.[24]"},{"Date":"April 14, 2003","Location":"New Orleans, Louisiana","Deaths":"1","Injuries":"3","Description":"John McDonogh High School shooting. 18-year-old Steven Williams, and 17-year-old James Tate, opened fire with an AK-47 and a handgun in the gymnasium of John McDonogh High School, killing a 15-year-old student and wounding three female students. Williams was sentenced to life imprisonment, and Tate was sentenced to fifteen years.[25][26][27]"},{"Date":"April 24, 2003","Location":"Red Lion, Pennsylvania","Deaths":"2[n 1]","Injuries":"0","Description":"14-year-old student, James Sheets, entered Red Lion Area Junior High School armed with his stepfather's pistols'. He killed the school's principal, Eugene Segro, before killing himself.[28][29]"},{"Date":"May 9, 2003","Location":"Cleveland, Ohio","Deaths":"1","Injuries":"3[n 1]","Description":"On May 9, 2003, Biswanath Halder, a 62-year-old business school alumnus of Case Western Reserve University, killed a graduate student, wounded a professor, and another student using a semi-automatic rifle. He held the building and its nearly 100 occupants hostage for seven hours, and exchanged fire with police and SWAT officers several times during the incident, before being wounded and apprehended by a SWAT team. He was sentenced to life in prison.[30][31]"},{"Date":"September 24, 2003","Location":"Cold Spring, Minnesota","Deaths":"2","Injuries":"0","Description":"Rocori High School shooting: 15-year-old, John Jason McLaughlin, shot 15-year-old freshman Seth Bartell and 17-year-old senior Aaron Rollins at Rocori High School. Rollins was killed immediately, and Bartell died from his wounds sixteen days later. McLaughlin was sentenced to life in prison with the chance of parole in 2038.[1]"},{"Date":"February 2, 2004","Location":"Washington, D.C.","Deaths":"1","Injuries":"1","Description":"Thomas J. Boykin was acquitted of the murder of 17-year-old James Richardson, a football player at Ballou High School in Southeast Washington.[32] An 18-year-old student was also grazed in the leg by a bullet.[33]"},{"Date":"February 9, 2004","Location":"East Greenbush, New York","Deaths":"0","Injuries":"1","Description":"16-year-old Jon W. Romano, in East Greenbush, New York, fired two rounds from a shotgun before wounding a teacher with a third at Columbia High School. He was tackled by the assistant principal and charged with one count of attempted murder.[34][35]"},{"Date":"May 7, 2004","Location":"Randallstown, Maryland","Deaths":"0","Injuries":"4","Description":"Two students were charged with a school shooting that arose from a dispute after a basketball game at Randallstown High School. Four persons were injured, two seriously. One student was paralyzed from the waist down.[36]"},{"Date":"February 8, 2005","Location":"Chicago, Illinois","Deaths":"0","Injuries":"1","Description":"An 18-year-old student at Bowen High School was shot in the leg as she left the school around 2:30 p.m.[37]"},{"Date":"March 2, 2005","Location":"Dover, Tennessee","Deaths":"1","Injuries":"0","Description":"14-year-old Jason Clinard killed his bus driver, 47-year-old Joyce Gregory, as she stopped to pick him up. Gregory had earlier reported Clinard for using snuff on the school bus. Clinard was given a life sentence.[38] but he has since filed for post conviction relief[39]"},{"Date":"March 21, 2005","Location":"Red Lake, Minnesota","Deaths":"10[n 1]","Injuries":"7","Description":"Red Lake shootings: 16-year-old student Jeff Weise, killed his grandfather and grandfather's companion at their home, where he had been living, at the Red Lake Indian Reservation. He then drove to Red Lake Senior High School. Armed with his grandfather's police weapons, Weise killed five students, one teacher and one security guard, wounding seven others, before entering a gunfight with police officers, that resulted in him committing suicide.[40]"},{"Date":"July 18, 2005","Location":"Newark, New Jersey","Deaths":"1","Injuries":"2[n 1]","Description":"After breaking up a fight between a group of youths at Weequahic High School, Special Officer Dwayne Reeves was shot and killed and his partner wounded in the hand by two men who pulled up alongside him in a car. Despite being wounded, Officer Reeves' partner was able to return fire and hit one of the suspects in the stomach. The gunman was convicted of manslaughter and in 2007 was sentenced to 30 years in prison.[41]"},{"Date":"September 13, 2005","Location":"Chicago, Illinois","Deaths":"0","Injuries":"1","Description":"At Harlan Community Academy High School, a fight broke out between two 15-year-old boys in the gymnasium. Christopher Huff took out a pistol, shooting the other youth in the leg. A police officer on duty at the school arrested the gunman. The shooter was charged as an adult with aggravated battery with a firearm.[42]"},{"Date":"November 8, 2005","Location":"Jacksboro, Tennessee","Deaths":"1","Injuries":"2","Description":"Campbell County High School shooting: Inside the Campbell County High School office, 15-year-old Kenneth Bartley, shot the schools then principal, Gary Seale. He shot assistant principals Ken Bruce and Jim Pierce. Bruce later died from his wound. Bartley was sentenced to forty-five years in prison with chance of parole after twenty-nine years.[43][44][45]"},{"Date":"February 23, 2006","Location":"Roseburg, Oregon","Deaths":"0","Injuries":"1","Description":"14-year-old freshman Vincent Wayne Leodoro, shot student 16-year-old Joseph Monti, four times in the back with a handgun at Roseburg High School. Leodoro walked away from the school campus, and was confronted near a restaurant by six police officers. He threatened suicide but was persuaded to surrender.[46] He was found guilty of attempted murder and assault in July 2006, and will be held in prison until he turns twenty five years old.[47]"},{"Date":"March 14, 2006","Location":"Reno, Nevada","Deaths":"0","Injuries":"2","Description":"Pine Middle School shooting: In the hallway of Pine Middle School, 14-year-old James Scott Newman, injured two 14-year-old classmates, Alexander Rueda and Kenzie McKeon, with a revolver belonging to his parents. Two students received minor wounds. Newman was subdued by a physical education teacher. The youth was arrested and charged as an adult for attempted murder, use of a deadly weapon and use of a firearm by a minor.[48] He later pleaded guilty to charges of two counts of battery with a deadly weapon, and was sentenced as a juvenile. Newman was sentenced to house arrest until he completed two-hundred hours of community service.[49]"},{"Date":"August 24, 2006","Location":"Essex Junction, Vermont","Deaths":"2","Injuries":"3[n 1]","Description":"Christopher Williams, 26, shot his girlfriend's mother, Linda Lambesis, 57 at her home and from there he went to Essex Elementary School where Andrea, his girlfriend, worked. After he arrived at the elementary school, which was not in session at the time, he shot and killed Mary Alicia Shanks, 56, and shot Mary Snedeker, 52, nonfatally. He left the school and allegedly shot Chad Johansen, 26 nonfatally. He then turned the gun on himself, but did not die as a result.[50] Williams was sentenced to life in prison without parole in 2008.[51]"},{"Date":"August 30, 2006","Location":"Hillsborough, North Carolina","Deaths":"1","Injuries":"2","Description":"After shooting and killing his father, 18-year-old teenager Alvaro Castillo went to his high school where he wounded two students. He was reportedly obsessed with the Columbine shootings and had written an email to the current Columbine high school principal before committing his own crime.[52] he was sentenced to life without parole.[53]"},{"Date":"September 2, 2006","Location":"Shepherdstown, West Virginia","Deaths":"3[n 1]","Injuries":"0","Description":"49-year-old Douglas W. Pennington, killed himself and his two sons, 26-year-old Logan P. Pennington, 24-year-old Benjamin M. Pennington, during a visit to the campus of Shepherd University.[54][55]"},{"Date":"September 17, 2006","Location":"Pittsburgh, Pennsylvania","Deaths":"0","Injuries":"5","Description":"Five Duquesne University basketball players were shot early Sunday morning during an apparent act of random violence on campus, leaving three hospitalized — two of them in critical condition.[56]"},{"Date":"September 22, 2006","Location":"Washington, D.C.","Deaths":"0","Injuries":"1","Description":"Eugene Huff, 17, and an unnamed 16-year-old male sophomore were arguing at one of Cardozo High School's entrances.  The fight climaxed when Eugene pulled out a handgun and shot his classmate in the leg.  The shooting was captured on the school's surveillance system and witnesses said they heard as many as seven shots.[57][24]"},{"Date":"September 27, 2006","Location":"Bailey, Colorado","Deaths":"2[n 1]","Injuries":"0","Description":"Platte Canyon High School hostage crisis: 53-year-old drifter, Duane Roger Morrison, walked into Platte Canyon High School and took six girls hostage. During the ensuing siege, Morrison sexually assaulted all of the girls. When a SWAT team stormed the classroom, Morrison killed 16-year-old Emily Keyes, then took his own life after being shot and wounded by police.[58]"},{"Date":"September 29, 2006","Location":"Cazenovia, Wisconsin","Deaths":"1","Injuries":"0","Description":"Weston High School shooting: At around 8 a.m., 15-year-old freshman, Eric Hainstock, entered Weston High School. He aimed a 20-gauge shotgun at social studies teacher, Chuck Keller, before it was wrestled from him by school custodian, Dave Thompson. Hainstock then shot 49-year-old high school principal, John Alfred Klang, with a .22 caliber revolver. Klang died later that afternoon.[59][60] Hainstock was charged and convicted of murder, and is serving a life sentence. He will be eligible for parole in 2037.[45][61]"},{"Date":"October 2, 2006","Location":"Nickel Mines, Pennsylvania","Deaths":"6[n 1]","Injuries":"5","Description":"West Nickel Mines School shooting: 32-year-old milk truck driver, Charles Carl Roberts IV, killed five Amish girls and wounded five others before killing himself in an Amish school in the hamlet of Nickel Mines, in Bart Township, Lancaster County.[62]"},{"Date":"October 9, 2006","Location":"Joplin, Missouri","Deaths":"0","Injuries":"0","Description":"13-year-old student Thomas White fired one shot from a MAK-90 rifle at a hallway ceiling at Memorial Middle School. The gunshot struck a water pipe, and nobody was injured. He also tried repeatedly to shoot principal Stephen Gilbreth at near-point-blank range as Gilbreth ushered him out of the school. Joplin police say the attempt was foiled by an improperly seated ammunition magazine in the rifle. The principal was not injured. White was tried as an adult on charges of assault and firearms possession, and in 2009 he was sentenced to ten years of prison.[63]"},{"Date":"January 3, 2007","Location":"Tacoma, Washington","Deaths":"1","Injuries":"0","Description":"18-year-old student Douglas S. Chanthabouly, killed 17-year-old Samnang Kok, in the hallways of Henry Foss High School following a personal disagreement. In 2009, Chanthabouly was sentenced to 23 years in prison on a charge of second-degree murder.[64]"},{"Date":"March 7, 2007","Location":"Compton, California","Deaths":"0","Injuries":"1","Description":"During an argument with several non-students and students, a student was shot in the elbow and wounded in the eating area at Centennial High School. The shooting occurred an hour after classes were dismissed, and students in after-school activities were sent home.[65]"},{"Date":"April 16, 2007","Location":"Blacksburg, Virginia","Deaths":"33[n 1]","Injuries":"23","Description":"Virginia Tech shooting: A 23-year-old student, Seung-Hui Cho, armed with two pistols, a Glock 19 and a Walther P22, killed thirty-two students and faculty members at Virginia Tech and wounded another seventeen students and faculty members in two separate attacks before committing suicide. The first attack was on the second floor of West Ambler Johnston Hall, where he shot a young girl and another student who came to help. He then changed his clothes, recorded multiple videos stating that he \"had to do it for his brothers and sisters\", and made several pictures of himself with hammers, large knives, and guns. He then chained the doors of Norris Hall shut and shot and killed thirty more students and staff. He also shot seventeen more students and staff, wounding them. Six more students were also wounded from non gunshot injuries. He was described as extremely quiet and lonely. During the rampage he wore a black T-shirt, a russet vest, a backwards baseball cap, black military cargo pants, black boots, and grip gloves. The incident is the third deadliest shooting by a lone gunman, and the deadliest school shooting, in modern U.S. history."},{"Date":"September 21, 2007","Location":"Dover, Delaware","Deaths":"1","Injuries":"1","Description":"Two 17-year-old Delaware State University freshmen were shot on campus. One died 32 days later on October 23, from critical injuries sustained in the attack. A suspected perpetrator, Loyer D. Braden, a freshman from East Orange, New Jersey, was arrested and charged with attempted murder; the charges were dismissed in May 2009.[66]"},{"Date":"October 10, 2007","Location":"Cleveland, Ohio","Deaths":"1[n 1]","Injuries":"5","Description":"At SuccessTech alternative high school in downtown Cleveland, 14-year-old student Asa H. Coon shot two students and two teachers in the halls and classrooms on the fourth floor of the building. Coon then moved to another room on the same floor, where he fatally shot himself.[67]"},{"Date":"November 7, 2007","Location":"Miami Gardens, Florida","Deaths":"0","Injuries":"1","Description":"At Miami Carol City Senior High School, a robber shot a teacher, who had been smoking a cigarette outside of the campus building. The 18-year-old robber stole the teacher's wallet and was later arrested. The teacher survived the shooting.[68][69]"},{"Date":"January 23, 2008","Location":"Jonesboro, Arkansas","Deaths":"0","Injuries":"1","Description":"Arkansas State University offensive line-man 20-year Alfred Louis was grazed in the lower left leg when someone fired several rounds from a 9mm handgun at a residence hall. He was treated at a local hospital. Charges were later dismissed against the person accused of firing the shots.[70]"},{"Date":"February 4, 2008","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"1","Description":"At Hamilton High School, a student shot a 16-year-old student in the leg during a classroom argument over rap music. The victim's injury was not life-threatening.[71]"},{"Date":"February 8, 2008","Location":"Baton Rouge, Louisiana","Deaths":"3[n 1]","Injuries":"0","Description":"Latina Williams, a 23-year-old nursing student at Louisiana Technical College killed two classmates and herself in a second floor classroom.[72]"},{"Date":"February 11, 2008","Location":"Miami Gardens, Florida","Deaths":"0","Injuries":"1","Description":"43-year-old 11th grade algebra teacher, Sergio Miranda, was shot by 19-year-old Patrick Lively, outside Miami Carol City Senior High School during a robbery but was expected to survive.[73][74] In 2011, Lively received a life sentence.[75]"},{"Date":"February 11, 2008","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"1","Description":"Following a feud that started off campus earlier in the week, a 19-year-old senior was shot by a 17-year-old sophomore during a gym class held in the cafeteria with about 75 other students at Mitchell High School, before handing the gun to a coach making no attempt to flee. The victim suffered at least two gunshot wounds and was in critical condition, the suspected shooter was in custody. \"He walked up to him, shot him, and made a statement to the coach that 'It's over now,' \", said principal, Daniel Ware.[76]"},{"Date":"February 12, 2008","Location":"Oxnard, California","Deaths":"1","Injuries":"0","Description":"Murder of Larry King: 14-year-old Brandon McInerney, shot 15-year-old Lawrence \"Larry\" King, twice in the head in the computer laboratory of E.O. Green Junior High School. McInerney was apprehended in a nearby neighborhood. King, who was openly homosexual, died two days later. McInerney was initially charged with a hate crime, but that charge was dropped. McInerney pleaded guilty to second-degree murder and was sentenced to 21 years in prison.[77]"},{"Date":"February 14, 2008","Location":"DeKalb, Illinois","Deaths":"6[n 1]","Injuries":"21","Description":"Northern Illinois University shooting: 27-year-old Steven Kazmierczak, shot multiple people with a shotgun in a classroom of Northern Illinois University, killing five and injuring 21, before taking his own life. Kazmierczak was not enrolled at the university, but had attended in the years prior to the attack.[78]"},{"Date":"February 27, 2008","Location":"Little Rock, Arkansas","Deaths":"0","Injuries":"1","Description":"33-year-old James Earl Matthews was shot in the stomach and buttocks at close range with a handgun on the University of Arkansas at little rock campus. He survived. Gerald Pride Jr. was sentenced to 20 years on multiple charges.[70]"},{"Date":"August 14, 2008","Location":"Federal Way, Washington","Deaths":"1","Injuries":"0","Description":"26-year-old Omero Mendez was waiting at the Lakota Middle School campus to pick up his girlfriend's son. He was confronted by 16-year-old Luis F. Cosgaya-Alvarez and two of his friends, driving in an SUV. Cosgaya-Alvarez flashed gang signs at Mendez, and shot him once in the head. Mendez later died of his injuries. Cosgaya-Alvarez was arrested a few days later in Seattle and was charged with murder. Cosgaya-Alvarez pleaded guilty to murder and weapon enhancements, and was sentenced to eighteen years in prison.[79]"},{"Date":"August 21, 2008","Location":"Knoxville, Tennessee","Deaths":"1","Injuries":"0","Description":"At Central High School, 15-year-old Jamar Siler killed 15-year-old Ryan McDonald. In 2011, Siler was sentenced to thirty years in prison after pleading guilty to murder in a plea agreement.[80]"},{"Date":"September 2, 2008","Location":"Willoughby, Ohio","Deaths":"0","Injuries":"0","Description":"A 15-year-old student brought a handgun into South High School, and shot two rounds, one into the ceiling and one shattering a trophy case. The student then put the gun to his head. Then Assistant Principal Jeff Lyons talked the student out of doing any harm."},{"Date":"October 16, 2008","Location":"Detroit, Michigan","Deaths":"1","Injuries":"3","Description":"16-year-old Christopher Walker, was killed, and three other teenagers were seriously wounded during a drive-by shooting near Henry Ford High School, soon after classes let out. Three teenagers were arrested and charged in connection with the shooting. The shooter, 15-year-old William Morton, was sentenced to life without parole, and Devon Bell was sentenced to forty-two years of prison.[81]"},{"Date":"October 26, 2008","Location":"Conway, Arkansas","Deaths":"2","Injuries":"1","Description":"University of Central Arkansas shooting: Four young men fatally shot two students, 18-year-old Ryan Henderson, and 19-year-old Chavares Block, and wounded a 19-year-old campus visitor in the leg, outside the Arkansas Hall dormitory of University of Central Arkansas.[82]"},{"Date":"November 12, 2008","Location":"Fort Lauderdale, Florida","Deaths":"1","Injuries":"0","Description":"15-year-old Amanda Collette, was killed in the hallway at Dillard High School. The shooter, 15-year-old Teah Wimberly, was sentenced to twenty-five years to life on a first-degree murder charge.[83]"},{"Date":"January 9, 2009","Location":"Chicago, Illinois","Deaths":"0","Injuries":"5","Description":"After attendees were leaving a basketball game at Dunbar High School, a truck pulled over and someone inside fired shots at the crowd, wounding five people, three critically. 18-year-old Georgio Dukes, was arrested and charged a week later with five counts of felony aggravated battery with a firearm. Police believe that the attack was gang-related.[84]"},{"Date":"April 26, 2009","Location":"Hampton, Virginia","Deaths":"0","Injuries":"3[n 1]","Description":"18-year-old Odane Greg Maye, a former student of Hampton University, followed a 43-year-old pizza delivery man into his former dormitory. Armed with three guns, Maye wounded the delivery man, then the dorm monitor. Lastly, Maye shot himself in a suicide attempt. He survived and was convicted of two charges of malicious wounding, two counts of using a gun in a felony; burglary; and shooting in an occupied building. He was sentenced to fourteen years of prison in November 2009, and was ordered by a judge to pay more than $62,000 in restitution to his victims for lost wages.[85]"},{"Date":"May 18, 2009","Location":"Cambridge, Massachusetts","Deaths":"1","Injuries":"0","Description":"20-year-old Jabrai Copney, 23-year-old Jason Aquino, and 19-year-old Blayn Jiggetts, of New York City, invited 21-year-old Justin Cosby, of Cambridge, into a Harvard College dormitory. After trying to rob him of a pound of marijuana, they shot him. The victim, Cosby, was pronounced dead early the next day. Copney turned himself in three days later, and was convicted of murder and sentenced to life without parole.[86] His partners pleaded guilty to armed robbery and manslaughter with Jiggetts being sentenced to 9 to 12 years in prison and Aquino being sentenced to 18 to 20 years in prison.[87] His girlfriend, 21-year-old Brittany Smith, pleaded guilty to accessory after the fact, firearm possession, and misleading a grand jury and was sentenced to 3 years in prison.[88][89]"},{"Date":"May 18, 2009","Location":"Larose, Louisiana","Deaths":"1[n 1]","Injuries":"0","Description":"15-year-old Larose-Cut Off Middle School student, Justin Doucet, carried his backpack to a restroom, where he put on camouflage clothes and took out a semi-automatic handgun before storming into a nearby classroom. He attempted to shoot a teacher, Jessica Plaisance, but the gun did not fire. He returned to the restroom and shot himself in the head, dying a week later of his wounds.[90][91]"},{"Date":"June 16, 2009","Location":"San Francisco, California","Deaths":"0","Injuries":"3","Description":"After students were being let out of International Studies Academy on the first day of summer school classes, a man left a car and opened fire, wounding three people, including a 17-year-old female student. An 18-year-old man was arrested for being an accessory in the crime.[92]"},{"Date":"September 3, 2009","Location":"San Bruno, California","Deaths":"0","Injuries":"1","Description":"A 20-year-old student was wounded in the parking lot of Skyline College after an argument between him and other men. The college campus was placed on lockdown. Three San Francisco residents, 18-year-old Germaine B. Benjamin, 20-year-old Dimaryea J. McGhee, and 18-year-old Jacori W. Bender, were each arrested and charged with felony firearm offenses.[93]"}],[{"Date":"February 5, 2010","Location":"Madison, Alabama","Deaths":"1","Injuries":"0","Description":"14-year-old student, Hammad Memon, killed 14-year-old Todd Brown at Discovery Middle School as classes were changing. The shooting was possibly related to gang activity. In May 2013, Memon pleaded guilty to the murder and was sentenced to thirty years of prison. After Memon is released from prison, he is likely to be deported to his native Pakistan.[94]"},{"Date":"February 12, 2010","Location":"Huntsville, Alabama","Deaths":"3","Injuries":"3","Description":"University of Alabama in Huntsville shooting: During a biology department meeting with approximately twelve people in attendance, 44-year-old professor of biology Amy Bishop stood up and opened fire. After killing three and wounding three others, Bishop was pushed out of the meeting room by the survivors after her gun ran out of ammo. After being arrested without incident by the police outside the science building, Bishop denied that the shooting even happened. In 1986, Bishop shot and killed her brother in Braintree, Massachusetts, in an incident ruled an accident. In 1993, Bishop and her husband were questioned after a pipe bomb threat incident toward her lab supervisor.[95]"},{"Date":"February 19, 2010","Location":"DeKalb, Illinois","Deaths":"0","Injuries":"1","Description":"Less than a week after Northern Illinois University solemnly marked the second anniversary of a mass shooting on campus that claimed the lives of five students, the DeKalb school was the scene of further gun violence. 24-year-old NIU student, Brian Mulder, refused entry to 22-year-old Zachary R. Isaacman, when he had tried to follow a female resident into the Stevenson Residence Hall North, where they were living, because he was not a resident. Moments later, while outside the dorm smoking with a friend, Mulder was shot by Isaacman, with a handgun in the leg above the knee. Isaacman tried to flee, but was caught by police within minutes.[96]"},{"Date":"February 23, 2010","Location":"Littleton, Colorado","Deaths":"0","Injuries":"2","Description":"At Deer Creek Middle School, 32-year-old Bruco Strong Eagle Eastwood opened fire from a rifle in a parking lot, and wounded two eighth-graders Reagan Webber and Matt Thieu, before being restrained by 57-year-old Math teacher, David Benke, and held until his arrest. The boy's wounds were critical for the four days following the shooting.[97] In October 2011, Eastwood was found not guilty by reason of insanity.[98][99]"},{"Date":"May 11, 2010","Location":"Bladenboro, North Carolina","Deaths":"0","Injuries":"1","Description":"A West Bladen High School student was shot on campus as students were leaving school for the day. Investigators said the incident started when a fight broke out between two groups of students near the high school's entrance.[100]"},{"Date":"September 8, 2010","Location":"Detroit, Michigan","Deaths":"0","Injuries":"2","Description":"Two students were wounded in front of Mumford High School by 17-year-old Steven Jamal Hare. He was tried as an adult and charged with assault with intent to kill. In 2012, Hare was sentenced to 27 years in prison.[101]"},{"Date":"September 28, 2010","Location":"Austin, Texas","Deaths":"1[n 1]","Injuries":"0","Description":"A 19-year-old sophomore student Colton Tooley, wielding an AK-47 and wearing a ski mask, opened fire and then killed himself in a University of Texas library[102]"},{"Date":"October 1, 2010","Location":"Salinas, California","Deaths":"1","Injuries":"0","Description":"15-year-old student Jose Daniel Cisneros was killed after being shot several times on an athletic field at Alisal High School while walking to school. Police said that the shooting was gang-related.[103]"},{"Date":"October 8, 2010","Location":"Carlsbad, California","Deaths":"0","Injuries":"2","Description":"41-year-old Brendan O'Rourke climbed over a fence and opened fire with a handgun in a playground of Kelly Elementary School, which had 230 students; two second-grade female students were grazed in the arms before O'Rourke was subdued by a construction worker. He was found guilty of seven counts of attempted murder and was sentenced to 189 years to life in prison.[104]"},{"Date":"November 29, 2010","Location":"Marinette, Wisconsin","Deaths":"1[n 1]","Injuries":"0","Description":"15-year-old Samuel Hengel took 23 students and a teacher hostage inside a classroom of Marinette High School for five hours. He had stormed into the class, firing with a handgun at a movie projector. Police persuaded Hengel to release the hostages. After officers entered the building, Hengel shot himself in the head. He died the next day.[105]"},{"Date":"December 6, 2010","Location":"Aurora, Colorado","Deaths":"0","Injuries":"1","Description":"In a gang-related attack outside Aurora Central High School, a 17-year-old girl was paralyzed. She was one of a group of students outside the school. 20-year-old Luis Enrique Guzman-Rincon, had fired shots from a car trying to hit gang rivals. Guzman-Ricon was sentenced to thirty-five years in prison.[106]"},{"Date":"January 5, 2011","Location":"Omaha, Nebraska","Deaths":"2[n 1]","Injuries":"2","Description":"At Millard South High School, 18-year-old student, Robert Butler Jr., killed assistant principal Dr. Vicki Kaspar and wounded principal Curtis Case before opening fire at police in the front office area, causing the school nurse to be wounded by gunshot debris. Butler then drove to a parking lot and shot himself as police cornered him.[107]"},{"Date":"March 25, 2011","Location":"Martinsville, Indiana","Deaths":"0","Injuries":"1","Description":"Michael Phelps, a 15-year-old suspended student, returned to Martinsville West Middle School with a handgun. In the entrance of the school, Phelps shot 15-year-old Chance Jackson twice in the abdomen, critically wounding him. Phelps fled the school and dropped the handgun; he was arrested shortly after. Jackson had to undergo surgery three times to save his life; he suffers from post-traumatic stress disorder. Phelps was convicted of attempted murder in August 2011, and was sentenced to thirty years in prison and five years of probation.[108]"},{"Date":"March 31, 2011","Location":"Houston, Texas","Deaths":"1","Injuries":"5","Description":"Multiple gunmen opened fire during a powder puff football game at Worthing High School. One man, an 18-year-old former student named Tremaine De Ante' Paul, died. Five other people were injured.[109]"},{"Date":"April 19, 2011","Location":"Houston, Texas","Deaths":"0","Injuries":"3[n 1]","Description":"A 6-year-old boy took a semi-automatic pistol in his backpack to Ross Elementary, Later that morning as he and more than 40 other kindergartners were having lunch in a crowded cafeteria, the boy accidentally fired the gun as he was showing it off to friends. The boy, as well as another 6-year-old boy and a 5-year-old girl were injured. Houston police say the gun belonged to a friend of the boy's family.[110]"},{"Date":"May 23, 2011","Location":"Pearl City, Hawaii","Deaths":"0","Injuries":"1","Description":"A 14-year-old male student was accused of firing a handgun on the campus of Highlands Intermediate School, wounding one student. The gunman was arrested on suspicion of attempted murder. Two other suspects were arrested in connection with the shooting.[111]"},{"Date":"August 19, 2011","Location":"Albany, Georgia","Deaths":"0","Injuries":"1","Description":"An Albany State University student was shot on campus.[112]"},{"Date":"September 28, 2011","Location":"Jurupa Valley, California","Deaths":"2[n 1]","Injuries":"0","Description":"64-year-old Donaciano Aguirre fatally shot his 61-year-old wife and teacher's aide, Maria Celia Aguirre, in the parking lot of Patriot High School (California) at 10:40am. He then committed suicide and the school was put on lockdown. After being searched thoroughly, no other victims were found and students were let go late in the afternoon.[113]"},{"Date":"October 24, 2011","Location":"Fayetteville, North Carolina","Deaths":"0","Injuries":"1","Description":"Cape Fear High School shooting: 15-year-old Catilyn Abercrombie, was shot in the neck with a rifle by fellow student, 15-year-old Charles Underwood, at Cape Fear High School. She was hospitalized for two months in a serious condition. Underwood was arrested and charged with attempted murder. He was convicted of attempted first-degree murder and sentenced to fifteen years in prison.[114]"},{"Date":"December 8, 2011","Location":"Blacksburg, Virginia","Deaths":"2[n 1]","Injuries":"0","Description":"22-year-old Ross Truett Ashley, part-time business student at Radford University, killed a police officer engaged in an unrelated traffic stop on the campus of Virginia Tech. He then committed suicide in a nearby parking lot.[115]"},{"Date":"December 9, 2011","Location":"Edinburg, Texas","Deaths":"0","Injuries":"2","Description":"Two students were shot after school at Harwell Middle School in Edinburg, Texas while trying out for their school's basketball team. The shooting allegedly was done by an adult off campus, who was shooting at a target range.[116]"},{"Date":"January 10, 2012","Location":"Houston, Texas","Deaths":"0","Injuries":"1","Description":"A student opened fire with a handgun at North Forest High School, wounding another student. The shooter said that he had been confronted by three students who had been bullying him and he shot in self-defense. He hit a 16-year-old bystander in the leg. The 18-year-old suspect was charged with aggravated assault with a deadly weapon.[117]"},{"Date":"February 23, 2012","Location":"Bremerton, Washington","Deaths":"0","Injuries":"1","Description":"Armin Jahr Elementary School:[118] A 9-year-old boy accidentally set off a firearm in class after slamming his backpack on a desk hitting 8-year-old Amina Kocer-Bowman in the abdomen causing her to spend 8 weeks in a hospital. The boy said he took the gun because he planned to run away from his uncle's house, where he lived, and that he planned to bring a gun with him for protection. The boy's mother, Jamie Lee Chaffin, a felon, eventually pleaded guilty to weapons charges and was sentenced to 14 months in prison.[119][120][121] The boy made a plea agreement with Kitsap County prosecutors, taking responsibility for bringing the handgun school to and was sentenced to a year of court-supervised probation.[121]"},{"Date":"February 27, 2012","Location":"Chardon, Ohio","Deaths":"3","Injuries":"3","Description":"Chardon High School shooting: 17-year-old Thomas \"T. J.\" Lane, took a semi-automatic handgun and a knife to Chardon High School, where he fired ten shots at a group of students sitting in the cafeteria. He killed three boys and wounded three other students. One 16-year-old died immediately, two others died the following day. Lane was arrested early the next morning while standing near his car.[122] He was charged as an adult with murder, attempted murder, and firearms offenses. In March 2013, he was convicted and sentenced to three life sentences without the possibility of parole.[123]"},{"Date":"March 6, 2012","Location":"Jacksonville, Florida","Deaths":"2[n 1]","Injuries":"0","Description":"Shane Schumerth, a fired teacher at Episocpal High School, shot Headmistress Dale Regan before killing himself.[124][125][126][127][128][129][130]"},{"Date":"April 2, 2012","Location":"Oakland, California","Deaths":"7","Injuries":"3","Description":"Oikos University shooting: 43-year-old One L. Goh, was accused of shooting dead seven students with a handgun and wounding three others at Oikos University, a Christian college. He fled the scene, stealing a victim's car, and was apprehended hours later nearby. Goh was charged with seven counts of murder. In January 2013, Goh was determined to be mentally unfit for trial and committed for treatment.[131]"},{"Date":"August 16, 2012","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"2","Description":"Two Hamilton High School students were wounded in the parking lot of the school. The attack was believed to be gang-related.[132]"},{"Date":"August 27, 2012","Location":"Perry Hall, Maryland","Deaths":"0","Injuries":"1","Description":"15-year-old Robert Gladden, fired two shots with a shotgun inside the cafeteria at Perry Hall School. He hit a 17-year-old senior in the lower back, causing critical wounds. The youth has Down syndrome. Gladden was subdued by two school faculty members, and arrested. In February 2013, he was sentenced to thirty-five years in prison on attempted murder charges.[133]"},{"Date":"September 7, 2012","Location":"Normal, Illinois","Deaths":"0","Injuries":"0","Description":"A 14-year-old student fired multiple gunshots in a classroom ceiling at Normal Community High School, and was tackled by a teacher. Nobody was injured. The student was arrested and charged with sixteen felony counts.[134][135]"},{"Date":"October 19, 2012","Location":"Chicago, Illinois","Deaths":"1","Injuries":"0","Description":"18-year-old Banner Academy South student, Terrance Wright, was killed during an attempted robbery. Wright was approached by five would-be robbers as he left the school about 3:40 p.m.. He was shot in the chest as he fought back when one assailant was going through his pockets. Wright had been picked on at his previous high school because he was gay, which led him to transfer to Banner.[136]"},{"Date":"October 31, 2012","Location":"Los Angeles, California","Deaths":"0","Injuries":"4","Description":"At a Halloween party on the University of Southern California campus, an argument escalated and 20-year-old Brandon Spencer, used a handgun to shoot rival gang member, Geno Hall, seven times, critically wounding him. Spencer wounded three other people, none were students at USC, they were hospitalized with less serious injuries. Spencer was arrested just minutes after the shooting, which took place outside USC's Grand Ballroom at around 11:30 p.m.[137] In April 2014, he was convicted of attempted murder and sentenced to forty years to life in prison.[138]"},{"Date":"December 14, 2012","Location":"Newtown, Connecticut","Deaths":"27[n 1]","Injuries":"2","Description":"Sandy Hook Elementary School shooting: 20-year-old Adam Lanza killed twenty-six people and himself. He first killed his mother at their shared home before taking four of her guns and driving to the school, where he killed 20 first-grade children aged six and seven along with six adults, including four teachers, the principal, and the school psychologist. Two other persons were injured. Lanza then killed himself as police arrived at the school.[122][139]"},{"Date":"January 10, 2013","Location":"Taft, California","Deaths":"0","Injuries":"2","Description":"16-year-old student, Bryan Oliver, entered a science classroom of Taft Union High School with a shotgun and opened fire, critically wounding 16-year-old student Bowe Cleveland. He shot at but missed another student. The classroom teacher Ryan Heber convinced Oliver, to drop his weapon. He was later arrested. On January 14, he was charged with two counts of attempted murder and assault with a firearm.[140] He was convicted and accepted a plea deal with a sentence of 27 years and 4 months.[141]"},{"Date":"January 12, 2013","Location":"Detroit, Michigan","Deaths":"0","Injuries":"1","Description":"A 16-year-old Osborn High School student was shot and wounded after a basketball game.[140]"},{"Date":"January 15, 2013","Location":"St. Louis, Missouri","Deaths":"0","Injuries":"2[n 1]","Description":"A 34-year-old gunman wounded an administrator in his office on the fourth floor of Stevens Institute of Business and Arts. The suspected gunman, Sean Johnson, a part-time student, wounded himself in a stairwell. Both the administrator and Johnson were hospitalized in stable conditions. Johnson was convicted of three felony charges, including assault and was sentenced to 60 years in prison.[142][143][144]"},{"Date":"January 15, 2013","Location":"Hazard, Kentucky","Deaths":"3","Injuries":"0","Description":"Two people were killed and a third person was wounded at the parking lot of Hazard Community and Technical College.[145] The third victim, 12-year-old Taylor Cornett, died from her wounds the next day.[146] 21-year-old Dalton Lee Stidham, was arrested and charged with three counts of murder. He was sentenced to life in prison without parole in 2014.[147]"},{"Date":"January 16, 2013","Location":"Chicago, Illinois","Deaths":"1","Injuries":"0","Description":"A 17-year-old boy, Tyrone Lawson, was killed in a parking lot of Chicago State University. The shooting happened after high school basketball games held on the campus, where Lawson had been a spectator. Police arrested two brothers, Michael McNabb, 33, and Brian Hewlett (under the alias Stephen Gilbert), 30 after the shooting and recovered a weapon.[140][148][149]"},{"Date":"January 22, 2013","Location":"Houston, Texas","Deaths":"0","Injuries":"3[n 1]","Description":"Lone Star College–North Harris shooting: Outside Lone Star College–North Harris, two men got into an argument. One wounded the other. He also wounded a maintenance man, and accidentally shot himself in the leg. The shooter fled into the woods and was arrested hours later. The charges against the initial suspect were dropped and another man was arrested.[150]"},{"Date":"January 31, 2013","Location":"Atlanta, Georgia","Deaths":"0","Injuries":"2","Description":"A 14-year-old male student was wounded at Price Middle School. The gunman, a 15-year-old student, was believed to be arguing with the other student before using a handgun to shoot him. A teacher was also wounded. Afterward, the gunman was disarmed by a school resource officer and arrested; police charged him with aggravated assault.[151][152]"},{"Date":"March 18, 2013","Location":"Orlando, Florida","Deaths":"1[n 1]","Injuries":"0","Description":"At the University of Central Florida, 30-year-old student James Oliver Seevakumaran pulled a fire alarm at the Tower One dormitory, to attract a crowd. He pointed a handgun at his roommate and threatened to shoot him in their room; he released the roommate, who ran out and called 9-1-1. Seevakumaran then fatally shot himself in the head. Authorities found an assault weapon, a couple hundred rounds of ammunition and four homemade bombs inside his backpack.[153]"},{"Date":"April 12, 2013","Location":"Christiansburg, Virginia","Deaths":"0","Injuries":"2","Description":"New River Community College shooting incident: Two women were wounded during a shooting at the campus of New River Community College. 18-year-old Neil Allen MacInnis, was taken into custody. In June 2014, he was sentenced to 38 years in prison.[154]"},{"Date":"April 16, 2013","Location":"Grambling, Louisiana","Deaths":"0","Injuries":"3","Description":"Three students were injured on the campus of Grambling State University.[155]"},{"Date":"April 18, 2013","Location":"Cambridge, Massachusetts","Deaths":"1","Injuries":"0","Description":"Three days after committing the Boston Marathon bombing, while still at large, the brothers Dzhokhar Tsarnaev and Tamerlan Tsarnaev shot and killed Massachusetts Institute of Technology campus police officer Sean Collier[156] in his patrol car near MIT's Ray and Maria Stata Center.[157] About three hours after the MIT shooting and after carjacking a vehicle, Tamerlan died in a gunfight with police in Watertown, Massachusetts. Another officer was seriously wounded. Shot in the neck and hiding in a boat parked nearby, Dzhokhar was arrested 18 hours later, and hospitalized in critical condition.[157] He was sentenced to death in 2015."},{"Date":"May 14, 2013","Location":"Birmingham, Alabama","Deaths":"0","Injuries":"0","Description":"Allegedly responding to a student fight, a mother of a student fired a weapon on the campus of Ossie Ware Mitchell Middle School. No one was injured.[158]"},{"Date":"June 7, 2013","Location":"Santa Monica, California","Deaths":"6[n 1]","Injuries":"4","Description":"2013 Santa Monica shooting: 23-year-old John Zawahri, began a killing spree at his home. After killing his 55-year-old father, Samir \"Sam\" Zawahri, and 25-year-old brother, Chris Zawahri, he set the house ablaze. Dressed all in black with body armor and wielding an AR-15-type semi-automatic rifle, Zawahri carjacked 41-year-old Laura Siska, shooting 50-year-old Debra Fine, as she attempted to intervene, before forcing Siska to drive to Santa Monica College. Upon arriving on the college campus, Zawahri began shooting at passing vehicles, including a police car and a city bus, leaving three people with minor injuries. Zawahri next targeted a Ford Explorer, killing the driver, 68-year-old campus groundskeeper, Carlos Navarro Franco, and fatally wounding the passenger, his 26-year-old daughter Marcela Diaz-Franco, a student at the college, who died two days later. 68-year-old Margarita Gomez, who was collecting cans outside the library, died after being shot in the abdomen and chest. Zawahri opened fire on students who were trying to run away. It ended at the college library where he opened fire on students studying for finals, before being fatally wounded in an exchange of gunfire with responding police officers.[159]"},{"Date":"August 20, 2013","Location":"Decatur, Georgia","Deaths":"0","Injuries":"0","Description":"Armed with a 7.62mm AK-47-type assault rifle and nearly 500 rounds of ammunition, 20-year-old Michael Brandon Hill entered the Ronald E. McNair Discovery Learning Academy shortly after 1:00 PM and took several employees hostage in the principal's office. Hill ordered his hostages to call local ABC News affiliate WSB-TV, declaring that he wanted a camera crew to record him killing police officers. When responding law enforcement officers arrived at the school, Hill exited the office and fired six rounds at police, who immediately returned fire; no one was injured in the exchange and Hill returned to the office with his hostages. During the resulting standoff with police, Hill claimed to have a bomb in his car and in the school and repeatedly threatened to kill himself and the hostages. During the standoff, police managed to evacuate the students and staff out the back of the school. Hill was eventually persuaded to surrender by one of the hostages, Antoinette Tuff, who shared stories with him and tried to keep him calm during the siege. After pleading guilty to numerous charges stemming from the incident, Hill was sentenced to 20 years in prison and 20 years of supervised probation in September 2014.[160][161]"},{"Date":"August 22, 2013","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"0","Description":"A 5-year-old kindergarten student fired a handgun in his elementary school cafeteria. The Westside Elementary School student brought the gun to school in his backpack. While waiting for the opening bell in the cafeteria, the gun accidentally discharged one time inside the boy's backpack. There was no evidence of harmful intent and nobody was injured. To date, the boy is the youngest documented school shooter.[162]"},{"Date":"August 23, 2013","Location":"Sardis, Mississippi","Deaths":"1","Injuries":"2","Description":"15-year-old student, Roderick Bobo, was killed during a football game at North Panola High School in what was termed a gang-related shooting. Two others were injured in the shooting. Three men were charged as being responsible for the crime.[163]"},{"Date":"August 30, 2013","Location":"Winston-Salem, North Carolina","Deaths":"0","Injuries":"1","Description":"A 15-year-old male student was shot at Carver High School, at 2:30 p.m.. He was hospitalized with minor injuries.[164] An 18-year-old male student was apprehended without further incident. The suspected gunman is charged with assault with a deadly weapon inflicting serious injury, carrying a concealed gun, possessing and discharging a firearm, and carrying a firearm onto educational property. The shooting was believed related to a dispute between the suspect and the victim.[165]"},{"Date":"October 4, 2013","Location":"Pine Hills, Florida","Deaths":"0","Injuries":"2","Description":"A 16-year-old student was shot in the hip outside Agape Christian Academy after a fight broke out at 2 p.m.. An innocent bystander was hit by a stray bullet or shrapnel. The two victims were treated for minor injuries. The suspected shooter reportedly fled in a car with several other males, and was not caught.[166]"},{"Date":"October 21, 2013","Location":"Sparks, Nevada","Deaths":"2[n 1]","Injuries":"2","Description":"12-year-old seventh-grade student Jose Reyes opened fire with a handgun at the basketball courts of Sparks Middle School, injuring one student in the shoulder. Michael Landsberry, a teacher and veteran, tried to intervene and was killed by Reyes. Reyes also wounded a student trying to help the teacher. Reyes then committed suicide by shooting himself in the head.[122][164] The shooting happened before classes, and the school was evacuated and was closed for the week."},{"Date":"November 2, 2013","Location":"Greensboro, North Carolina","Deaths":"0","Injuries":"1","Description":"A 21-year-old student was wounded at North Carolina A&T State University. The victim was hospitalized for serious but non-life-threatening injuries. The university was temporarily locked down that night. No suspects are in custody.[167]"},{"Date":"November 3, 2013","Location":"Lithonia, Georgia","Deaths":"0","Injuries":"2","Description":"A Stephenson High School student and a janitor were shot in an apparent confrontation between football team members and a group of teens who were not attending the school. Both were innocent bystanders.[168]"},{"Date":"November 13, 2013","Location":"Pittsburgh, Pennsylvania","Deaths":"0","Injuries":"3","Description":"After classes ended, at least one gunman came out of the woods and opened fire on three students as they were walking to their cars at Brashear High School. One student was grazed in the head, another was struck in the neck and shoulder, and a third was hit in the leg and foot. Six people were taken into custody. The shooting is believed to be drug-related.[169]"},{"Date":"December 4, 2013","Location":"Winter Garden, Florida","Deaths":"0","Injuries":"1","Description":"A 15-year-old student was wounded by a 17-year-old student near a soccer field on the campus of West Orange High School. The shooting occurred after a fight broke out between the two students. The 17-year-old suspected shooter was taken into custody several miles away from the school, and is charged with attempted murder, aggravated battery with a firearm, possession of a firearm by a minor and possession of a firearm on school grounds. In October 2014, the shooter was sentenced to twenty-five years in prison.[170]"},{"Date":"December 13, 2013","Location":"Centennial, Colorado","Deaths":"2[n 1]","Injuries":"0","Description":"18-year-old Karl Pierson, shot 17-year-old student Claire Davis in the head, fatally injuring her, in a hallway in Arapahoe High School. Pierson then took his own life.[122] Pierson was armed with a shotgun, three Molotov cocktails, and a machete. His intention was to shoot the librarian who had disciplined him. Claire Davis died from her injuries on December 21, 2013.[171]"},{"Date":"December 19, 2013","Location":"Fresno, California","Deaths":"0","Injuries":"1","Description":"Four teens (16, 16, 16 and 17 years old) entered Edison High School in what was believed as a gang-initiation process. After accosting a 62-year-old woman about a mile away from school grounds, they found an athletic trainer who taught at Edison High and shot him several times in the leg and stomach.[172]"},{"Date":"January 9, 2014","Location":"Jackson, Tennessee","Deaths":"0","Injuries":"1","Description":"A 16-year-old student was charged with bringing a gun to school at Liberty Technology Magnet High School and shooting a classmate in the thigh. The incident occurred outside the front of the school.[173]"},{"Date":"January 13, 2014","Location":"New Haven, Connecticut","Deaths":"0","Injuries":"1","Description":"A 14-year-old boy was shot a few blocks away from the Hillhouse High School athletic facility, after a basketball game, and suffered wounds in his hand and leg.[174]"},{"Date":"January 14, 2014","Location":"Roswell, New Mexico","Deaths":"0","Injuries":"3","Description":"Two people were wounded inside the gymnasium of Berrendo Middle School, at about 8:10 a.m.. An 11-year-old boy and a 13-year-old girl were airlifted to a hospital in Lubbock, Texas in critical condition. The 12-year-old suspected shooter, Mason Campbell, a seventh grade student, was apprehended at the scene after he was talked down by a staff member and dropped the shotgun. A staff member received minor injuries. Campbell was charged with three counts of aggravated battery with a deadly weapon. He was sentenced to a maximum sentence of confinement in a juvenile detention facility until he is twenty one years old.[175]"},{"Date":"January 17, 2014","Location":"Philadelphia, Pennsylvania","Deaths":"0","Injuries":"2","Description":"A student allegedly shot two other students in the gymnasium at Delaware Valley Charter School. Both victims, a male and a female, were shot in the arm. They were taken to a nearby hospital and are in stable condition, police say. Police Commissioner Charles Ramsey said at a news conference that the shooter ran out of the school after the shooting but was taken into custody near his home. 17-year-old Raisheem Rochwell was arrested and charged as an adult for aggravated assault, recklessly endangering another person and firearms offenses. Rochwell was sentenced to two years of juvenile detention.[176]"},{"Date":"January 20, 2014","Location":"Chester, Pennsylvania","Deaths":"0","Injuries":"1","Description":"One person was critically injured at Widener University. The incident occurred around 10 p.m. outside the university sport's complex and led to an 8-hour university lock-down. The suspect was not immediately found.[177]"},{"Date":"January 21, 2014","Location":"West Lafayette, Indiana","Deaths":"1","Injuries":"0","Description":"A 21-year-old student, Andrew Boldt, was killed in a classroom building on the campus of Purdue University. 24-year-old student Cody Cousins was found guilty of the murder and was sentenced to sixty-five years of prison. In October 2014, Cousins committed suicide in his cell.[178]"},{"Date":"January 24, 2014","Location":"Orangeburg, South Carolina","Deaths":"1","Injuries":"0","Description":"A 20-year-old student was killed at South Carolina State University. A 19-year-old was arrested and charged with murder.[179]"},{"Date":"January 25, 2014","Location":"Los Angeles, California","Deaths":"1","Injuries":"0","Description":"A man was killed at Los Angeles Valley College. Two suspects were arrested in the fatal shooting.[180]"},{"Date":"January 27, 2014","Location":"Carbondale, Illinois","Deaths":"0","Injuries":"1","Description":"A group of students at Rebound High School got in an argument in the school's parking lot. One student pulled out a gun and shot another student in the ensuing altercation. An 18-year-old suspect is facing charges of attempted murder.[181]"},{"Date":"January 28, 2014","Location":"Nashville, Tennessee","Deaths":"0","Injuries":"1","Description":"One student was shot in the leg in an apparent altercation over a gambling debt at Tennessee State University.[182]"},{"Date":"January 30, 2014","Location":"Palm Bay, Florida","Deaths":"0","Injuries":"1","Description":"Three students were fighting in a parking lot of Eastern Florida State College and one pulled out a gun and shot another of the students. All three students claimed self-defense.[183]"},{"Date":"January 31, 2014","Location":"Des Moines, Iowa","Deaths":"0","Injuries":"1","Description":"After a basketball game at North High School, there was gunfire in a parking lot of the school. Six males in a black jeep had come moments before the shooting and returned at the time it happened. A 15-year-old girl was injured by a ricocheting bullet. While officers were gaining control of the area, teachers on the scene led students into the school building for safety.[184]"},{"Date":"February 10, 2014","Location":"Salisbury, North Carolina","Deaths":"0","Injuries":"1","Description":"A 16-year-old student was shot in the stomach on the campus of Salisbury High School during a dispute in the school gym. 17-year-old suspect was charged with assault with a deadly weapon with intent to kill inflicting serious injury, possession of a firearm on school property and discharging a weapon on school property.[185]"},{"Date":"February 10, 2014","Location":"Lyndhurst, Ohio","Deaths":"0","Injuries":"0","Description":"Five shots were fired in the parking lot of Charles F. Brush High School, including one which hit an unoccupied police car. No one was reported to be injured, though a school basketball game was going on at the time.[186]"},{"Date":"February 12, 2014","Location":"Los Angeles, California","Deaths":"0","Injuries":"1","Description":"A male victim was shot in the back in a possible gang-related drive-by shooting near the University of Southern California. The suspect fled into the University Campus. The victim was last reported in stable condition before being transported to a local hospital.[187]"},{"Date":"February 22, 2014","Location":"Augusta, Georgia","Deaths":"0","Injuries":"1","Description":"A shooting involving a campus police officer occurred at a Georgia Regents University dormitory complex. A male suspect entered a vehicle and nearly struck an officer, who opened fire. The suspect was taken to Georgia Regents Medical Center with injuries that were not believed to be critical.[188]"},{"Date":"March 25, 2014","Location":"College Park, Georgia","Deaths":"0","Injuries":"0","Description":"An argument between students led to shots being fired in a Benjamin Banneker High School parking lot during the afternoon. Investigators believe multiple people were present when shots were fired, but it was not known how many could face charges for the incident. No one was injured in the shooting.[189]"},{"Date":"April 11, 2014","Location":"Detroit, Michigan","Deaths":"1","Injuries":"0","Description":"After a Friday evening student awards ceremony called \"Grammy Night\", four men who were affiliated with a gang fired into a crowd in the parking lot of East English Village Preparatory Academy. One 19-year-old, Darryl Smith, was fatally shot in the head. Smith was not a student at the academy.[190]"},{"Date":"May 4, 2014","Location":"Augusta, Georgia","Deaths":"0","Injuries":"1","Description":"Two men fired shots inside a dormitory at Paine College on Sunday, injuring one student in the head. Neither of the suspects were students at the college.[191]"},{"Date":"May 5, 2014","Location":"Augusta, Georgia","Deaths":"0","Injuries":"1","Description":"An active shooter situation was reported at Paine College on Monday with one person reported to be shot. The suspect was apparently apprehended and in custody. It was the second shooting incident to occur at the college campus in two days.[192]"},{"Date":"May 8, 2014","Location":"Lawrenceville, Georgia","Deaths":"0","Injuries":"1","Description":"A person was shot on a student parking lot roof at Georgia Gwinnett College, receiving an injury. The specific cause has not been identified.[193]"},{"Date":"May 14, 2014","Location":"Richmond, California","Deaths":"0","Injuries":"1","Description":"A 14-year-old student was injured during a drive-by shooting in front of John F. Kennedy High School at 8:30 a.m.. He was shot as he was running towards the school campus after a fight took place. The student suffered a serious but stable injury to his leg. Police are searching for a suspect.[194]"},{"Date":"June 5, 2014","Location":"Seattle, Washington","Deaths":"1","Injuries":"2","Description":"19-year-old students, Paul Lee and Sarah Williams, and 24-year-old student, Thomas Fowler, were shot inside a hallway of Otto Miller Hall at Seattle Pacific University.[195] Freshman Lee was rushed to Harborview Medical Center but later died. The shooter was subdued with pepper spray and tackled to the ground by student building monitor, Jon Meis, as he paused to reload his shotgun. 26-year-old Aaron Rey Ybarra was arrested at the scene and has been charged with premeditated and attempted murder.[196] Ybarra was convicted in November 2016 and in February 2017 was sentenced to 112 years in prison.[197]"},{"Date":"June 10, 2014","Location":"Troutdale, Oregon","Deaths":"2[n 1]","Injuries":"1","Description":"At around 8:30 a.m. shots were fired at Reynolds High School. 14-year-old freshman Emilio Hoffman was killed, a physical education teacher was injured, and the gunman, 15-year-old Jared Padgett, exchanged gunfire with police officers and then committed suicide in a restroom stall.[122][198]"},{"Date":"September 9, 2014","Location":"Miami, Florida","Deaths":"0","Injuries":"1","Description":"Towards the end of the school day, one alternative school student in Miami was shot as a small group of students tussled. The injury was minor, requiring hospitalization, and five young adults were later questioned.[199]"},{"Date":"September 11, 2014","Location":"Taylorsville, Utah","Deaths":"0","Injuries":"1","Description":"An elementary school teacher with a concealed weapon permit had her gun fire accidentally in a faculty bathroom at Westbrook Elementary School. The bullet shattered a toilet, and fragments of both the bullet and the porcelain injured her leg.[200]"},{"Date":"September 27, 2014","Location":"Terre Haute, Indiana","Deaths":"0","Injuries":"1","Description":"A 20-year-old Indiana State University student was shot by another student on Saturday inside a residence hall. The injuries were not fatal, and a full recovery was expected. The shooter was arrested on the following day.[201]"},{"Date":"September 30, 2014","Location":"Albemarle, North Carolina","Deaths":"0","Injuries":"1","Description":"Two students got in an argument at Albemarle High School around 7:30 a.m. on Tuesday, and one of the students shot the other twice including once in the leg. The student who committed the shooting was allegedly involved in a stabbing of a football player last year at West Montgomery High School, which is only 20 miles (32 km) away in Mount Gilead, North Carolina. The school had held an active shooter training over the summer, which prepared the school for this incident.[202]"},{"Date":"September 30, 2014","Location":"Louisville, Kentucky","Deaths":"0","Injuries":"1","Description":"One student was injured at Fern Creek Traditional High School. The incident occurred around 1 p.m., reportedly after student became enraged in a hallway and pulled out a gun. The student was arrested later that day.[203]"},{"Date":"October 3, 2014","Location":"Fairburn, Georgia","Deaths":"1","Injuries":"0","Description":"After a homecoming football game, a fatal shooting of 17-year-old Kristofer Hunter, occurred in the Langston Hughes High School parking lot. The assailant, 18-year-old Eric Dana Johnson Jr., turned himself in a week later.[204]"},{"Date":"October 24, 2014","Location":"Marysville, Washington","Deaths":"5[n 1]","Injuries":"1","Description":"Marysville Pilchuck High School shooting. 15-year-old freshman, Jaylen Fryberg, shot five students in the school cafeteria of Marysville Pilchuck High School, fatally wounding four, before committing suicide.[122][205]"},{"Date":"November 20, 2014","Location":"Tallahassee, Florida","Deaths":"1[n 1]","Injuries":"3","Description":"At around 12:40 a.m. EST, a gunman opened fired in or near the Strozier Library at Florida State University. Three people suffered gunshot injuries and were taken to a local area hospital. One was in critical condition, another was in good condition, and the third was shortly released after treatment. The gunman, later identified as Myron May, an alumnus from the school, started firing towards responding police officers and was fatally shot by them on the steps of the library.[206]"},{"Date":"November 20, 2014","Location":"Miami, Florida","Deaths":"1","Injuries":"1","Description":"Two teens were shot during a fight at Miami Carol City High School. One of the boys died.[207]"},{"Date":"December 12, 2014","Location":"Portland, Oregon","Deaths":"0","Injuries":"4","Description":"Rosemary Anderson High School shooting: A gunman shot three students and a man outside Rosemary Anderson High School in north Portland. A 16-year-old girl was in critical condition, while the others suffered minor injuries. Two men, aged eighteen and twenty-two, were arrested in connection with the shooting.[208]"},{"Date":"January 15, 2015","Location":"Milwaukee, Wisconsin","Deaths":"0","Injuries":"3","Description":"A 15-year-old boy, a student's father, and a teacher were each injured in the school parking lot at Wisconsin Lutheran High School. The student had unspecified injuries that were treated. The father was shot in the knee and the teacher was grazed in the toe. 36-year-old Michael Riley was charged in the shooting.[209] In June 2016, Riley pled guilty to first degree reckless injury, use of a dangerous weapon, and felon in possession of a firearm and on September 2, 2016, Riley was sentenced to six years in prison and six years of extended supervision.[210]"},{"Date":"January 16, 2015","Location":"Ocala, Florida","Deaths":"0","Injuries":"2","Description":"Two were injured in gunfire that occurred after a Friday night basketball game at Vanguard High School. One was injured directly by a bullet, the other by ricocheting glass.[211]"},{"Date":"February 4, 2015","Location":"Frederick, Maryland","Deaths":"0","Injuries":"2","Description":"Two students were shot near the gymnasium of Frederick High School during a junior varsity (JV) boys' basketball game. Approximately two hundred students, staff, and faculty were placed on lockdown for several hours after the shooting while police searched for the suspects. Brandon Earl Tyler, 21, and Chandler Tristan Davenport, 19 were charged with the shooting.[212][213]"},{"Date":"February 14, 2015","Location":"Merced, California","Deaths":"1","Injuries":"0","Description":"16-year-old Benito Aguirre was found dead in the parking lot of Tenaya Middle School. The shooting was reported to have occurred after school hours.[214][215]"},{"Date":"February 23, 2015","Location":"Daytona Beach, Florida","Deaths":"0","Injuries":"3","Description":"Two students argued outside the music building at Bethune-Cookman University when one pulled out a gun. Both had guns and it is not disclosed who did the shooting, injuring three students. A reward was offered to help solve this case.[216]"},{"Date":"March 30, 2015","Location":"University City, Missouri","Deaths":"0","Injuries":"1","Description":"Police said one person has been arrested for a shooting at Pershing Elementary School. The shooting occurred in the parking lot, with a 34-year-old-man being shot in the buttocks.[217]"},{"Date":"April 13, 2015","Location":"Goldsboro, North Carolina","Deaths":"1","Injuries":"0","Description":"A faculty member was killed with a rifle in the school library of Wayne Community College. The 20-year-old gunman, Kenneth Stancil, was arrested in Florida the next day. As of January 2017, Stancil, an admitted Neo-Nazi is being investigated for a hate crime.[218] Stancil was later sentenced to life without parole for the murder.[219]"},{"Date":"April 16, 2015","Location":"Paradis, Louisiana","Deaths":"0","Injuries":"1","Description":"A police officer was shot outside a school in a school zone while he was directing school buses into J.B. Martin Middle School, and the suspect was apprehended at the scene.[220]"},{"Date":"May 12, 2015","Location":"Jacksonville, Florida","Deaths":"0","Injuries":"2","Description":"Police report that a 16-year-old shot five bullets into a school bus and injured two students. Apparently, there was an argument that touched on previous events.[221]"},{"Date":"May 14, 2015","Location":"Vallejo, California","Deaths":"1","Injuries":"0","Description":"A student, 17, was killed in a robbery on a trail by the campus of Jesse M. Bethel High School; two men were arrested, non-students of the school, and sentenced to 21 years for manslaughter."},{"Date":"May 24, 2015","Location":"Flint, Michigan","Deaths":"0","Injuries":"7","Description":"In the early morning hours of Memorial Day weekend, a group of people were at Southwestern Classical Academy in the parking lot. Shots rang out and seven were injured, with two men being apprehended and charged.[222]"},{"Date":"August 27, 2015","Location":"Savannah, Georgia","Deaths":"1","Injuries":"0","Description":"22-year-old student Christopher Starks was fatally shot in a student union building at Savannah State University. Justin Stephens was charged with the murder.[223][224]"},{"Date":"September 3, 2015","Location":"Sacramento, California","Deaths":"1","Injuries":"2","Description":"A man was arguing with at least one other person escalated into a physical fight on the parking lot of Sacramento City College. A man opened fire, killing a 25-year-old student and wounding two others. The shooting suspects: Tevita Kaihea and Charlie Hola (both 19 years old) were not arrested for the shooting until December of that year and in 2018 Kaihea was sentenced to 112 years to life in prison and Hola was sentenced to 49 years to life.[225][226][227][228]"},{"Date":"September 30, 2015","Location":"Harrisburg, South Dakota","Deaths":"0","Injuries":"1","Description":"A principal was shot in the arm and wounded at Harrisburg High School after an argument with a student. The suspect, 16-year-old Mason Buhl at the school, was taken into custody and was charged with first-degree attempted murder and sentenced to 25 years with 15 years suspended on supervised probation.[229][230]"},{"Date":"October 1, 2015","Location":"Roseburg, Oregon","Deaths":"10[n 1]","Injuries":"9","Description":"Umpqua Community College shooting: At around 10:40 a.m. PDT, a gunman, later identified as 26-year-old student Christopher Harper-Mercer, opened fire in a hall on the Umpqua Community College campus, killing eight students and one teacher, and injuring nine others. The gunman later committed suicide after engaging responding police officers in a brief gunfight.[231]"},{"Date":"October 9, 2015","Location":"Flagstaff, Arizona","Deaths":"1","Injuries":"3","Description":"Northern Arizona University shooting: One student died and three others were wounded in a shooting at Northern Arizona University. It is unclear what sparked the shooting, which took place near Mountain View Hall, a dormitory that houses most of the campus' students involved in Greek organizations. An 18-year-old student was arrested and charged with murder and aggravated assault.[232]"},{"Date":"October 9, 2015","Location":"Houston, Texas","Deaths":"1","Injuries":"1","Description":"One person died and another person was injured after someone opened fire outside a Texas Southern University dorm.[233]"},{"Date":"October 22, 2015","Location":"Nashville, Tennessee","Deaths":"1","Injuries":"3","Description":"One person was killed and three others were wounded in a shooting at an outdoor courtyard at Tennessee State University. The shooting may have stemmed from an argument over a dice game. A suspect has not been identified or arrested.[234]"},{"Date":"November 1, 2015","Location":"Winston-Salem, North Carolina","Deaths":"1","Injuries":"1","Description":"One person died and another person was injured, after someone opened fire on the campus of Winston-Salem State University. A 21-year-old non-student suspect is sought.[235]"},{"Date":"November 20, 2015","Location":"North Las Vegas, Nevada","Deaths":"1","Injuries":"0","Description":"A 16-year-old student was fatally shot during a fight after school hours that involved multiple people on the campus of Mojave High School.[236]"},{"Date":"January 22, 2016","Location":"Indianapolis, Indiana","Deaths":"0","Injuries":"1","Description":"A 15-year-old male was shot in the leg and injured during a night-time basketball game at Lawrence Central High School.[237]"},{"Date":"January 29, 2016","Location":"Philadelphia, Pennsylvania","Deaths":"0","Injuries":"0","Description":"A gunshot was fired during a fight in a stairwell at Franklin High School, and no injuries were reported. Three people were detained.[238]"},{"Date":"February 9, 2016","Location":"Muskegon Heights, Michigan","Deaths":"0","Injuries":"4","Description":"Four people, including two students, were injured during a basketball game event in the parking lot of Muskegon Heights High School.[239]"},{"Date":"February 12, 2016","Location":"Glendale, Arizona","Deaths":"2[n 1]","Injuries":"0","Description":"Two 15-year-old girls died in an apparent murder-suicide at Independence High School.[240]"},{"Date":"February 29, 2016","Location":"Middletown, Ohio","Deaths":"0","Injuries":"4","Description":"15-year-old Cameron Smith, and 14-year-old Cooper Caffrey, were shot when 14-year-old James Austin Hancock, opened fire in the Madison High School cafeteria with a .380 caliber handgun. 15-year-old Brant Murray, and 14-year-old Katherine Douchette, also suffered shrapnel injuries.[241] Hancock was apprehended in a nearby wooded field.[242]"},{"Date":"April 23, 2016","Location":"Antigo, Wisconsin","Deaths":"1[n 1]","Injuries":"2","Description":"Two students at a prom at Antigo High School were shot and injured by 18-year-old former student Jakob Wagner. Wagner later exchanged fire with a school resource officer in the school's parking lot, and was captured after being shot and wounded by police. He died hours later in a hospital."},{"Date":"April 26, 2016","Location":"Dodge City, Kansas","Deaths":"0","Injuries":"0","Description":"Uriel Adame, Juan Buendia, and Jose Guzma were arrested for a shooting at Dodge City Community College. Guzman shot at three students in a campus parking lot. No one was injured, but a car was struck by a gunshot. Guzman was arrested for attempted first degree murder and conspiracy to commit aggravated robbery. Adame and Buenida were arrested for conspiracy to commit first-degree murder and conspiracy to commit aggravated robbery.[243][244]"},{"Date":"June 1, 2016","Location":"Los Angeles, California","Deaths":"3[n 1]","Injuries":"0","Description":"2016 UCLA shooting. Mainak Sarkar, age 38, a Ph.D. student, killed his former professor, William S. Klug, age 39, a professor of mechanical and aerospace engineering, in an engineering building at UCLA. Sarkar then killed himself. Sarkar, who lived in Minnesota, also killed his ex-wife, Ashley Hasti, age 31, in her Brooklyn Park, Minnesota home.[245][246]"},{"Date":"June 8, 2016","Location":"Dorchester, Massachusetts","Deaths":"1","Injuries":"3","Description":"One student was killed and three other individuals were injured when gunfire erupted outside of the Jeremiah Burke High School following a fire-alarm causing an evacuation of the school. Two suspects have been arrested.[247]"},{"Date":"September 9, 2016","Location":"Alpine, Texas","Deaths":"1[n 1]","Injuries":"2","Description":"A 14-year-old female student shot a 16-year-old girl in an Alpine High School restroom before committing suicide. A police officer accidentally shot another officer during the incident.[248]"},{"Date":"September 28, 2016","Location":"Townville, South Carolina","Deaths":"2","Injuries":"2","Description":"Townville Elementary School shooting: Two students and one teacher were wounded after a teen opened fire at Townville Elementary School. The suspect's father was found dead at his home soon after the shooting. One of the victims, six-year-old Jacob Hall, died 3 days after the shooting.[249][250]"},{"Date":"October 11, 2016","Location":"Mobile, Alabama","Deaths":"0","Injuries":"1","Description":"A student was shot in the abdomen and wounded at Vigor High School. The suspect, a 16-year-old boy, turned himself in and was charged with assault.[251]"},{"Date":"October 13, 2016","Location":"Columbus, Ohio","Deaths":"0","Injuries":"2","Description":"Two students were shot and wounded on the front lawn of Linden McKinley STEM Academy. One was shot in the shoulder and the other shot in the chest; both were hospitalized in stable condition.[252]"},{"Date":"October 18, 2016","Location":"San Francisco, California","Deaths":"0","Injuries":"4","Description":"Four students were shot outside June Jordan High School for Equity, a San Francisco public high school. One female victim was in critical condition, while three male victims suffered minor injuries.[253] Two people were arrested in the shooting.[254]"},{"Date":"October 25, 2016","Location":"Sandy, Utah","Deaths":"0","Injuries":"1","Description":"Police say the two teens ages 14 and 16 were involved in a confrontation on the far north end of Union Middle School. The boys got into an argument. The argument lead to a shooting. The 14-year-old shot the 16-year-old twice. He was sent to the hospital in critical but stable condition.[255]"},{"Date":"December 1, 2016","Location":"Bountiful, Utah","Deaths":"0","Injuries":"0","Description":"At Mueller Park Junior High School, a 15-year-old student fired one shot into the ceiling and then pointed the weapon at his own neck. The student was confronted verbally by a teacher and another student and later arrested in possession of a shotgun, a handgun, and ammunition for each and was sentenced to spend time in a Juvenile Justice Services facility.[256][257]"},{"Date":"January 20, 2017","Location":"West Liberty, Ohio","Deaths":"0","Injuries":"1","Description":"A 17-year-old student was charged with attempted murder and other crimes after bringing a gun to West Liberty-Salem High School and firing two shots at a 17-year-old student in a bathroom with a shotgun. The victim was injured. The student \"also is accused of discharging the weapon in the school's hallway before returning to the bathroom, where he was eventually taken into custody.\"[258]"},{"Date":"January 20, 2017","Location":"Seattle, Washington","Deaths":"0","Injuries":"1","Description":"A 34-year-old man was shot in Red Square at University of Washington while protesting the visit of controversial journalist Milo Yiannopoulos. The shooter turned himself in to the university police and was later questioned and released without being charged with a crime.[259]"},{"Date":"January 27, 2017","Location":"Naperville, Illinois","Deaths":"1","Injuries":"0","Description":"A 37-year-old Oswego man,  Matthew Lange, was shot at Scullen Middle School, which is a part of Indian Prairie School District 204, at about 7:30 PM. At the time of the shooting, there were two non-district organizations renting the building out. The victim was killed in his car while waiting to pick his son up from a weekly Polish culture class. The shooter's identity is still unknown.[260][261]"},{"Date":"March 21, 2017","Location":"King City, California","Deaths":"0","Injuries":"1","Description":"An 18-year-old King City High School student was shot outside the school's auditorium. The gunman ran across the school's campus and baseball field, and fled the area. The school was then placed on lockdown. The victim was hospitalized with life-threatening injuries.[262] A suspect was arrested in August 2017.[263]"},{"Date":"April 10, 2017","Location":"San Bernardino, California","Deaths":"3[n 1]","Injuries":"1","Description":"North Park Elementary School shooting: Cedric Anderson, age 53, of Riverside, California, died of a self-inflicted gunshot wound after shooting and killing his estranged wife, Karen Elaine Smith, age 53, in a classroom. An eight-year-old student was also fatally shot, and a seven-year-old student was injured.[264]"},{"Date":"May 4, 2017","Location":"Irving, Texas","Deaths":"2[n 1]","Injuries":"0","Description":"North Lake College: Adrian Victor Torres killed a 20-year-old student, Janeera Nickol Gonzalez, whom he was stalking. He fatally shot her three times and the college went into lockdown before discovering that the suspect had died from a self-inflicted gunshot wound.[265]"},{"Date":"June 14, 2017","Location":"Chicago, Illinois","Deaths":"0[n 1]","Injuries":"2","Description":"Two girls, 7 and 13, were shot and wounded on a playground of Warren Elementary during an end-of-the-year picnic. Police speculated they may have been bystanders.  Three arrests were made.[266]"},{"Date":"September 13, 2017","Location":"Rockford, Washington","Deaths":"1","Injuries":"3","Description":"Freeman High School: Three students were injured and one killed after a shooter opened fire. The suspect was armed with an AR-15 and a Pistol. He shot one student with the AR-15, but the gun jammed so he switched to his pistol. He killed one student after shooting him twice in the stomach and once in the head. He was stopped by a janitor. The suspect, a 15-year-old student, (Caleb Sharpe) was taken into police custody.[267]"},{"Date":"September 20, 2017","Location":"Mattoon, Illinois","Deaths":"0","Injuries":"1","Description":"Mattoon High School: A 14-year-old male student was subdued by a female teacher when he attempted to open fire in the school cafeteria at 11:33 a.m. Multiple shots were fired in the process, and one student was struck in the chest and was driven to a nearby hospital suffering non-life-threatening wounds. The student was taken into custody without further incident.[268][269]"},{"Date":"October 25, 2017","Location":"Grambling, Louisiana","Deaths":"2","Injuries":"0","Description":"Two men were shot and killed on the Grambling State University campus.[270]"},{"Date":"November 13, 2017","Location":"Albany, Georgia","Deaths":"0","Injuries":"2","Description":"Two people were shot on the Albany State University campus.[271]"},{"Date":"November 14, 2017","Location":"Rancho Tehama, California","Deaths":"6[n 1]","Injuries":"18","Description":"Rancho Tehama shootings: Neighbor on a rampage injured one student at Rancho Tehama Elementary School and fatally shot five adults at several locations.[272] The secretary heard the gunfire near the school and ordered the school to go on lockdown. After a custodian and the teachers put it into action, 43 year-old Kevin Neal rammed a truck into the gate of the school and fired at the classrooms hitting one student when a bullet pierced the wall. Neal fatally shot himself after sheriff's deputies rammed his vehicle during a pursuit.[272][273]"},{"Date":"December 7, 2017","Location":"Aztec, New Mexico","Deaths":"3[n 1]","Injuries":"0","Description":"Aztec High School shooting: William Atchison, 21-year-old former male student sneaked into Aztec High School disguised as a student and hid in an unlocked washroom with a Glock 9mm handgun hidden in his bag. He retreated from the washroom after being spotted by a school custodian who chased him shouting \"active shooter\" and \"lockdown\". Atchinson was able to shoot and kill two students who were caught in the hallway before he killed himself.[274][275] He had been investigated in 2016 by the FBI when he asked \"where to find cheap assault rifles for a mass shooting\" on an online forum.[276]"},{"Date":"January 10, 2018","Location":"Denison, Texas","Deaths":"0","Injuries":"0","Description":"A criminal justice club student picked up a loaded gun, belonging to an advisor, which the student thought was an unloaded training weapon. She then shot at a wall target, unintentionally firing a bullet, which went through the wall and broke a window. The advisor was a licensed peace officer permitted to carry a firearm on campus.[277]"},{"Date":"January 20, 2018","Location":"Winston-Salem, North Carolina","Deaths":"1","Injuries":"0","Description":"A student was fatally shot at a party at 1 a.m. on the campus of Wake Forest University.[278]"},{"Date":"January 22, 2018","Location":"Italy, Texas","Deaths":"0","Injuries":"1","Description":"A 16-year-old male student fired at a 15-year-old female classmate that he had briefly dated in the cafeteria of Italy High School. The gunman left the school immediately after opening fire and was arrested.[279][280][281]"},{"Date":"January 22, 2018","Location":"New Orleans, Louisiana","Deaths":"0","Injuries":"1","Description":"Shots were fired from a truck in the parking lot of NET Charter High School, targeting a crowd of students during lunch time. One student was slightly injured, apparently from injuries unrelated to gunfire. One person was arrested in connection with the shooting.[278]"},{"Date":"January 23, 2018","Location":"Marshall County, Kentucky","Deaths":"2","Injuries":"18","Description":"Marshall County High School shooting: Gabriel Ross Parker,[282] a 15-year-old male student shot 16 people in the lobby at Marshall County High School and caused non-gunshot injuries to four others. Two 15-year-old students died: one killed at the scene, another died of wounds at Vanderbilt Medical Center.[283][284][285]"},{"Date":"January 31, 2018","Location":"Philadelphia, Pennsylvania","Deaths":"1","Injuries":"0","Description":"A fight began in the school parking lot outside a basketball game at Lincoln High School, and the school went into lockdown after shots were fired. A 32-year-old male was transported by private vehicle to Nazareth Hospital with two gunshot wounds in his leg. He was transferred by helicopter to another hospital, but died from his injuries. Police announced that they are searching for an adult male suspect.[286]"},{"Date":"February 1, 2018","Location":"Los Angeles, California","Deaths":"0","Injuries":"5","Description":"Two 15-year-old students, a boy and a girl, were shot and injured inside a classroom at Sal Castro Middle School, which shares a campus with Belmont High School. Three other people suffered injuries unrelated to gunfire. A 12-year-old girl was arrested and charged with negligent discharge of a firearm.[287]"},{"Date":"February 5, 2018","Location":"Oxon Hill, Maryland","Deaths":"0","Injuries":"1","Description":"A student was taken to the hospital after exiting Oxon Hill High School and going to speak to individuals in a vehicle who then attempted to rob, and subsequently shot and wounded him in the school's parking lot. Two other students were arrested and charged with attempted murder and robbery.[288]"},{"Date":"February 9, 2018","Location":"Nashville, Tennessee","Deaths":"0","Injuries":"1","Description":"Pearl-Cohn High School: A student was shot five times in the parking lot.[289]"},{"Date":"February 14, 2018","Location":"Parkland, Florida","Deaths":"17","Injuries":"17","Description":"Marjory Stoneman Douglas High School shooting: A 19-year-old former student (Nikolas Cruz) whose behavior had led to his expulsion began shooting students and staff members with a semi-automatic rifle at Marjory Stoneman Douglas High School. Seventeen people were killed, and 17 others were injured. The suspect shot the students in hallways and classrooms on the first and third floor of the complex. The suspected shooter blended in with the crowd of fleeing students and was arrested in a residential area of neighboring Coral Springs after walking away from the school.[290] He was later charged with murder and attempted murder.[291] The suspect had sat down at a McDonald's, then went to a nearby Subway."},{"Date":"February 24, 2018","Location":"Savannah, Georgia","Deaths":"1","Injuries":"0","Description":"Savannah State University: A non-student was shot on campus and later died.[292]"},{"Date":"February 27, 2018","Location":"Itta Bena, Mississippi","Deaths":"0","Injuries":"1","Description":"Mississippi Valley State University: A person was shot in a recreation center. The injury was not life-threatening.[293]"},{"Date":"February 27, 2018","Location":"Norfolk, Virginia","Deaths":"0","Injuries":"1","Description":"Norfolk State University: A student was shot from an adjacent dorm room while doing homework. He was not seriously injured.[294]"},{"Date":"March 2, 2018","Location":"Mount Pleasant, Michigan","Deaths":"2","Injuries":"0","Description":"Central Michigan University shooting: 19-year-old student James Eric Davis Jr. shot and killed his mother and father when they came to campus to take him home for spring break. After the shooting Davis fled and the campus was placed on lockdown. Around 15 hours later police arrested him and took him to a local hospital. The incident disrupted the travel plans of students and campus activities for several days. Davis was charged with two counts of murder and one count of unlawful possession of a firearm used to commit murder however the judge found Davis insane and was put in a Psychiatric facility.[295][296][297][298]"},{"Date":"March 7, 2018","Location":"Birmingham, Alabama","Deaths":"1","Injuries":"2","Description":"Huffman High School: One student was killed and another injured when shots were fired in the school building, prompting the school to go into lockdown shortly after the bell rang for school dismissal. Law enforcement originally labeled the shooting as \"accidental\".[299] Subsequently, 17-year-old male student Michael Barber was charged with manslaughter and was charged as \"being a certain person forbidden to possess a pistol\".[300] Although the school has metal detectors, they were not being used that day.[301] School resource officers were onsite at the time of the shooting.[300] Barber was sentenced to 12 months in jail.[302]"},{"Date":"March 7, 2018","Location":"Jackson, Mississippi","Deaths":"0","Injuries":"1","Description":"Jackson State University: A student was shot inside a dormitory. His injuries were not life-threatening.[303]"},{"Date":"March 8, 2018","Location":"Mobile, Alabama","Deaths":"0","Injuries":"1","Description":"University of South Alabama: One person was hospitalized after a shooting on campus.[304]"},{"Date":"March 9, 2018","Location":"Lexington, Kentucky","Deaths":"0","Injuries":"1[n 1]","Description":"Frederick Douglass High School: A 16-year-old male student unintentionally shot himself with a gun he had smuggled into a classroom, sustaining an injury to his left thumb. Police announced they were charging him with wanton endangerment and possession of a weapon on school property. After the shooting, the school superintendent announced that stationary metal detectors would be installed and all students would be required to enter through them.[305]"},{"Date":"March 13, 2018","Location":"Seaside, California","Deaths":"0","Injuries":"1","Description":"Seaside High School: A teacher accidentally discharged a firearm while teaching a public safety class, injuring one student.[306]"},{"Date":"March 20, 2018","Location":"Great Mills, Maryland","Deaths":"2[n 1]","Injuries":"1","Description":"Great Mills High School: The school was placed on lockdown after a shooting occurred in the morning. A 17-year-old male student, armed with a handgun, shot and fatally injured a female student (with whom he had a prior relationship) and wounded a male student. The student shot himself in the head, fatally, while the school resource officer simultaneously shot at him.\n[307]"},{"Date":"April 12, 2018","Location":"Raytown, Missouri","Deaths":"0","Injuries":"1","Description":"South Middle School: A man was shot in the stomach in the parking lot during a track meet.[308]"},{"Date":"April 20, 2018","Location":"Ocala, Florida","Deaths":"0","Injuries":"1","Description":"Forest High School: A student shot through the door of the school with a Sawed-off shotgun shortly before a national school walkout for gun control measures. The student had recently dropped out and had planned a much more serious school shooting. His injuries were not life-threatening. Sky Bouche, the 19-year-old former student was arrested.[309]"},{"Date":"May 11, 2018","Location":"Palmdale, California","Deaths":"0","Injuries":"1","Description":"Highland High School: A 14-year-old former student allegedly fired a semi-automatic rifle shortly before classes were to begin. A 15-year-old was struck in the shoulder but went into surgery and was expected to recover fully. The suspect ditched the gun in a field and was arrested nearby, and faces a charge of attempted murder.[310]"},{"Date":"May 16, 2018","Location":"Dixon, Illinois","Deaths":"0","Injuries":"1[n 1]","Description":"Dixon High School: A 19-year-old student recently kicked off the football team allegedly fired shots prior to graduation rehearsal. A school resource officer shot the suspect, who suffered non-life-threatening injuries.[311][312]"},{"Date":"May 18, 2018","Location":"Santa Fe, Texas","Deaths":"10","Injuries":"13[n 1]","Description":"Santa Fe High School shooting: The school was evacuated when fire alarms were pulled at 7:45 am after a gunman opened fire on multiple students with a Remington 870 shotgun and a .38 caliber revolver, killing ten people. The accused shooter, 17-year-old Dimitrios Pagourtzis, started shooting in the art room, then went through the art hallway. Responding police officers then engaged Pagourtzis in a gunfight which lasted for 25 minutes, before Pagourtzis was wounded and taken into custody.[313] Multiple IEDs, pressure cookers, Molotov cocktails, pipe bombs, propane tanks, and other homemade explosives were also found around the school and parking lot.[314] Pagourtzis is currently awaiting trial for capital murder and faces a sentence of up to 40 years to life in prison."},{"Date":"May 18, 2018","Location":"Jonesboro, Georgia","Deaths":"1","Injuries":"3","Description":"Mount Zion High School: An argument led to a shooting in a parking lot after a high school graduation ceremony for graduates of Perry Learning Center. Mount Zion High School provided overflow parking for people attending the ceremony.[315]"},{"Date":"May 25, 2018","Location":"Noblesville, Indiana","Deaths":"0","Injuries":"2","Description":"Noblesville West Middle School shooting: Two people were shot and injured in a shooting at Noblesville West Middle School in Noblesville, Indiana. The shooter is an unnamed middle school student who exited his science classroom and re-entered with a gun. When he returned, he shot a female student and the science teacher, identified as Jason Seaman. Seaman was shot in the abdomen, hip, and forearm. The gun was wrestled away by Seaman after both he and the female student were shot.[316][317]"},{"Date":"August 4, 2018","Location":"Edgewood, Maryland","Deaths":"1","Injuries":"0","Description":"19-year-old Thailek Jacob Willis was found in a car in the parking lot of Edgewood High School suffering from a gunshot wound to the upper torso and later died at a local hospital.[318] 15-year-old Jaylin Jerome Brown and 16-year-old Yasin Wallace Powell were later charged with murder and armed robbery as they each were accused of shooting the victim in after attempting to rob him during a drug deal.[319] Brown was found guilty and convicted of second-degree murder, first-degree assault, use of a firearm in the commission of a felony or violent crime, and the possession of a firearm by a person under age 21 and was sentenced to 65 years in prison with all but 20 years suspended and Powell plead guilty to armed robbery and use of a handgun in a felony and was sentenced to 20 years in prison with all but five years suspended.[320][321]"},{"Date":"August 17, 2018","Location":"Wellington, Florida","Deaths":"0","Injuries":"2","Description":"Two people were shot and injured at a football game in Palm Beach Central High School in Wellington, Florida.[322]"},{"Date":"August 20, 2018","Location":"Atlanta, Georgia","Deaths":"0","Injuries":"0","Description":"A shootout erupted on the campus of Georgia State University the night before classes started.[323]"},{"Date":"August 30, 2018","Location":"San Francisco, California","Deaths":"0","Injuries":"1","Description":"One student was injured when two students were joking around about guns, and one student discharged a firearm at Balboa High School in San Francisco, California. 4 students were arrested in this incident, and 2 were allowed to go back to school. The school was on lockdown along with three other schools in the area for two hours.[324]"},{"Date":"September 5, 2018","Location":"Providence, Rhode Island","Deaths":"1","Injuries":"1[n 1]","Description":"William Parsons, a 15-year-old student at Central High School, was shot and killed outside Providence Career and Technical Academy in Providence, Rhode Island. Police said that two young men got into an altercation and shots were fired, hitting the victim, who was uninvolved. The 16-year-old shooter Joel Leocra accidentally shot and injured himself while trying to get away, under a mile from the scene.[325] Leocra was sentenced to life in prison plus 10 years and must serve at least 25 years before being eligible for parole.[326]"},{"Date":"September 10, 2018","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"1","Description":"A teen girl was injured after shots were fired into school bus full of students attending Fairley High School.[327]"},{"Date":"September 11, 2018","Location":"North Las Vegas, Nevada","Deaths":"1","Injuries":"0","Description":"18-year-old student Dalvin Brown was shot at Canyon Springs High School near the baseball field and later died of his injuries at a hospital.[328] 16-year-old Kayin French was arrested in connection to Brown's death shortly after the incident. His trial was scheduled for February 3, 2020.[329]"},{"Date":"October 29, 2018","Location":"Matthews, North Carolina","Deaths":"1","Injuries":"1","Description":"A David W. Butler High School freshman, 16-year-old Jatwan Craig Cuffie, fatally shot sophomore Bobby McKeithen. Cuffie is in custody and charged with first-degree murder.[330][331] Cuffie was sentenced to 80 to 108 months in prison after pleading guilty to manslaughter.[332]"},{"Date":"December 13, 2018","Location":"Richmond, Indiana","Deaths":"1[n 1]","Injuries":"0","Description":"14-year-old Brandon Clegg[333] attempted a shooting on Dennis Intermediate School. He took two guns and threatened to kill his mother's ex-boyfriend if he did not drive him to the school.[334] After his mother called 911, police arrived just before he was able to begin his attack. After exchanging shots with officers, Clegg shot his way through a locked glass door and entered the school, where he continued to shoot at officers. After he was cornered in one of the school's stairwell, Clegg committed suicide by shooting himself.[335]"},{"Date":"January 2, 2019","Location":"Jersey City, New Jersey","Deaths":"0","Injuries":"0","Description":"School resource officer Dana Jackson, assigned to Snyder High School, was cleaning his service weapon when it discharged. No injuries were reported. Jackson was removed from his assignment at the school.[336]"},{"Date":"January 3, 2019","Location":"Miami, Florida","Deaths":"0","Injuries":"0","Description":"Two men were involved in an altercation on the campus of Florida International University when one of the men pulled out a gun and fired into the air. Both men were detained, and no injuries were reported.[337]"},{"Date":"January 4, 2019","Location":"Columbus, Mississippi","Deaths":"0","Injuries":"1","Description":"A former student at the Mississippi University for Women was shot and injured, causing a multi-hour lockdown and a search for a gunman. Police stated they were investigating whether the wound was self-inflicted. No one has been detained in relation to the crime.[338]"},{"Date":"January 7, 2019","Location":"Belmont, California","Deaths":"1","Injuries":"0","Description":"Seventeen-year-old Mohammad Othman was fatally shot in the parking lot of Central Elementary School. Police believe the shooter had a connection to Othman, but neither the shooter nor Othman had a relation to the elementary school.[339]"},{"Date":"January 11, 2019","Location":"Eugene, Oregon","Deaths":"1[n 1]","Injuries":"0","Description":"A man involved in a custody battle arrived at Cascade Middle School and became enraged. As he was being escorted from the school by police, he began struggling and pulled a gun, according to authorities. The man was shot and killed by the officers. No one else was injured.[340]"},{"Date":"January 19, 2019","Location":"Overland Park, Kansas","Deaths":"0","Injuries":"2","Description":"A 16-year-old boy was shot in the head, and a 15-year-old boy was also injured, in a possible robbery incident in a parking lot of Lakewood Middle School in Overland Park, Kansas. The school was not in session at the time. Both victims are expected to recover.[341]"},{"Date":"January 25, 2019","Location":"Mobile, Alabama","Deaths":"0","Injuries":"2","Description":"Two males were wounded after basketball game at Davidson High School, but between Blount High School and Murphy High School, the 15-year-old suspect fled the scene before law enforcement arrived and was not arrested until February 8. His mother was arrested for harboring a fugitive.[342][343]"},{"Date":"January 30, 2019","Location":"Lithonia, Georgia","Deaths":"0","Injuries":"1","Description":"A man running on the Miller Grove High School track saw someone trying to break into his car, which was parked on school property. When the man confronted the person breaking into his car, he was shot once. The man was taken to a local hospital and listed in stable condition.[344]"},{"Date":"January 30, 2019","Location":"Prairie View, Texas","Deaths":"0","Injuries":"0","Description":"Shots were fired at Prairie View A&M University's Village 1 basketball court, according to officials. No injuries were reported. Officials are still searching for suspects.[345]"},{"Date":"January 31, 2019","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"1","Description":"At Manassas High School, a 14-year-old student was shot by a pellet gun.[346]"},{"Date":"January 31, 2019","Location":"Humble, Texas","Deaths":"0","Injuries":"1","Description":"Seventeen-year-old Mikael Neciosup, a student at Atascocita High School, was arrested after shooting a 16-year-old classmate who was trying to buy marijuana from him. The victim suffered wounds to the foot and torso which were not life-threatening. Neciosup posted Snapchat videos mocking deputies and bragging about the shooting as he was being arrested. He was charged with aggravated assault and is being held on bond.[347]"},{"Date":"February 8, 2019","Location":"Baltimore, Maryland","Deaths":"0","Injuries":"1","Description":"A 25-year-old was confronted by an adult staff member of Frederick Douglass High School as to his purpose on being on school grounds. In response, the gunman shot and injured the staff member.[348]"},{"Date":"February 11, 2019","Location":"Seaside, California","Deaths":"0","Injuries":"0","Description":"A student fired a gun in Seaside High School during a verbal altercation with other students. Nobody was injured in the incident.[349]"},{"Date":"February 12, 2019","Location":"Kansas City, Missouri","Deaths":"1","Injuries":"0","Description":"During a basketball game at the Central Academy of Excellence, an argument between two groups led to the groups being escorted out in a staggered fashion. However, as the second group was being escorted out 15-year-old Anjanique Wright in the group was shot and later pronounced dead at the hospital. Two female students (Jamya D. Norfleet, 21 and Taylor McMillon, 18) were charged with her murder.[350][351][352][353] In February 2021 Norfleet pled guilty to second degree murder and unlawful use of a weapon and was sentenced in April to 28 years in prison. McMillon pled guilty in March to voluntary manslaughter and was scheduled for sentencing in June.[354] McMillon ultimately was sentenced to 5 years in prison.[355]"},{"Date":"February 14, 2019","Location":"Rio Rancho, New Mexico","Deaths":"0","Injuries":"0","Description":"Sixteen-year-old student Joshua Owen discharged a single shot in the hallway of Cleveland High School prior to classes beginning. The school was evacuated to a soccer field and then to a nearby arena where students were reunited with their parents. Authorities have not commented on whether Owen was targeting anyone or a possible motive. Owen faced charges of attempted murder, unlawful carrying of a deadly weapon, and unlawful possession of a handgun. Owens suffers from mental illness and was found not fit to stand trial. No injuries were reported.[356][357][353]"},{"Date":"February 17, 2019","Location":"Arapahoe County, Colorado","Deaths":"1","Injuries":"0","Description":"Two adult men in an ongoing dispute about a parking space agreed to meet at Eaglecrest High School to settle the dispute. During the argument, 31-year-old Marcus Johnson produced a handgun and shot 46-year-old Anthony \"T.J.\" Cunningham. Johnson then fled the campus, returned home and called 911 to report the shooting. He was arrested when deputies arrived at his home. Cunningham, a former CU football player drafted by the Seattle Seahawks, died the next day of his wounds. Johnson is charged with first-degree murder.[356][358][359]"},{"Date":"February 26, 2019","Location":"Montgomery, Alabama","Deaths":"0","Injuries":"1","Description":"At Robert E. Lee High School, Michael Woods a 17-year-old student was shot and wounded in the arm. The gunman, a fellow student, had previously shot another student at the school in less than a two-year period.[346][353]"},{"Date":"February 28, 2019","Location":"Cheyenne, Wyoming","Deaths":"0","Injuries":"0","Description":"A 17-year-old student at Cheyenne South High School fired a gun toward an unoccupied vehicle in the school parking lot, shattering its window. The student was arrested on suspicion of discharging a firearm in city limits, misdemeanor possession of marijuana, felony burglary, and larceny. No injuries were reported.[356][360]"},{"Date":"March 7, 2019","Location":"Grambling, Louisiana","Deaths":"0","Injuries":"1","Description":"A Grambling State University student was injured after an accidental discharge in a dorm by a friends gun.[361]"},{"Date":"March 22, 2019","Location":"Blounstville, Alabama","Deaths":"0","Injuries":"1","Description":"A substitute teacher at Blountsville Elementary School, unlawfully brought a small-caliber weapon into the classroom, which discharged while in his pocket. One student reportedly had minor injuries, and the substitute was arrested.[362]"},{"Date":"March 27, 2019","Location":"Holmes County, Mississippi","Deaths":"0","Injuries":"1","Description":"A 10-year-old student was struck in the hand by gunfire that some claim was fired by another student on a Holmes County elementary school bus, while school district officials claim it was a drive-by shooting.[363]"},{"Date":"April 1, 2019","Location":"Prescott, Arkansas","Deaths":"0","Injuries":"1","Description":"A 14-year-old male student with a concealed weapon shot a 14-year-old classmate at Prescott High School in what police described as a \"premeditated attack\". The victim was airlifted to a nearby hospital and is in stable condition. The shooter was apprehended by school resource officers.[364] the shooter was charged as a juvenile[353]"},{"Date":"April 25, 2019","Location":"Texas City, Texas","Deaths":"0","Injuries":"3","Description":"At College of the Mainland, a police cadet student, 21-year-old Clayton Whatley, reached into his backpack and accidentally discharged a loaded handgun.  Two other students were shot in the leg, and a third was grazed.[365]"},{"Date":"April 25, 2019","Location":"Stone Mountain, Georgia","Deaths":"0","Injuries":"10","Description":"At a teen armed with a pellet gun fired at Wynbrooke Elementary School inflicting minor injuries on 10 children. The shooter pled guilty to 10 counts of aggravated assault.[366][367]"},{"Date":"April 30, 2019","Location":"Charlotte, North Carolina","Deaths":"2","Injuries":"4","Description":"University of North Carolina at Charlotte shooting: A shooter on the University of North Carolina at Charlotte campus killed two and injured four on the last day of classes.[368] Riley Howell, a student in the classroom, was credited with stopping the shooter.[346]"},{"Date":"May 4, 2019","Location":"Eugene, Oregon","Deaths":"1","Injuries":"0","Description":"A 21-year-old Lane Community College student was killed outside a fraternity house at the University of Oregon.[369]"},{"Date":"May 6, 2019","Location":"Riverview, Florida","Deaths":"0","Injuries":"0","Description":"A person shot through a window of an elementary school bus with 11 kids inside.[370]"},{"Date":"May 7, 2019","Location":"Highlands Ranch, Colorado","Deaths":"1","Injuries":"8","Description":"STEM School Highlands Ranch shooting: Two shooters killed 1 student and injured 8 others at STEM School Highlands Ranch.[371]"},{"Date":"May 7, 2019","Location":"Savannah, Georgia","Deaths":"0","Injuries":"1","Description":"A man who was not a student at Savannah State University shot and wounded a student at a residence hall.[346]"},{"Date":"May 8, 2019","Location":"Chicago, Illinois","Deaths":"0","Injuries":"1","Description":"A 19-year-old student was shot in the neck and jaw at Second Chance High School when he and two friends were leaving the school by 18-year-old student Andres Salazar who was driving a car. Salazar was charged with attempted first-degree murder and aggravated battery with a firearm.[372]"},{"Date":"May 17, 2019","Location":"Jacksonville, Florida","Deaths":"0","Injuries":"1","Description":"Arthur Davin Jones III, a 19-year-old student shot Shamon Micken, a 16-year-old student at Raines High School. Jones fled the state and was arrested days later in Georgia.[373] Jones is being charged with attempted murder and pled not guilty."},{"Date":"June 21, 2019","Location":"Flint, Michigan","Deaths":"0","Injuries":"1","Description":"During a basketball competition in the gym of Carman-Ainsworth High School during a fight involving dozens of people, shots were fired and Eithan Williams, a 15-year-old student was hit in the chest. Williams left the hospital four days later and doctors said he was lucky to be alive. Four students aged 14–16 were arrested.[374]"},{"Date":"July 2, 2019","Location":"Anchorage, Alaska","Deaths":"0","Injuries":"1","Description":"At Williwaw Elementary School, a fight broke out on the basketball court which resulted in a teen being shot and injured.[375]"},{"Date":"July 19, 2019","Location":"San Diego, California","Deaths":"0","Injuries":"0","Description":"At Monroe Clark Middle School, a teen fired a BB gun at the school, causing minor damage to the campus, then fled the scene, nobody was killed or injured in the incident.[376]"},{"Date":"August 8, 2019","Location":"Montgomery, Alabama","Deaths":"0","Injuries":"0","Description":"38-year-old Isaiah Johnson, dropped his son off at Blount Elementary School, and then got into an argument with another father over a traffic dispute. He discharged a firearm into the father's vehicle.[377][378][379][346]"},{"Date":"August 27, 2019","Location":"Los Angeles, California","Deaths":"0","Injuries":"1","Description":"A Hollenbeck Middle School student was standing in the lunch line was struck in the jaw by a bullet fired from off campus.[380][381]"},{"Date":"August 30, 2019","Location":"Toledo, Ohio","Deaths":"0","Injuries":"1","Description":"As spectators were leaving a football game Central Catholic High School. a 16-year-old boy was shot by another teen, neither of the students attended Central Catholic High School and no fights happened before the shooting, no arrests were made.[382][383]"},{"Date":"August 31, 2019","Location":"Mobile, Alabama","Deaths":"0","Injuries":"10","Description":"17-year-old Deangelo Dejuan Parnell shot 9 people during a confrontation at a stadium where a high school football game was being played. A tenth person suffered a stroke.[384]"},{"Date":"September 6, 2019","Location":"Pittsburgh, Pennsylvania","Deaths":"1","Injuries":"0","Description":"Near the end of a football game at Jeannette High School, Damien Williams and Greg Harper got into an argument outside the stadium, the argument escalated to the point where Williams was shot in the chest by Harper after Williams allegedly punched Harper twice. Williams died and Harper is charged with homicide and reckless endangerment. Harper pled not guilty and is claiming he acted in self-defense.[385]"},{"Date":"September 13, 2019","Location":"Newport News, Virginia","Deaths":"0","Injuries":"3","Description":"After a football game at Todd Stadium, the school stadium, shots were fired and three teens ages 14 and 19 were injured. No arrests have been made.[386]"},{"Date":"September 14, 2019","Location":"Fort Worth, Texas","Deaths":"0","Injuries":"2","Description":"As a youth football game was happening at Eastern Hills High School, parents got into a fight and shots were fired, injuring a woman and her 12-year-old daughter. Thirty-nine-year-old Chanita Holly was arrested and charged with making terroristic threats; a man who was reportedly wearing a skeleton mask is also a suspect in the incident and is believed to be the trigger man.[387]"},{"Date":"September 20, 2019","Location":"Philadelphia, Pennsylvania","Deaths":"0","Injuries":"2","Description":"During the second quarter of a football game between Imhotep Institute Charter High School and Mastery Gratz high school at Marcus memorial stadium, multiple gunshots were fired, a 15-year-old was shot in the thigh and a 14-year-old in the foot. The Police said multiple shell casings were found but it is unclear if the shooting happened in or outside the stadium. No suspects have been arrested.[388]"},{"Date":"September 27, 2019","Location":"Richmond, California","Deaths":"0","Injuries":"3","Description":"As people were leaving a football game at De Anza High School against Pinole Valley High School, police responded to reports of a fight across the street. Three teens were injured with gunshot wounds, two seriously. No arrests were made and police have no motive for the shooting.[389]"},{"Date":"October 13, 2019","Location":"Nashville, Tennessee","Deaths":"1","Injuries":"0","Description":"A 19-year-old student was found unconscious with a bullet wound to his abdomen. Authorities said there were no reports of a shooting or suspicious activity on campus. another student George Wells was later charged with reckless homicide.[390][391]"},{"Date":"October 22, 2019","Location":"Santa Rosa, California","Deaths":"0","Injuries":"1","Description":"A 16-year-old student was shot twice, at least once in the abdomen, by a 17-year-old classmate across the street from Ridgway High School, an alternative school next to Santa Rosa High School. The victim was hospitalized in stable condition. The 17-year-old was arrested in a classroom, and the gun used was found later that night in a bush three miles away. He is charged with attempted murder.[392][393]"},{"Date":"November 5, 2019","Location":"Hazleton, Pennsylvania","Deaths":"0","Injuries":"1","Description":"Four people were charged after a fight at Hazleton Area High School in Luzerne County that left three students hurt, one of them 19-year-old Noberto Polanco-Rodriguez admitted to shooting one of the students with an orange flare gun that caused a serious injury to one of the student's arms and is charged with aggravated assault. Luis Arizmendy-Nunez, 22; Christhofany Maria, 19; and Jose Antonio Vargas,19, were charged with simple assault.[394]"},{"Date":"November 11, 2019","Location":"Baltimore, Maryland","Deaths":"0","Injuries":"1","Description":"A 19-year-old student who was outside Reginald F. Lewis High School was approached by a masked man who shot him in the leg.[395]"},{"Date":"November 13, 2019","Location":"Los Angeles, California","Deaths":"1","Injuries":"0","Description":"A man who was carrying a sword was fatally shot by a deputy at the courtyard of Esteban Torres High School.[396]"},{"Date":"November 14, 2019","Location":"Santa Clarita, California","Deaths":"3[n 1]","Injuries":"3","Description":"Saugus High School shooting: Five people were injured, two fatally, in a shooting at a courtyard of Saugus High School. The shooter, a 16-year-old male student, attempted suicide by shooting himself in the head. He was taken into custody and died the next day during hospitalization. The gun used was suspected by police to be a ghost gun.[397][398]"},{"Date":"November 15, 2019","Location":"Pleasantville, New Jersey","Deaths":"1","Injuries":"2","Description":"Five men opened fire during a playoff game between the Camden Panthers and the Pleasantville Greyhounds at Pleasantville High School, injuring a 15-year-old boy, a 27-year-old male, and fatally injuring a 10-year-old boy. All five were later arrested for the random act of violence however the injured 27 year-old (who is believed to be the shooters target) has also been charged with unlawful possession of a handgun.[399][400][401][353] The alleged shooter Alvin Wyatt has been charged with murder and attempted murder.[393]"},{"Date":"November 23, 2019","Location":"Union City, California","Deaths":"2","Injuries":"0","Description":"Two boys, aged 11 and 14-years-old were shot in the parking lot of the Searles Elementary School around 1 am, while sitting in a minivan. Both boys died of their wounds, one at the scene and the other at the hospital.[402] 18-year-old Jason Cornejo of Castro Valley and a 17-year-old juvenile from Hayward were arrested on February 14, 2020. The shooing had possible gang motivations.[403]"},{"Date":"November 26, 2019","Location":"Salmon Creek, Washington","Deaths":"2[n 1]","Injuries":"1","Description":"At Sarah J. Anderson Elementary school, Keland Hill shot and killed his estranged wife Tiffany and wounded Tiffany's mother in while Tiffany and Keland's three children were with them while they were in a vehicle in the schools parking lot. Tiffany had a restraining order against Keland for domestic violence. Keland shot and killed himself after a short car chase with deputies.[404]"},{"Date":"December 2, 2019","Location":"Waukesha, Wisconsin","Deaths":"0","Injuries":"1[n 1]","Description":"A 17-year-old male student who brought a handgun to Waukesha South High School was shot by a police officer after pointing his gun at him and was in stable condition. The gun was later determined to be a pellet gun.[405]"},{"Date":"December 3, 2019","Location":"Oshkosh, Wisconsin","Deaths":"0","Injuries":"2[n 1]","Description":"Grant Fuhrman, a 16-year-old male student at Oshkosh High School was shot by resource officer Mike Wissink after stabbing him with a barbecue fork and was in stable condition. Fuhrman was charged with attempted intentional homicide.[406][407]"},{"Date":"December 4, 2019","Location":"Jackson, Mississippi","Deaths":"0","Injuries":"1","Description":"An individual who was not a student was shot at the edge of campus by a shooter driving a Honda Accord. This resulted in a campus lockdown. One person was injured and transported to a hospital with non-life-threatening injuries.[408]"},{"Date":"December 16, 2019","Location":"New Haven, Connecticut","Deaths":"0","Injuries":"1","Description":"A man dropping off his child at the Catholic Academy of New Haven was shot and wounded, and 7 of 10 bullets that were fired in the incident struck the school building. A bullet tore into the walls of a pre-school classroom; no children were hurt.[409]"},{"Date":"December 19, 2019","Location":"Naples, Florida","Deaths":"1","Injuries":"0","Description":"A 28-year-old woman was shot and killed at Lely High School and her shooter, 50-year-old Jose Alfredo Avila Pena who was in a relationship with the victim was charged with second-degree murder. The principal of the school said the shooting was the result of a domestic violence incident.[408][410] Pena was sentenced to life in prison.[411]"}],[{"Date":"January 8, 2020","Location":"Belle Glade, Florida","Deaths":"0","Injuries":"1","Description":"An individual who was not a student accidentally shot himself in the leg in the parking lot of Glades Central High School.[412]"},{"Date":"January 11, 2020","Location":"Dallas, Texas","Deaths":"1","Injuries":"1","Description":"A 15-year-old was arrested after two people were wounded by gunfire during a fight at a high school basketball game between South Oak Cliff and Kimball High School. An 18-year-old man was badly wounded in the shooting, and a Dallas ISD police officer was grazed by a bullet fragment. The 15-year-old suspect, who turned himself in at Dallas police headquarters, was initially charged with aggravated assault;[413] however, after the 18-year-old student died from his injuries, the suspect was charged with murder.[414]"},{"Date":"January 14, 2020","Location":"Bellaire, Texas","Deaths":"1","Injuries":"0","Description":"A 19-year-old student was shot in the chest and killed at Bellaire High School. A 16-year-old student was arrested and charged with manslaughter.[415][416]"},{"Date":"January 14, 2020","Location":"Fort Worth, Texas","Deaths":"0","Injuries":"2","Description":"An adult male and a 10-year-old child were injured at North Crowley Ninth Grade Campus after a youth basketball game.[417][418]"},{"Date":"January 23, 2020","Location":"Oxnard, California","Deaths":"0","Injuries":"1","Description":"A stray bullet fired during a street altercation struck a 9-year-old student at McAuliffe Elementary School.[419]"},{"Date":"January 23, 2020","Location":"Saint Thomas, U.S. Virgin Islands","Deaths":"0","Injuries":"0","Description":"A woman fired two shots in the air at the Antilles School before pointing her gun at another woman.[420]"},{"Date":"January 31, 2020","Location":"Antioch, California","Deaths":"1","Injuries":"0","Description":"A 16-year-old student was killed after a large fight broke out after a basketball game at Deer Valley High School.[421]"},{"Date":"February 3, 2020","Location":"Commerce, Texas","Deaths":"2","Injuries":"1","Description":"Jacques Dshawn Smith, 21, gained access to Pride Rock Residence hall at Texas A&M University–Commerce, where he is suspected of shooting his ex-girlfriend Abbaney Matts, 20, and her sister Deja Matts, 19, to death. Abbaney's two-year-old son was also injured during the shooting.[422][423]"},{"Date":"February 4, 2020","Location":"Baton Rouge, Louisiana","Deaths":"1","Injuries":"0","Description":"A 22-year-old employee of the Louisiana Culinary Institute was killed in the institute's parking lot by the ex-boyfriend of his girlfriend. The ex-boyfriend was later arrested, and claimed he did not know the weapon was loaded and planned to use it as a scare tactic.[424]"},{"Date":"March 5, 2020","Location":"Weston, Florida","Deaths":"0","Injuries":"1","Description":"A school security officer was with a school maintenance worker in the parking lot of Sagemount School when he unintentionally shot the worker in the eye. The officer was unauthorized to have the weapon on campus.[425]"},{"Date":"March 11, 2020","Location":"Shenango Township, Pennsylvania","Deaths":"0","Injuries":"2","Description":"A school van carrying seven elementary school students was shot at by Byron Benetas. Two bullets hit the van. Nobody was hit although two children were injured by flying glass. Benetas was arrested a short time after and later pled guilty to aggravated assault and reckless endangerment in exchange for other charges, including attempted murder, being dropped. He was sentenced to three to six years imprisonment and two years' probation.[426][427]"},{"Date":"March 15, 2020","Location":"Humble, Texas","Deaths":"1","Injuries":"0","Description":"A large group of men jumped a fence to gain access to Atascocita High Schools football field, when an argument escalated and a 19-year-old was killed.[428]"},{"Date":"July 27, 2020","Location":"Oro Valley, Arizona","Deaths":"1","Injuries":"0","Description":"A worker fixing the roof of Canyon del Oro High School was fatally wounded after his unholstered weapon accidentally discharged.[429]"},{"Date":"July 29, 2020","Location":"Collinsville, Illinois","Deaths":"0","Injuries":"1","Description":"Responding officers to a report of a student in distress at Collinsville High School, opened fire after a 17-year-old pointed a weapon at them, wounding the teenager.[430]"},{"Date":"September 16, 2020","Location":"Sonora, California","Deaths":"1","Injuries":"0","Description":"At Sonora High School in downtown Sonora, a student named Eric Aguiar, 17, was shot and killed in the High School's parking lot.[431]"},{"Date":"September 16, 2020","Location":"Macomb, Illinois","Deaths":"0","Injuries":"1","Description":"Kavion Poplous, 18, was arrested and charged with attempted first-degree murder, aggravated battery, and aggravated discharge of a firearm in the shooting of a student in a dorm at Western Illinois University.[432][433]"},{"Date":"September 19, 2020","Location":"San Francisco, California","Deaths":"0","Injuries":"0","Description":"At Krouzian-Zekarian-Vasbouragan Armenian School, a shooting happened which was believed to be a hate crime targeting the Armenian people. Nobody was killed or injured in the shooting.[434][435]"},{"Date":"December 17, 2020","Location":"Birmingham, Alabama","Deaths":"1","Injuries":"0","Description":"A 20-year-old University of Alabama at Birmingham student was shot and killed in a campus parking lot outside the student center. Investigators believed the shooting occurred during an arranged meeting to sell headphones.[436]"},{"Date":"February 26, 2021","Location":"New Orleans, Louisiana","Deaths":"1","Injuries":"0","Description":"A Tulane University police officer was shot and killed after trying to break up a fight at a high school basketball game at George Washington Carver High School.[437]"},{"Date":"March 1, 2021","Location":"Pine Bluff, Arkansas","Deaths":"1","Injuries":"0","Description":"A 15-year-old student was killed in a targeted shooting at Watson Chapel Junior High School.[438]"},{"Date":"March 8, 2021","Location":"Chesterfield, South Carolina","Deaths":"0","Injuries":"1","Description":"A woman wounded her son-in-law in the parking lot of Edwards Elementary School while school was in session, before fleeing the area.[439]"},{"Date":"April 12, 2021","Location":"Knoxville, Tennessee","Deaths":"1[n 1]","Injuries":"1","Description":"A student armed with a handgun was shot and killed after a confrontation with a police officer at Austin-East High School. One officer was shot but survived.[440]"},{"Date":"April 26, 2021","Location":"Plymouth, Minnesota","Deaths":"0","Injuries":"0","Description":"An unidentified 6th-grade student fired several shots from a handgun into the ceiling in a hallway within Plymouth Middle School. He was taken into custody by police without incident. There were no reported casualties.[441]"},{"Date":"April 27, 2021","Location":"Smyrna, Delaware","Deaths":"1","Injuries":"0","Description":"A man shot and killed his wife in the parking lot of Smyrna Middle School after an argument prior to their picking up their child for a doctor's appointment. Police later determined that he had killed a female friend of his wife. The man was killed in a car crash attempting to flee from police.[442]"},{"Date":"May 6, 2021","Location":"Rigby, Idaho","Deaths":"0","Injuries":"3","Description":"Two students and one custodian were shot and wounded by a 6th-grade female student who opened fire inside Rigby Middle School in the morning hours of May 6, 2021. The perpetrator was disarmed by a teacher and taken into custody by police.[443]"},{"Date":"August 13, 2021","Location":"Albuquerque, New Mexico","Deaths":"1","Injuries":"0","Description":"A 13-year-old student allegedly shot and killed another 13-year-old student, Bennie Hargrove, during a lunch hour at Washington Middle School.[444][445]"},{"Date":"August 18, 2021","Location":"Orangeburg, South Carolina","Deaths":"0","Injuries":"3","Description":"A 14-year-old student allegedly opened fire in the parking lot of Orangeburg-Wilkinson High School while students were leaving for the day, wounding three.[446]"},{"Date":"August 27, 2021","Location":"Woodridge, Virginia","Deaths":"0","Injuries":"2","Description":"A teenager wounded two others in the parking of Freedom High School after two groups got into a fight after a football game.[447]"},{"Date":"August 27, 2021","Location":"Sharon Hill, Pennsylvania","Deaths":"1","Injuries":"4","Description":"A drive by shooting following a high school football game at Academy Park High School wounded a civilian, resulting in police at the game firing back. Delaware County District Attorney Jack Stollsteimer says there is a \"high probability\" that the police gunfire struck four people, including a 8-year-old girl who was killed.[448][449]"},{"Date":"August 27, 2021","Location":"Wilmington, North Carolina","Deaths":"0","Injuries":"1","Description":"A student was shot during a fight at New Hanover High School. Another student, Chance Debalo was charged with attempted murder.[450] Deablo plead guilty to intent to kill with a deadly weapon, resulting in injury, and discharging a firearm on school grounds and he was sentenced to over four years in prison.[451]"},{"Date":"September 1, 2021","Location":"Winston-Salem, North Carolina","Deaths":"1","Injuries":"0","Description":"A student was shot and killed at Mount Tabor High School. Suspect, another student at the school, has been taken into custody.[452]"},{"Date":"September 4, 2021","Location":"Towson, Maryland","Deaths":"0","Injuries":"3","Description":"Three people, including one student, were shot on the campus of Towson University during a gathering at 2 am. The gathering was not organized by the university or any student organization.[453]"},{"Date":"September 7, 2021","Location":"Buena Park, California","Deaths":"1[n 1]","Injuries":"0","Description":"Cedric Baxter drove his SUV into a school bus driven by his estranged wife then opened fire on it, a six-year-old child was also on the bus though neither the child or the driver were injured by the gunfire, Baxter then drove away from the scene which resulted in a high speed chase until the car crashed and Baxter was killed by the police in a shootout.[454]"},{"Date":"September 20, 2021","Location":"Newport News, Virginia","Deaths":"0","Injuries":"4","Description":"Two people were wounded after a shooting at Heritage High School. Another two students were hospitalized for non-shooting injuries.[455]"},{"Date":"September 21, 2021","Location":"Wichita, Kansas","Deaths":"0","Injuries":"3","Description":"Two students were shot and a third grazed outside Wichita East High School.[456]"},{"Date":"September 24, 2021","Location":"Fairfield, Alabama","Deaths":"0","Injuries":"1","Description":"A man was wounded during a football game at Fairfield High Preparatory School, while tailgating in the parking lot. The gunfire seemed to come from off of the school campus.[457]"},{"Date":"September 30, 2021","Location":"Memphis, Tennessee","Deaths":"0","Injuries":"1","Description":"One student was shot in Cummings Elementary School.[458]"},{"Date":"September 30, 2021","Location":"Newton, Mississippi","Deaths":"0","Injuries":"1","Description":"A 7-year-old student was injured after a gun accidentally discharged from the backpack of another student at Newton Elementary School.[459]"},{"Date":"October 1, 2021","Location":"Houston, Texas","Deaths":"0","Injuries":"1","Description":"A former student walked into the YES Prep Southwest school and opened fire wounding the principal as he attempted to lock down the school.[460]"},{"Date":"October 6, 2021","Location":"Arlington, Texas","Deaths":"0","Injuries":"4","Description":"An adult shooter opened fire in Mansfield Timberview High School after a fight escalated; four people were injured, including a 15-year-old and a teacher.[461]"},{"Date":"October 12, 2021","Location":"Chicago, Illinois","Deaths":"0","Injuries":"2","Description":"Someone across the street from Wendell Phillips Academy High School in Bronzeville opened fire during dismissal, wounding a student and a security guard.[462]"},{"Date":"October 13, 2021","Location":"Grambling, Louisiana","Deaths":"1","Injuries":"1","Description":"An eighteen-year-old opened fire at Grambling State University and wounded a 16-year-old and killed a 19-year-old before fleeing campus.[463]"},{"Date":"October 17, 2021","Location":"Grambling, Louisiana","Deaths":"1","Injuries":"7","Description":"A gunman opened fire at Grambling State University in the early morning outside a dining hall where students were celebrating homecoming. One person was killed and seven wounded.[464]"},{"Date":"November 1, 2021","Location":"Madison, Mississippi","Deaths":"0","Injuries":"0","Description":"A woman accidentally fired her gun while reaching for her phone during a basketball game at the Rosa Scott School. No one was injured.[465]"},{"Date":"November 19, 2021","Location":"Aurora, Colorado","Deaths":"0","Injuries":"3","Description":"Three students were shot in the parking lot of Hinkley High School. No fatalities were reported.[466]"},{"Date":"November 26, 2021","Location":"Campbell, California","Deaths":"0","Injuries":"2","Description":"Two men were wounded in the parking lot of Westmont High School during a football game.[467]"},{"Date":"November 29, 2021","Location":"Phoenix, Arizona","Deaths":"0","Injuries":"1","Description":"A student wounded another in a bathroom of Cesar Chavez High School after a gun-sale gone bad. The wounded individual realized that the money he received in the sale was fake and was shot in the argument.[468]"},{"Date":"November 30, 2021","Location":"Oxford Township, Michigan","Deaths":"4","Injuries":"7","Description":"Oxford High School shooting: A 15-year-old sophomore was taken into custody. Seven people, including a teacher, were injured, and four died. An investigation is ongoing as of December 1, 2021.[469]"},{"Date":"November 30, 2021","Location":"Humboldt, Tennessee","Deaths":"1","Injuries":"2","Description":"A man was killed and two others wounded two hours into a pair of basketball games between Humboldt High School and North Side. The shooting occurred outside the gym near the concessions.[470]"},{"Date":"December 6, 2021","Location":"Wilmington, California","Deaths":"1","Injuries":"2","Description":"A 12-year-old was killed and his step-mother wounded when a teenager opened fire on their vehicle outside the Wilmington Park Elementary School. A 9-year-old in the playground was also injured.[471]"},{"Date":"December 8, 2021","Location":"Kansas City, Missouri","Deaths":"0","Injuries":"2","Description":"Two teenagers were wounded in the parking lot of Ewing Marion Kauffman School during a basketball game.[472]"},{"Date":"January 4, 2022","Location":"Rockford, Illinois","Deaths":"0","Injuries":"2","Description":"Two 17-year-olds were wounded while sitting in a car, in the parking lot of Auburn High School around 1pm. Three juveniles fled and were later arrested.[473]"},{"Date":"January 9, 2022","Location":"Murfreesboro, North Carolina","Deaths":"0","Injuries":"0","Description":"An unknown individual discharged a gun in a Chowan University dorm room, no injuries were reported and the bullet was located later in a fridge.[474]"},{"Date":"January 11, 2022","Location":"Albuquerque, New Mexico","Deaths":"0","Injuries":"0","Description":"A shooting occurred in the parking lot of Valley High School during a basketball game, no injuries were reported.[475]"},{"Date":"January 19, 2022","Location":"Sanford, Florida","Deaths":"0","Injuries":"1","Description":"A 16-year-old student wounded an 18-year-old student around noon at Seminole High School over a disagreement about a dead relative.[476]"},{"Date":"January 19, 2022","Location":"Pittsburgh, Pennsylvania","Deaths":"1","Injuries":"0","Description":"A 15-year-old boy boarded a school van to go home when school was being dismissed at Oliver Citywide Academy.  Two masked gunmen approached the van and shot the boy twice in the chest. The boy was taken to the hospital where he later died.[477]"},{"Date":"January 21, 2022","Location":"Derwood, Maryland","Deaths":"0","Injuries":"1","Description":"A 17-year-old boy shot and wounded a 15-year-old boy in a bathroom at Colonel Zadok Magruder High School. The victim was hospitalized, and the shooter was taken into custody.[478]"},{"Date":"January 29, 2022","Location":"Beloit, Wisconsin","Deaths":"1","Injuries":"0","Description":"A 19-year-old man (suspected to be Amaree Goodall) shot and killed another 19-year-old man, Jion Broomfield in the parking lot of Beloit Memorial High School. The victim was admitted to a nearby hospital around 9:07 P.M. CST with a gunshot wound to his leg and died shortly after. Goodall, a native of Madison, was not captured until March 30.[479][480][481][482][483]"},{"Date":"February 1, 2022","Location":"Richfield, Minnesota","Deaths":"1","Injuries":"1","Description":"At the South Education Center, a fight broke out which resulted in 15-year-old student Jahmari Rice being killed and a 17-year-old student critically injured.[484][485]"},{"Date":"February 1, 2022","Location":"Bridgewater, Virginia","Deaths":"2","Injuries":"1[n 1]","Description":"Two campus police and security officers were shot and killed at Bridgewater College. The shooter was taken into custody and hospitalized for non-life-threatening injuries.[486]"},{"Date":"February 8, 2022","Location":"Catonsville, Maryland","Deaths":"0","Injuries":"1","Description":"A 16-year-old was wounded in an apparent targeted shooting in Catonsville High Schools parking lot shortly after 3pm.[487]"},{"Date":"February 9, 2022","Location":"Minneapolis, Minnesota","Deaths":"0","Injuries":"1","Description":"A moving school bus was fired at which resulted in the bus driver being non-fatally shot in the head.[488][489][490][491]"},{"Date":"March 4, 2022","Location":"Olathe, Kansas","Deaths":"0","Injuries":"3[n 1]","Description":"An 18-year-old senior at Olathe East High School, identified as Jaylon Elmore, was called to the office on suspicion of carrying a gun. Upon arriving an assistant principal demanded he be allowed to search the student's backpack.  When the student refused, a School Resource Officer (SRO) was called.  After the SRO arrived, four bullets were fired from each of two guns, one by the SRO and another by the student.  The SRO, the assistant principal, and the student were all injured.[492] However, the Kansas City Defender has raised numerous questions about the official narrative, including whether the student or the SRO shot first.  They also claim that there likely would not have been a shooting at all if the student had not been challenged about carrying a weapon in his backpack.[493]"},{"Date":"March 7, 2022","Location":"Des Moines, Iowa","Deaths":"1","Injuries":"2","Description":"Around 2:42 P.M. CST, shooters from multiple vehicles opened fire on a group of teenagers in front of East High School in a drive-by shooting. 3 teenagers, a 15-year-old targeted male, a 16-year-old female, and an 18-year-old female, were shot and transferred to hospitals where they were reported to be in critical condition. The targeted victim died from his injuries shortly thereafter. 6 teenagers were arrested in the following hours and were later charged as adults for murder.[494]"},{"Date":"March 31, 2022","Location":"Greenville, South Carolina","Deaths":"1","Injuries":"0","Description":"A 12-year-old student shot and killed another student at Tanglewood Middle School. The shooter was found under a deck at a nearby home.[495]"},{"Date":"April 5, 2022","Location":"Erie, Pennsylvania","Deaths":"0","Injuries":"1","Description":"A student was wounded after multiple shots were fired at Erie High School around 9:20 am. No perpetrator was immediately identified and police were searching for a person who had fled campus shortly after the shooting.[496]"},{"Date":"April 14, 2022","Location":"Lake Ariel, Pennsylvania","Deaths":"0","Injuries":"0","Description":"A 13-year-old was arrested and charged with institutional vandalism and possession of a weapon on school property after being seen firing a gun just above a door at the main enterprise of Western Wayne Middle School by surveillance footage.[497]"},{"Date":"April 22, 2022","Location":"Washington, District of Columbia","Deaths":"1[n 1]","Injuries":"4","Description":"A resident of an adjacent apartment building fired more than 239 shots indiscriminately toward the Edmund Burke School in the Van Ness neighborhood of Washington, D.C., wounding a 12-year-old, two adults in their vehicles, and a school security guard. The shooting took place across the street from the student center of the University of the District of Columbia. Multiple law enforcement agencies led an intensive area lockdown for more than five hours that ended after the 23 year-old suspect died from a self-inflicted gunshot wound as police breached the apartment door.[498]"},{"Date":"May 9, 2022","Location":"Suwanee, Georgia","Deaths":"0","Injuries":"1","Description":"A woman fired 12 shots at a moving school bus. Nobody was shot but the bus driver was injured by shattered glass.[499]"},{"Date":"May 17, 2022","Location":"Chicago, Illinois","Deaths":"0","Injuries":"1","Description":"An 8-year-old child found his mother's gun under his mother's bed and brought it to his school in his backpack. On Tuesday, May 17 at around 10 AM the gun accidentally discharged in the students backpack in the classroom and injured a 7-year old classmate. The mother, 28-year-old Tatanina Kelly is charged with three counts of child endangerment.[500] The incident took place at Walt Disney Magnet school in the Buena Park neighborhood located at 4140 N. Marine Drive.[501]"},{"Date":"May 18, 2022","Location":"Murfreesboro, Tennessee","Deaths":"1","Injuries":"1","Description":"Following a graduation ceremony for Riverdale High School on the campus of Middle Tennessee State University a fight began in which two people were shot. A graduate of Riverdale was killed, a student was wounded, and another teenager was arrested.[502]"},{"Date":"May 19, 2022","Location":"Hammond, Louisiana","Deaths":"0","Injuries":"3","Description":"Three people were hospitalized after a shooting at Southeastern Louisiana University, where students at Hammond High Magnet School were leaving their graduation ceremony.[502]"},{"Date":"May 19, 2022","Location":"Kentwood, Michigan","Deaths":"0","Injuries":"2","Description":"On May 19, 2022, two people, (a 16-year-old boy, and a 40-year-old woman) were shot outside East Kentwood High School's football stadium during a graduation ceremony. According to the Kent County Sheriff [502] the shooting started thirty minutes after the ceremony ended when families were leaving, at that time a white Hyundai drove by and an individual inside the car opened fire upon the families, they ended up hitting bystanders instead of their alleged target. Another group (the alleged targets) returned fire on the car, and were later arrested and charged with weapons violations, police believe there may have been as many as 5 total accomplices.[503][504]"},{"Date":"May 24, 2022","Location":"Uvalde, Texas","Deaths":"22[n 1]","Injuries":"18","Description":"Robb Elementary School shooting: An 18-year-old gunman entered the school and shot various students. 21 people were killed; 19 students and 2 teachers. The Robb shooting in Uvalde, Texas was the second-deadliest shooting in an elementary, middle, or high school in U.S. History.[505]  The gunman was killed in a shootout with responding police officers.[506]"},{"Date":"May 31, 2022","Location":"New Orleans, Louisiana","Deaths":"1","Injuries":"2","Description":"Three people were shot after a graduation ceremony for Morris Jeff Community School on the campus of Xavier University of Louisiana. One of the victims, an elderly woman, died from her injuries.[507]"},{"Date":"June 1, 2022","Location":"Los Angeles, California","Deaths":"0","Injuries":"1","Description":"Both Los Angeles School police and officers from the Los Angeles Police Department responded to the scene, and believe the incident might have been gang-related. According to police, a male student was shot in the leg, in the area of Oxnard St. and Coldwater Canyon, in front of the school, and was transported to Cedars Sinai Hospital in stable condition.[508]"},{"Date":"June 8, 2022","Location":"Little Rock, Arkansas","Deaths":"0","Injuries":"0","Description":"A school bus that was taking a student home from a summer program was hit by a bullet. No one was injured in the incident.[509][510][511][512]"},{"Date":"June 9, 2022","Location":"Byhalia, Mississippi","Deaths":"0","Injuries":"0","Description":"A minor was arrested after firing a gun at Byhalia High School.[513]"},{"Date":"August 19, 2022","Location":"Clarksville, Tennessee","Deaths":"0","Injuries":"0","Description":"A teenager fired multiple gunshots during a football game at West Creek High School. Three people were arrested in connection with the incident.[514]"},{"Date":"August 19, 2022","Location":"Groveport, Ohio","Deaths":"0","Injuries":"0","Description":"A man fired six shots during a fight at a football game at Groveport Madison High School. No injuries were reported.[515]"},{"Date":"August 25, 2022","Location":"Bismarck, North Dakota","Deaths":"0","Injuries":"0","Description":"A man fired multiple gunshots on the campus of United Tribes Technical College. Two people, brothers, were charged in connection with the shooting.[516]"},{"Date":"August 29, 2022","Location":"Oakland, California","Deaths":"0","Injuries":"1","Description":"At Madison Park Academy, police responded to a report about a shooting, a 13-year-old boy was shot and a 12-year-old boy fled after the shooting but was quickly arrested and charged with assault with a firearm and other weapons charges. Police say the victim was not the intended target.[517][518][519]"},{"Date":"September 3, 2022","Location":"Dover, Delaware","Deaths":"0","Injuries":"4","Description":"A non-student shot four people near basketball courts on the Delaware State University campus, including two students.[520]"},{"Date":"September 20, 2022","Location":"South Bend, Indiana","Deaths":"0","Injuries":"0","Description":"A juvenile suspect was detained after a shot was fired on board a Jackson Middle School school bus.[521][522]"},{"Date":"September 24, 2022","Location":"Richfield, Minnesota","Deaths":"0","Injuries":"2","Description":"Two people were shot following a fight near a Richfield High School football game. Two juveniles were arrested in connection with the shooting.[523]"},{"Date":"September 27, 2022","Location":"Philadelphia, Pennsylvania","Deaths":"1","Injuries":"4","Description":"Following a football scrimmage at Roxborough High School two shooters fired at a group of football players from a car, killing a 14-year-old boy and wounding four others.[524]"},{"Date":"September 28, 2022","Location":"Oakland, California","Deaths":"1","Injuries":"5","Description":"2022 Oakland school shooting: Six adults were wounded in a shooting at a Rudsdale Newcomer High School, in a block of East Oakland that houses four schools. One victim died of his injuries in November 2022.[525]"},{"Date":"September 30, 2022","Location":"Newburgh, New York","Deaths":"0","Injuries":"3","Description":"Three people were shot in the parking lot of Newburgh Free Academy following a football game.[526]"},{"Date":"September 30, 2022","Location":"Tulsa, Oklahoma","Deaths":"1","Injuries":"3","Description":"Four people were shot, one fatally, near the tennis courts of McLain High School during a homecoming game.[527][528]"},{"Date":"October 5, 2022","Location":"Tucson, Arizona","Deaths":"1","Injuries":"0","Description":"Professor Thomas Meixner, the department head of Hydrology and Atmospheric Sciences at the University of Arizona, was shot and killed on campus. A former student was arrested in connection with the shooting.[529]"},{"Date":"October 7, 2022","Location":"Toledo, Ohio","Deaths":"0","Injuries":"3","Description":"Three people were shot outside a football game at Whitmer High School.[530]"},{"Date":"October 8, 2022","Location":"Baltimore, Maryland","Deaths":"0","Injuries":"1","Description":"A man was shot during an unsanctioned party on the Morgan State University campus.[531]"},{"Date":"October 24, 2022","Location":"St. Louis, Missouri","Deaths":"3[n 1]","Injuries":"7","Description":"Central Visual and Performing Arts High School shooting: A 19-year-old man armed with a semi-automatic rifle entered the Central Visual and Performing Arts High School just after 9 am and opened fire. At least two people were killed, and seven others were injured. The shooter was killed in an exchange of gunfire with police.[532]"},{"Date":"November 4, 2022","Location":"West Hartford, Connecticut","Deaths":"0","Injuries":"1","Description":"An individual was shot in a parking lot on the University of Saint Joseph campus. The suspected shooter is also accused of causing a car accident and shooting at the driver.[533]"},{"Date":"November 8, 2022","Location":"Seattle, Washington","Deaths":"1","Injuries":"0","Description":"A student of Ingraham High School was shot inside the school. Another student was arrested for the shooting.[534]"},{"Date":"November 12, 2022","Location":"Orlando, Florida","Deaths":"1","Injuries":"2","Description":"Three people were shot in the parking lot of Jones High School during a football game. A 19-year-old was killed.[535]"},{"Date":"November 13, 2022","Location":"Charlottesville, Virginia","Deaths":"3","Injuries":"2","Description":"University of Virginia shooting: A student at the University of Virginia shot several students, killing three. The suspected gunman is a former member of the university's football team, and several of the victims were current members of the team.[536]"},{"Date":"November 17, 2022","Location":"Clinton, Indiana","Deaths":"0","Injuries":"1","Description":"A sheriff's deputy teaching a vocational law enforcement class accidentally discharged his weapon, grazing a student.[537]"},{"Date":"November 19, 2022","Location":"Albuquerque, New Mexico","Deaths":"1[n 1]","Injuries":"1","Description":"A student at the University of New Mexico (UNM) lured visiting New Mexico State University basketball power forward Mike Peake on campus and shot him. Peake then returned fire, killing the UNM student.[538]"},{"Date":"November 27, 2022","Location":"Tallahassee, Florida","Deaths":"1","Injuries":"4","Description":"One person was killed and four others were injured when a shooter opened fire in the outdoor basketball court of Florida A&M University.[539]"},{"Date":"December 8, 2022","Location":"Fuquay-Varina, North Carolina","Deaths":"0","Injuries":"0","Description":"A 12-year-old student at Fuquay-Varina Middle School fired a gun at a window in a classroom where several students were present. Shortly after, a teacher who heard the shot entered the room and convinced the student to give her the firearm.[540]"},{"Date":"January 6, 2023","Location":"Newport News, Virginia","Deaths":"0","Injuries":"1","Description":"Shooting of Abby Zwerner: a 6-year-old student at Richneck Elementary School shot teacher Abby Zwerner.[541]"},{"Date":"January 23, 2023","Location":"Des Moines, Iowa","Deaths":"2","Injuries":"1","Description":"Two students were killed and a school employee was wounded after a shooting at a charter school. Multiple suspects were arrested in connection with the shooting.[542]"}],[{"Related terms and topics":"1960s\nUniversity of Texas (1966)\nRose-Mar College of Beauty (1966)\n1970s\nOlean High School (1974)\nCalifornia State University, Fullerton (1976)\nCleveland Elementary School (1979)\n1980s\n49th Street Elementary School (1984)\nMurray–Wright High School (1985)\nCokeville Elementary School (1986)\nMurray–Wright High School (1987)\nPinellas Park High School (1988)\nOakland Elementary School (1988)\nCleveland Elementary School (1989)\n1990s\nUniversity of Iowa (1991)\nLindhurst High School (1992)\nEast Carter High School (1993)\nWickliffe Middle School (1994)\nBlackville–Hilda High School (1995)\nRichland High School (1995)\nFrontier Middle School (1996)\nSan Diego State University (1996)\nBethel Regional High School (1997)\nPearl High School (1997)\nHeath High School (1997)\nWestside Middle School (1998)\nParker Middle School (1998)\nThurston High School (1998)\nColumbine High School (1999)","2000s":"University of Texas (1966)\nRose-Mar College of Beauty (1966)","2010s":"Olean High School (1974)\nCalifornia State University, Fullerton (1976)\nCleveland Elementary School (1979)","2020s":"49th Street Elementary School (1984)\nMurray–Wright High School (1985)\nCokeville Elementary School (1986)\nMurray–Wright High School (1987)\nPinellas Park High School (1988)\nOakland Elementary School (1988)\nCleveland Elementary School (1989)","1990s":"University of Iowa (1991)\nLindhurst High School (1992)\nEast Carter High School (1993)\nWickliffe Middle School (1994)\nBlackville–Hilda High School (1995)\nRichland High School (1995)\nFrontier Middle School (1996)\nSan Diego State University (1996)\nBethel Regional High School (1997)\nPearl High School (1997)\nHeath High School (1997)\nWestside Middle School (1998)\nParker Middle School (1998)\nThurston High School (1998)\nColumbine High School (1999)"},{"Related terms and topics":"University of Texas (1966)\nRose-Mar College of Beauty (1966)"},{"Related terms and topics":"Olean High School (1974)\nCalifornia State University, Fullerton (1976)\nCleveland Elementary School (1979)"},{"Related terms and topics":"49th Street Elementary School (1984)\nMurray–Wright High School (1985)\nCokeville Elementary School (1986)\nMurray–Wright High School (1987)\nPinellas Park High School (1988)\nOakland Elementary School (1988)\nCleveland Elementary School (1989)"},{"Related terms and topics":"University of Iowa (1991)\nLindhurst High School (1992)\nEast Carter High School (1993)\nWickliffe Middle School (1994)\nBlackville–Hilda High School (1995)\nRichland High School (1995)\nFrontier Middle School (1996)\nSan Diego State University (1996)\nBethel Regional High School (1997)\nPearl High School (1997)\nHeath High School (1997)\nWestside Middle School (1998)\nParker Middle School (1998)\nThurston High School (1998)\nColumbine High School (1999)"},{"Related terms and topics":"2000s\nBuell Elementary School (2000)\nUniversity of Arkansas (2000)\nSantana High School (2001)\nAppalachian School of Law (2002)\nJohn McDonogh High School (2003)\nCase Western Reserve University (2003)\nRocori High School (2003)\nRed Lake (2005)\nCampbell County High School (2005)\nOrange High School (2006)\nPine Middle School (2006)\nPlatte Canyon High School (2006)\nWeston High School (2006)\nWest Nickel Mines School (2006)\nVirginia Tech (2007)\nDelaware State University (2007)\nSpringwater Trail High School (2007)\nSuccessTech Academy (2007)\nNorthern Illinois University (2008)\nE.O. Junior High School (2008)\nUniversity of Central Arkansas (2008)\n2010s\nUniversity of Alabama in Huntsville (2010)\nChardon High School (2012)\nOikos University (2012)\nPerry Hall High School (2012)\nSandy Hook Elementary School (2012)\nSanta Monica College (2013)\nSparks Middle School (2013)\nMarysville Pilchuck High School (2014)\nUmpqua Community College (2015)\nNorthern Arizona University (2015)\nUniversity of California, Los Angeles (2016)\nTownville Elementary School (2016)\nNorth Park Elementary School (2017)\nRancho Tehama Elementary School (2017)\nAztec High School (2017)\nMarshall County High School (2018)\nStoneman Douglas High School (2018)\nSanta Fe High School (2018)\nNoblesville West Middle School (2018)\nUniversity of North Carolina at Charlotte (2019)\nSTEM School Highlands Ranch (2019)\nSaugus High School (2019)\n2020s\nOxford High School (2021)\nEast High School (2022)\nRobb Elementary School (2022)\nRudsdale High School (2022)\nCentral Visual and Performing Arts High School (2022)\nUniversity of Virginia (2022)\nRichneck Elementary School (2023)","2000s":"Buell Elementary School (2000)\nUniversity of Arkansas (2000)\nSantana High School (2001)\nAppalachian School of Law (2002)\nJohn McDonogh High School (2003)\nCase Western Reserve University (2003)\nRocori High School (2003)\nRed Lake (2005)\nCampbell County High School (2005)\nOrange High School (2006)\nPine Middle School (2006)\nPlatte Canyon High School (2006)\nWeston High School (2006)\nWest Nickel Mines School (2006)\nVirginia Tech (2007)\nDelaware State University (2007)\nSpringwater Trail High School (2007)\nSuccessTech Academy (2007)\nNorthern Illinois University (2008)\nE.O. Junior High School (2008)\nUniversity of Central Arkansas (2008)","2010s":"University of Alabama in Huntsville (2010)\nChardon High School (2012)\nOikos University (2012)\nPerry Hall High School (2012)\nSandy Hook Elementary School (2012)\nSanta Monica College (2013)\nSparks Middle School (2013)\nMarysville Pilchuck High School (2014)\nUmpqua Community College (2015)\nNorthern Arizona University (2015)\nUniversity of California, Los Angeles (2016)\nTownville Elementary School (2016)\nNorth Park Elementary School (2017)\nRancho Tehama Elementary School (2017)\nAztec High School (2017)\nMarshall County High School (2018)\nStoneman Douglas High School (2018)\nSanta Fe High School (2018)\nNoblesville West Middle School (2018)\nUniversity of North Carolina at Charlotte (2019)\nSTEM School Highlands Ranch (2019)\nSaugus High School (2019)","2020s":"Oxford High School (2021)\nEast High School (2022)\nRobb Elementary School (2022)\nRudsdale High School (2022)\nCentral Visual and Performing Arts High School (2022)\nUniversity of Virginia (2022)\nRichneck Elementary School (2023)"},{"Related terms and topics":"Buell Elementary School (2000)\nUniversity of Arkansas (2000)\nSantana High School (2001)\nAppalachian School of Law (2002)\nJohn McDonogh High School (2003)\nCase Western Reserve University (2003)\nRocori High School (2003)\nRed Lake (2005)\nCampbell County High School (2005)\nOrange High School (2006)\nPine Middle School (2006)\nPlatte Canyon High School (2006)\nWeston High School (2006)\nWest Nickel Mines School (2006)\nVirginia Tech (2007)\nDelaware State University (2007)\nSpringwater Trail High School (2007)\nSuccessTech Academy (2007)\nNorthern Illinois University (2008)\nE.O. Junior High School (2008)\nUniversity of Central Arkansas (2008)"},{"Related terms and topics":"University of Alabama in Huntsville (2010)\nChardon High School (2012)\nOikos University (2012)\nPerry Hall High School (2012)\nSandy Hook Elementary School (2012)\nSanta Monica College (2013)\nSparks Middle School (2013)\nMarysville Pilchuck High School (2014)\nUmpqua Community College (2015)\nNorthern Arizona University (2015)\nUniversity of California, Los Angeles (2016)\nTownville Elementary School (2016)\nNorth Park Elementary School (2017)\nRancho Tehama Elementary School (2017)\nAztec High School (2017)\nMarshall County High School (2018)\nStoneman Douglas High School (2018)\nSanta Fe High School (2018)\nNoblesville West Middle School (2018)\nUniversity of North Carolina at Charlotte (2019)\nSTEM School Highlands Ranch (2019)\nSaugus High School (2019)"},{"Related terms and topics":"Oxford High School (2021)\nEast High School (2022)\nRobb Elementary School (2022)\nRudsdale High School (2022)\nCentral Visual and Performing Arts High School (2022)\nUniversity of Virginia (2022)\nRichneck Elementary School (2023)"},{"Related terms and topics":"Active shooter\nColumbine effect\nGun violence in the United States\nList of school shootings in the United States by death toll\nMass shootings in the United States\n\"'No Way to Prevent This', Says Only Nation Where This Regularly Happens\"\nThoughts and prayers\nSchool shooting"}],[{"1990s":"University of Texas (1966)\nRose-Mar College of Beauty (1966)"},{"1990s":"Olean High School (1974)\nCalifornia State University, Fullerton (1976)\nCleveland Elementary School (1979)"},{"1990s":"49th Street Elementary School (1984)\nMurray–Wright High School (1985)\nCokeville Elementary School (1986)\nMurray–Wright High School (1987)\nPinellas Park High School (1988)\nOakland Elementary School (1988)\nCleveland Elementary School (1989)"},{"1990s":"University of Iowa (1991)\nLindhurst High School (1992)\nEast Carter High School (1993)\nWickliffe Middle School (1994)\nBlackville–Hilda High School (1995)\nRichland High School (1995)\nFrontier Middle School (1996)\nSan Diego State University (1996)\nBethel Regional High School (1997)\nPearl High School (1997)\nHeath High School (1997)\nWestside Middle School (1998)\nParker Middle School (1998)\nThurston High School (1998)\nColumbine High School (1999)"}],[{"2020s":"Buell Elementary School (2000)\nUniversity of Arkansas (2000)\nSantana High School (2001)\nAppalachian School of Law (2002)\nJohn McDonogh High School (2003)\nCase Western Reserve University (2003)\nRocori High School (2003)\nRed Lake (2005)\nCampbell County High School (2005)\nOrange High School (2006)\nPine Middle School (2006)\nPlatte Canyon High School (2006)\nWeston High School (2006)\nWest Nickel Mines School (2006)\nVirginia Tech (2007)\nDelaware State University (2007)\nSpringwater Trail High School (2007)\nSuccessTech Academy (2007)\nNorthern Illinois University (2008)\nE.O. Junior High School (2008)\nUniversity of Central Arkansas (2008)"},{"2020s":"University of Alabama in Huntsville (2010)\nChardon High School (2012)\nOikos University (2012)\nPerry Hall High School (2012)\nSandy Hook Elementary School (2012)\nSanta Monica College (2013)\nSparks Middle School (2013)\nMarysville Pilchuck High School (2014)\nUmpqua Community College (2015)\nNorthern Arizona University (2015)\nUniversity of California, Los Angeles (2016)\nTownville Elementary School (2016)\nNorth Park Elementary School (2017)\nRancho Tehama Elementary School (2017)\nAztec High School (2017)\nMarshall County High School (2018)\nStoneman Douglas High School (2018)\nSanta Fe High School (2018)\nNoblesville West Middle School (2018)\nUniversity of North Carolina at Charlotte (2019)\nSTEM School Highlands Ranch (2019)\nSaugus High School (2019)"},{"2020s":"Oxford High School (2021)\nEast High School (2022)\nRobb Elementary School (2022)\nRudsdale High School (2022)\nCentral Visual and Performing Arts High School (2022)\nUniversity of Virginia (2022)\nRichneck Elementary School (2023)"}]]