[
  {
    "Date": "000000002000-02-29-0000February 29, 2000",
    "Location": "Flint, Michigan !Flint, Michigan",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "Shooting of Kayla Rolland: At Buell Elementary School, 6-year-old Dedrick Owens fatally shot 6-year-old classmate Kayla Rolland. Owens has since been the youngest documented school shooter.[312]",
    "coords": {
      "lat": 43.0125274,
      "lon": -83.6874562
    }
  },
  {
    "Date": "000000002000-05-26-0000May 26, 2000",
    "Location": "Lake Worth, Florida !Lake Worth, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "13-year-old honor student, Nathaniel Brazill, was sent home for throwing water balloons, but returned to his Lake Worth Middle School with a family pistol. He fatally shot teacher Barry Grunow, a popular teacher, he was Brazill's favorite.[312][313]",
    "coords": {
      "lat": 26.6167555,
      "lon": -80.0684479
    }
  },
  {
    "Date": "000000002000-08-28-0000August 28, 2000",
    "Location": "Fayetteville, Arkansas !Fayetteville, Arkansas",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "36-year-old James Easton Kelly, a PhD candidate in Comparative Literature at University of Arkansas, killed 67-year-old Dr. John R. Locke, the English professor overseeing his coursework. Kelly had been dismissed from this PhD program for lack of progress toward his degree. Kelly shot Dr. Locke three times before committing suicide in the director's office, which had been isolated by campus police.[314]",
    "coords": {
      "lat": 36.082156,
      "lon": -94.17185420000001
    }
  },
  {
    "Date": "000000002000-09-26-0000September 26, 2000",
    "Location": "New Orleans, Louisiana !New Orleans, Louisiana",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "13 year-olds Darrel Johnson, and Alfred Anderson were initially charged with attempted first-degree murder in the shooting of 15 year-old William Pennington. Pennington, after being shot, managed to gain control of the gun and shoot Johnson in the back.[315] Charges were later reduced to Aggravated Battery.",
    "coords": {
      "lat": 29.95106579999999,
      "lon": -90.0715323
    }
  },
  {
    "Date": "000000002000-12-01-0000December 1, 2000",
    "Location": "San Diego, California !San Diego, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 15-year-old Junipero Serra High School student who showed off a handgun on campus and threatened to shoot a classmate, ended up accidentally shooting himself, causing minor injuries.[316]",
    "coords": {
      "lat": 32.715738,
      "lon": -117.1610838
    }
  },
  {
    "Date": "000000002001-03-05-0000March 5, 2001",
    "Location": "Santee, California !Santee, California",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,00113",
    "Description": "Santana High School shooting: 15-year-old student, Charles Andrew Williams, killed two students, 14-year-old Bryan Zuckor, and 15-year-old Randy Gordon, at Santana High School and wounded thirteen others. He was arrested and convicted of murder and attempted murder. He was sentenced to life with the chance of parole after serving fifty years.[317]",
    "coords": {
      "lat": 32.8383828,
      "lon": -116.9739167
    }
  },
  {
    "Date": "000000002001-03-07-0000March 7, 2001",
    "Location": "Williamsport, Pennsylvania !Williamsport, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "14-year-old student, Elizabeth Catherine Bush, wounded fellow student Kimberly Marchese in the cafeteria of Bishop Neumann High School; she had been frequently teased and suffered from depression .[318]",
    "coords": {
      "lat": 41.2411897,
      "lon": -77.00107860000001
    }
  },
  {
    "Date": "000000002001-05-16-0000May 16, 2001",
    "Location": "Parkland, Washington !Parkland, Washington",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "40-year-old music instructor and organist James D. Holloway was shot multiple times with a .22-caliber handgun at Pacific Lutheran University by a 55-year-old man from Tacoma. The shooter was not a student or employee of the university and also killed himself. The victim was apparently chosen at random as the shooter had a personal dispute with a different staff member who was not on campus that day.[319]",
    "coords": {
      "lat": 47.1553769,
      "lon": -122.4340114
    }
  },
  {
    "Date": "000000002001-03-22-0000March 22, 2001",
    "Location": "El Cajon, California !El Cajon, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0015",
    "Description": "18-year-old former student, Jason Hoffman, opened fire at Granite Hills High School, injuring five people. He was convicted of assault and sentenced to prison, where he committed suicide in 2002.[320]",
    "coords": {
      "lat": 32.7947731,
      "lon": -116.9625269
    }
  },
  {
    "Date": "000000002001-03-30-0000March 30, 2001",
    "Location": "Gary, Indiana !Gary, Indiana",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "17-year-old Donald Ray Burt Jr., fatally shot Neal Boyd, IV with one bullet to the head in a parking lot outside Lew Wallace High School.[321]",
    "coords": {
      "lat": 41.5933696,
      "lon": -87.3464271
    }
  },
  {
    "Date": "000000002002-01-15-0000January 15, 2002",
    "Location": "New York City, New York !New York City, New York",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "17-year-old Vincent Rodriguez, wounded two students at Martin Luther King, Jr. High School in Manhattan, with a semi-automatic pistol. He was retaliating for the victims having harassed his girlfriend. In February 2003, Rodriguez was sentenced to ten years in prison on charges of assault and attempted assault.[322]",
    "coords": {
      "lat": 40.7127753,
      "lon": -74.0059728
    }
  },
  {
    "Date": "000000002002-01-16-0000January 16, 2002",
    "Location": "Grundy, Virginia !Grundy, Virginia",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0013",
    "Description": "Appalachian School of Law shooting: Recently dismissed graduate student, 42-year-old Peter Odighizuwa, killed three at the Appalachian School of Law. 42-year-old dean Anthony Sutin, and 41-year-old professor Thomas Blackwell were killed along with 33-year-old student, Angela Dales. Three other students were also wounded.[323] Odighizuwa received three life sentences and an additional 28 years without the possibility of parole until 2005.[324]",
    "coords": {
      "lat": 37.2778886,
      "lon": -82.0990223
    }
  },
  {
    "Date": "000000002002-02-20-0000February 20, 2002",
    "Location": "Milwaukee, Wisconsin !Milwaukee, Wisconsin",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "16-year-old Washington High School student, Joseph Johnson Jr., was killed by Phillip D. Jackson Jr., when violence erupts between rival fans in the parking lot, after a basketball game between Vincent High School.[325]",
    "coords": {
      "lat": 43.0389025,
      "lon": -87.9064736
    }
  },
  {
    "Date": "000000002002-06-11-0000June 11, 2002",
    "Location": "Conception, Missouri !Conception, Missouri",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0012",
    "Description": "71-year-old Lloyd Robert Jeffress opened fire at random in the halls of Conception Abbey, a monastery in northwest Missouri.\nHe killed two monks and seriously wounded another two before fatally shooting himself. Two weapons, a Chinese-made replica of the AK-47 and a sawed-off .22-caliber rifle, were found near the body.[326]",
    "coords": {
      "lat": 40.2423814,
      "lon": -94.6874946
    }
  },
  {
    "Date": "000000002002-10-07-0000October 7, 2002",
    "Location": "Bowie, Maryland !Bowie, Maryland",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "In the Beltway sniper attacks, one victim of several was 13-year-old Iran Brown, who was wounded as he arrived at Benjamin Tasker Middle School in Bowie, Maryland. His aunt, a nurse who had just dropped him off, rushed him to a hospital emergency room. Despite serious injuries, Brown survived the attack.[327][328]",
    "coords": {
      "lat": 39.0067768,
      "lon": -76.77913649999999
    }
  },
  {
    "Date": "000000002002-10-28-0000October 28, 2002",
    "Location": "Tucson, Arizona !Tucson, Arizona",
    "Deaths": "0,000,0014",
    "Injuries": "0,000,0010",
    "Description": "Failing nursing college student and Gulf War veteran, 40-year-old Robert Stewart Flores Jr., killed three assistant professors of nursing at the University of Arizona, 50-year-old Robin Rogers, 44-year-old Cheryl McGaffic, and 45-year-old Barbara Monroe, before turning the gun on himself.[329]",
    "coords": {
      "lat": 32.2217429,
      "lon": -110.926479
    }
  },
  {
    "Date": "000000002002-10-29-0000October 29, 2002",
    "Location": "Jersey City, New Jersey !Jersey City, New Jersey",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 15-year-old student was shot in the abdomen and wounded inside a basement of Lincoln High School, during an argument with another student. Another 15-year-old student was arrested and charged with attempted murder.[330]",
    "coords": {
      "lat": 40.72815749999999,
      "lon": -74.0776417
    }
  },
  {
    "Date": "000000002003-04-14-0000April 14, 2003",
    "Location": "New Orleans, Louisiana !New Orleans, Louisiana",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0013",
    "Description": "John McDonogh High School shooting. 18-year-old Steven Williams, and 17-year-old James Tate opened fire with an AK-47 and a handgun in the gymnasium of John McDonogh High School, killing a 15-year-old student and wounding three female students. Williams was sentenced to life imprisonment, and Tate was sentenced to fifteen years.[331][332][333]",
    "coords": {
      "lat": 29.95106579999999,
      "lon": -90.0715323
    }
  },
  {
    "Date": "000000002003-04-24-0000April 24, 2003",
    "Location": "Red Lion, Pennsylvania !Red Lion, Pennsylvania",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "14-year-old student James Sheets, entered Red Lion Area Junior High School armed with his stepfather's pistols. He killed the school's principal, Eugene Segro, before killing himself.[334][335]",
    "coords": {
      "lat": 39.9009334,
      "lon": -76.6058001
    }
  },
  {
    "Date": "000000002003-05-09-0000May 9, 2003",
    "Location": "Cleveland, Ohio !Cleveland, Ohio",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "On May 9, 2003, Biswanath Halder, a 62-year-old business school alumnus of Case Western Reserve University, killed a graduate student and wounded a professor and another student using a semi-automatic rifle. He held the building and its nearly 100 occupants hostage for seven hours before being apprehended by a SWAT team. He was sentenced to life in prison.[336][337]",
    "coords": {
      "lat": 41.49932,
      "lon": -81.6943605
    }
  },
  {
    "Date": "000000002003-09-24-0000September 24, 2003",
    "Location": "Cold Spring, Minnesota !Cold Spring, Minnesota",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "Rocori High School shooting: 15-year-old John Jason McLaughlin, shot 15-year-old freshman Seth Bartell and 17-year-old senior Aaron Rollins at Rocori High School. Rollins was killed immediately, and Bartell died from his wounds sixteen days later. McLaughlin was sentenced to life in prison with the chance of parole in 2038.[312]",
    "coords": {
      "lat": 45.4536111,
      "lon": -94.4277778
    }
  },
  {
    "Date": "000000002004-02-02-0000February 2, 2004",
    "Location": "Washington, D.C. !Washington, D.C.",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "Thomas J. Boykin was acquitted of the murder of 17-year-old James Richardson, a football player at Ballou High School in Southeast Washington.[338]",
    "coords": {
      "lat": 38.9071923,
      "lon": -77.0368707
    }
  },
  {
    "Date": "000000002004-02-09-0000February 9, 2004",
    "Location": "East Greenbush, New York !East Greenbush, New York",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Jon W. Romano in East Greenbush, New York fired two rounds from a shotgun, wounding one teacher. He was tackled by the assistant principal and charged with one count of attempted murder.[339]",
    "coords": {
      "lat": 42.6068049,
      "lon": -73.68893779999999
    }
  },
  {
    "Date": "000000002004-05-07-0000May 7, 2004",
    "Location": "Randallstown, Maryland !Randallstown, Maryland",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0014",
    "Description": "Two students were charged with a school shooting that arose from a dispute after a basketball game at Randallstown High School. Four persons were injured, two seriously. One student was paralyzed from the waist down.[340]",
    "coords": {
      "lat": 39.3673278,
      "lon": -76.79525249999999
    }
  },
  {
    "Date": "000000002005-02-08-0000February 8, 2005",
    "Location": "Chicago, Illinois !Chicago, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "An 18-year-old student at Bowen High School was shot in the leg as she left the school around 2:30 p.m.[341]",
    "coords": {
      "lat": 41.8781136,
      "lon": -87.6297982
    }
  },
  {
    "Date": "000000002005-03-02-0000March 2, 2005",
    "Location": "Dover, Tennessee !Dover, Tennessee",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "14-year-old Jason Clinard, killed his bus driver, 47-year-old Joyce Gregory, as she stopped to pick him up. Gregory had earlier reported Clinard for using snuff on the school bus. Clinard was given a life sentence.[342]",
    "coords": {
      "lat": 36.4878291,
      "lon": -87.83835669999999
    }
  },
  {
    "Date": "000000002005-03-21-0000March 21, 2005",
    "Location": "Red Lake, Minnesota !Red Lake, Minnesota",
    "Deaths": "0,000,00110",
    "Injuries": "0,000,0017",
    "Description": "Red Lake shootings: 16-year-old student Jeffrey Weise, killed his grandfather and grandfather's companion at their home, where he had been living, at the Red Lake Indian Reservation. He drove to Red Lake Senior High School. Armed with his grandfather's police weapons, Weise killed five students, one teacher, and one security guard, wounding seven others, before committing suicide.[343]",
    "coords": {
      "lat": 47.876346,
      "lon": -95.0169401
    }
  },
  {
    "Date": "000000002005-09-13-0000September 13, 2005",
    "Location": "Chicago, Illinois !Chicago, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "At Harlan Community Academy High School, a fight broke out between two 15-year-old boys in the gymnasium. Christopher Huff took out a pistol, shooting the other youth in the leg. A police officer on duty at the school arrested the gunman. The suspected shooter was charged as an adult with aggravated battery with a firearm.[344]",
    "coords": {
      "lat": 41.8781136,
      "lon": -87.6297982
    }
  },
  {
    "Date": "000000002005-11-08-0000November 8, 2005",
    "Location": "Jacksboro, Tennessee !Jacksboro, Tennessee",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0012",
    "Description": "Campbell County High School shooting: Inside the Campbell County High School office, 15-year-old Kenneth Bartley, shot the school principal, Gary Seale. He shot assistant principals Ken Bruce and Jim Pierce. Bruce later died from his wound. Bartley was sentenced to forty-five years in prison with chance of parole after twenty-nine years.[345][346][217]",
    "coords": {
      "lat": 36.3300793,
      "lon": -84.1838156
    }
  },
  {
    "Date": "000000002006-01-13-0000January 13, 2006",
    "Location": "Longwood, Florida !Longwood, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "15-year-old Christopher Penley, took a pellet gun to class at Milwee Middle School. After refusing to drop the weapon, he was shot when he pointed it at a police officer.[347]",
    "coords": {
      "lat": 28.7030519,
      "lon": -81.3384011
    }
  },
  {
    "Date": "000000002006-02-23-0000February 23, 2006",
    "Location": "Roseburg, Oregon !Roseburg, Oregon",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "14-year-old freshman Vincent Wayne Leodoro, shot student 16-year-old Joseph Monti, four times in the back with a semi-automatic handgun at Roseburg High School. Leodoro walked away from the school campus, and was confronted near a restaurant by six police officers. He threatened suicide but was persuaded to surrender.[348] He was found guilty of attempted murder and assault in July 2006, and will be held in prison until he turns twenty five years old.[349]",
    "coords": {
      "lat": 43.216505,
      "lon": -123.3417381
    }
  },
  {
    "Date": "000000002006-03-14-0000March 14, 2006",
    "Location": "Reno, Nevada !Reno, Nevada",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "Pine Middle School shooting: In the hallway of Pine Middle School, 14-year-old James Scott Newman, injured two 14-year-old classmates, Alexander Rueda and Kenzie McKeon, with a revolver belonging to his parents. Two students received minor wounds. Newman was subdued by a physical education teacher. The youth was arrested and charged as an adult for attempted murder, use of a deadly weapon and use of a firearm by a minor.[350] He later pleaded guilty to charges of two counts of battery with a deadly weapon, and was sentenced as a juvenile. Newman was sentenced to house arrest until he completed two-hundred hours of community service.[351]",
    "coords": {
      "lat": 39.5296329,
      "lon": -119.8138027
    }
  },
  {
    "Date": "August 24, 2006",
    "Location": "Essex Junction, Vermont",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0013",
    "Description": "Christopher Williams, 26, shot his girlfriend's mother, Linda Lambesis, 57 at her home and from there he went to Essex Elementary School where Andrea, his girlfriend, worked. After he arrived at the elementary school, which was not in session at the time, he shot and killed Mary Alicia Shanks, 56, and shot Mary Snedeker, 52, nonfatally. He left the school and allegedly shot Chad Johansen, 26 nonfatally. He then turned the gun on himself, but did not die as a result.[352]",
    "coords": {
      "lat": 44.4905433,
      "lon": -73.11122069999999
    }
  },
  {
    "Date": "000000002006-08-30-0000August 30, 2006",
    "Location": "Hillsborough, North Carolina !Hillsborough, North Carolina",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0012",
    "Description": "After shooting and killing his father, teenager Alvaro Castillo went to his high school, where he wounded two students. He was reportedly obsessed with the Columbine shootings and had written an email to the current Columbine high school principal before committing his own crime.[353]",
    "coords": {
      "lat": 36.0754183,
      "lon": -79.0997347
    }
  },
  {
    "Date": "000000002006-09-02-0000September 2, 2006",
    "Location": "Shepherdstown, West Virginia !Shepherdstown, West Virginia",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0010",
    "Description": "49-year-old Douglas W. Pennington, killed himself and his two sons, 26-year-old Logan P. Pennington, 24-year-old Benjamin M. Pennington, during a visit to the campus of Shepherd University.[354][355]",
    "coords": {
      "lat": 39.4300996,
      "lon": -77.8041609
    }
  },
  {
    "Date": "000000002006-09-17-0000September 17, 2006",
    "Location": "Pittsburgh, Pennsylvania !Pittsburgh, Pennsylvania",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0015",
    "Description": "Five Duquesne basketball players were shot early Sunday morning during an apparent act of random violence on campus, leaving three hospitalized — two of them in critical condition.[356]",
    "coords": {
      "lat": 40.44062479999999,
      "lon": -79.9958864
    }
  },
  {
    "Date": "000000002006-09-27-0000September 27, 2006",
    "Location": "Bailey, Colorado !Bailey, Colorado",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0010",
    "Description": "Platte Canyon High School hostage crisis: 53-year-old drifter, Duane Roger Morrison, walked into Platte Canyon High School and took six girls hostage. He sexually assaulted them. As a SWAT team stormed the classroom, he killed 16-year-old Emily Keyes, then took his own life.[357]",
    "coords": {
      "lat": 39.4060536,
      "lon": -105.4786412
    }
  },
  {
    "Date": "000000002006-09-29-0000September 29, 2006",
    "Location": "Cazenovia, Wisconsin !Cazenovia, Wisconsin",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "Weston High School shooting: At around 8 a.m., 15-year-old freshman, Eric Hainstock, entered Weston High School. He aimed a 20-gauge shotgun at social studies teacher, Chuck Keller, before it was wrestled from him by school custodian, Dave Thompson. Hainstock then shot 49-year-old high school principal, John Alfred Klang, with a .22 caliber revolver. Klang died later that afternoon.[358][359] Hainstock was charged and convicted of murder, and is serving a life sentence. He will be eligible for parole in 2037.[217][360]",
    "coords": {
      "lat": 43.5230345,
      "lon": -90.1962379
    }
  },
  {
    "Date": "000000002006-10-02-0000October 2, 2006",
    "Location": "Nickel Mines, Pennsylvania !Nickel Mines, Pennsylvania",
    "Deaths": "0,000,0016",
    "Injuries": "0,000,0013",
    "Description": "West Nickel Mines School shooting: 32-year-old milk truck driver, Charles Carl Roberts IV, killed five Amish girls and wounded five others before killing himself in an Amish school in the hamlet of Nickel Mines, in Bart Township, Lancaster County.[361]",
    "coords": {
      "lat": 39.9592143,
      "lon": -76.0804172
    }
  },
  {
    "Date": "000000002006-10-09-0000October 9, 2006",
    "Location": "Joplin, Missouri !Joplin, Missouri",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0010",
    "Description": "13-year-old student Thomas White fired one shot from a Mac-90 rifle at a hallway ceiling at Memorial Middle School. The gunshot struck a water pipe, and nobody was injured. He also tried repeatedly to shoot principal Stephen Gilbreth at near-point-blank range as Gilbreth ushered him out of the school. Joplin police say the attempt was foiled by an improperly seated ammunition clip in the rifle. The principal was not injured. White was tried as an adult on charges of assault and firearms possession, and in 2009 he was sentenced to ten years of prison.[362]",
    "coords": {
      "lat": 37.08422710000001,
      "lon": -94.51328099999999
    }
  },
  {
    "Date": "000000002007-01-03-0000January 3, 2007",
    "Location": "Tacoma, Washington !Tacoma, Washington",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "18-year-old student Douglas S. Chanthabouly, killed 17-year-old Samnang Kok, in the hallways of Henry Foss High School following a personal disagreement. In 2009, Chanthabouly was sentenced to 23 years in prison on a charge of second-degree murder.[363]",
    "coords": {
      "lat": 47.2528768,
      "lon": -122.4442906
    }
  },
  {
    "Date": "000000002007-03-07-0000March 7, 2007",
    "Location": "Compton, California !Compton, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "During an argument with several non-students and students, a student was shot in the elbow and wounded in the eating area at Centennial High School. The shooting occurred an hour after classes were dismissed, and students in after-school activities were sent home.[364]",
    "coords": {
      "lat": 33.8958492,
      "lon": -118.2200712
    }
  },
  {
    "Date": "000000002007-04-16-0000April 16, 2007",
    "Location": "Blacksburg, Virginia !Blacksburg, Virginia",
    "Deaths": "0,000,00133",
    "Injuries": "0,000,00123",
    "Description": "Virginia Tech shooting: 23-year-old student, Seung-Hui Cho, killed thirty-two students and faculty members at Virginia Tech, and wounded another seventeen students and faculty members in two separate attacks before committing suicide. The incident is the third-deadliest mass shooting by a single gunman in modern U.S. history.",
    "coords": {
      "lat": 37.2295733,
      "lon": -80.4139393
    }
  },
  {
    "Date": "000000002007-10-10-0000October 10, 2007",
    "Location": "Cleveland, Ohio !Cleveland, Ohio",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0014",
    "Description": "SuccessTech Academy shooting: Asa H. Coon, a 14-year-old suspended student, returned to SuccessTech Academy, where he fired shots at people inside the school building, wounding two teachers and two students. He shot himself in the head, committing suicide.[277][365]",
    "coords": {
      "lat": 41.49932,
      "lon": -81.6943605
    }
  },
  {
    "Date": "000000002007-11-06-0000November 6, 2007",
    "Location": "Miami Gardens, Florida !Miami Gardens, Florida",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "43-year-old 11th grade algebra teacher, Sergio Miranda, was shot by 19-year-old Patrick Lively, outside Miami Carol City Senior High School during a robbery but was expected to survive.[366][367] In 2011, Lively received a life sentence.[368]",
    "coords": {
      "lat": 25.9420377,
      "lon": -80.2456045
    }
  },
  {
    "Date": "000000002008-02-04-0000February 4, 2008",
    "Location": "Memphis, Tennessee !Memphis, Tennessee",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "At Hamilton High School, a student shot a 16-year-old student in the leg during a classroom argument over rap music. The victim's injury was not life-threatening.[369]",
    "coords": {
      "lat": 35.1495343,
      "lon": -90.0489801
    }
  },
  {
    "Date": "000000002008-02-08-0000February 8, 2008",
    "Location": "Baton Rouge, Louisiana !Baton Rouge, Louisiana",
    "Deaths": "0,000,0013",
    "Injuries": "0,000,0010",
    "Description": "Latina Williams, a 23-year-old nursing student at Louisiana Technical College killed two classmates and herself in a second floor classroom.[370]",
    "coords": {
      "lat": 30.4582829,
      "lon": -91.1403196
    }
  },
  {
    "Date": "000000002008-02-11-0000February 11, 2008",
    "Location": "Memphis, Tennessee !Memphis, Tennessee",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "Following a feud that started off campus earlier in the week, a 19-year-old senior was shot by a 17-year-old sophomore during a gym class held in the cafeteria with about 75 other students at Mitchell High School, before handing the gun to a coach making no attempt to flee. The victim suffered at least two gunshot wounds and was in critical condition, the suspected shooter was in custody. \"He walked up to him, shot him, and made a statement to the coach that 'It's over now,' \", said principal, Daniel Ware.[371]",
    "coords": {
      "lat": 35.1495343,
      "lon": -90.0489801
    }
  },
  {
    "Date": "000000002008-02-12-0000February 12, 2008",
    "Location": "Oxnard, California !Oxnard, California",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "Murder of Larry King: 14-year-old Brandon McInerney, shot 15-year-old Lawrence \"Larry\" King, twice in the head in the computer laboratory of E.O. Green Junior High School. McInerney was apprehended in a nearby neighborhood. King, who was openly homosexual, died two days later. McInerney was initially charged with a hate crime, but that charge was dropped. McInerney pleaded guilty to second-degree murder and was sentenced to 21 years in prison.[372]",
    "coords": {
      "lat": 34.1975048,
      "lon": -119.1770516
    }
  },
  {
    "Date": "000000002008-02-14-0000February 14, 2008",
    "Location": "DeKalb, Illinois !DeKalb, Illinois",
    "Deaths": "0,000,0016",
    "Injuries": "0,000,00121",
    "Description": "Northern Illinois University shooting: 27-year-old Steven Kazmierczak, shot multiple people in a lecture hall of Northern Illinois University, killing five and injuring 21, before taking his own life. Kazmierczak was not enrolled at the university, but had attended in the years prior to the attack.[373]",
    "coords": {
      "lat": 41.9294736,
      "lon": -88.75036469999999
    }
  },
  {
    "Date": "000000002008-08-14-0000August 14, 2008",
    "Location": "Federal Way, Washington !Federal Way, Washington",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "26-year-old Omero Mendez was waiting at the Lakota Middle School campus to pick up his girlfriend's son. He was confronted by 16-year-old Luis F. Cosgaya-Alvarez and two of his friends, driving in an SUV. Cosgaya-Alvarez flashed gang signs at Mendez, and shot him once in the head. Mendez later died of his injuries. Cosgaya-Alvarez was arrested a few days later in Seattle and was charged with murder. Cosgaya-Alvarez pleaded guilty to murder and weapon enhancements, and was sentenced to eighteen years in prison.[374]",
    "coords": {
      "lat": 47.3223221,
      "lon": -122.3126222
    }
  },
  {
    "Date": "000000002008-08-21-0000August 21, 2008",
    "Location": "Knoxville, Tennessee !Knoxville, Tennessee",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "At Central High School, 15-year-old Jamar Siler killed 15-year-old Ryan McDonald. In 2011, Siler was sentenced to thirty years in prison after pleading guilty to murder in a plea agreement.[164]",
    "coords": {
      "lat": 35.9606384,
      "lon": -83.9207392
    }
  },
  {
    "Date": "September 2, 2008",
    "Location": "Willoughby, Ohio",
    "Deaths": "0",
    "Injuries": "0",
    "Description": "A 15-year-old student brought a handgun into South High School, and shot two rounds, one into the ceiling and one shattering a trophy case. The student then put the gun to his head. Then Assistant Principal Jeff Lyons talked the student out of doing any harm.",
    "coords": {
      "lat": 41.6397696,
      "lon": -81.4065011
    }
  },
  {
    "Date": "000000002008-10-16-0000October 16, 2008",
    "Location": "Detroit, Michigan !Detroit, Michigan",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0013",
    "Description": "16-year-old Christopher Walker, was killed, and three other teenagers were seriously wounded during a drive-by shooting near Henry Ford High School, soon after classes let out. Three teenagers were arrested and charged in connection with the shooting. The shooter, 15-year-old William Morton, was sentenced to life without parole, and Devon Bell was sentenced to forty-two years of prison.[375]",
    "coords": {
      "lat": 42.331427,
      "lon": -83.0457538
    }
  },
  {
    "Date": "000000002008-10-26-0000October 26, 2008",
    "Location": "Conway, Arkansas !Conway, Arkansas",
    "Deaths": "0,000,0012",
    "Injuries": "0,000,0011",
    "Description": "University of Central Arkansas shootings: Four young men fatally shot two students, 18-year-old Ryan Henderson, and 19-year-old Chavares Block, and wounded a 19-year-old campus visitor in the leg, outside the Arkansas Hall dormitory of University of Central Arkansas.[376]",
    "coords": {
      "lat": 35.0886963,
      "lon": -92.4421011
    }
  },
  {
    "Date": "000000002008-11-13-0000November 13, 2008",
    "Location": "Fort Lauderdale, Florida !Fort Lauderdale, Florida",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "15-year-old Amanda Collette, was killed in the hallway at Dillard High School. The shooter, 15-year-old Teah Wimberly, was sentenced to twenty-five years to life on a first-degree murder charge.[377]",
    "coords": {
      "lat": 26.1224386,
      "lon": -80.13731740000001
    }
  },
  {
    "Date": "000000002009-01-09-0000January 9, 2009",
    "Location": "Chicago, Illinois !Chicago, Illinois",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0015",
    "Description": "After attendees were leaving a basketball game at Dunbar High School, a truck pulled over and someone inside fired shots at the crowd, wounding five people, three critically. 18-year-old Georgio Dukes, was arrested and charged a week later with five counts of felony aggravated battery with a firearm. Police believe that the attack was gang-related.[378]",
    "coords": {
      "lat": 41.8781136,
      "lon": -87.6297982
    }
  },
  {
    "Date": "000000002009-04-26-0000April 26, 2009",
    "Location": "Hampton, Virginia !Hampton, Virginia",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "18-year-old Odane Greg Maye, a former student of Hampton University, followed a 43-year-old pizza delivery man into his former dormitory. Armed with three guns, Maye wounded the delivery man, then the dorm monitor. Lastly, Maye shot himself in a suicide attempt. He survived and was convicted of two charges of malicious wounding, two counts of using a gun in a felony; burglary; and shooting in an occupied building. He was sentenced to fourteen years of prison in November 2009, and was ordered by a judge to pay more than $62,000 in restitution to his victims for lost wages.[379]",
    "coords": {
      "lat": 37.0298687,
      "lon": -76.34522179999999
    }
  },
  {
    "Date": "000000002009-05-18-0000May 18, 2009",
    "Location": "Cambridge, Massachusetts !Cambridge, Massachusetts",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "20-year-old Jabrai Copney, 23-year-old Jason Aquino, and 19-year-old Blayn Jiggetts, of New York City, invited 21-year-old Justin Cosby, of Cambridge, into a Harvard College dormitory. After trying to rob him of a pound of marijuana, they shot him. Copney turned himself in four days later. Copney was convicted of murder. His partners pleaded guilty to armed robbery and manslaughter. His girlfriend, 21-year-old Brittany Smith, pleaded guilty to accessory after the fact, firearm possession, and misleading a grand jury.[380]",
    "coords": {
      "lat": 42.3736158,
      "lon": -71.10973349999999
    }
  },
  {
    "Date": "000000002009-05-18-0000May 18, 2009",
    "Location": "Larose, Louisiana !Larose, Louisiana",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "15-year-old Larose-Cut Off Middle School student, Justin Doucet, carried his backpack to a restroom, where he put on camouflage clothes, took out a semi-automatic handgun before storming into a classroom. He was going to shoot his school teacher, Jessica Plaisance, but the gun did not fire. He returned to the restroom and shot himself in the head, dying a week later of his wounds.[381][382]",
    "coords": {
      "lat": 29.572438,
      "lon": -90.3817483
    }
  },
  {
    "Date": "000000002009-06-16-0000June 16, 2009",
    "Location": "San Francisco, California !San Francisco, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0013",
    "Description": "After students were being let out of International Studies Academy on the first day of summer school classes, a man left a car and opened fire, wounding three people, including a 17-year-old female student. An 18-year-old man was arrested for being an accessory in the crime.[383]",
    "coords": {
      "lat": 37.7749295,
      "lon": -122.4194155
    }
  },
  {
    "Date": "000000002009-09-03-0000September 3, 2009",
    "Location": "San Bruno, California !San Bruno, California",
    "Deaths": "0,000,0010",
    "Injuries": "0,000,0011",
    "Description": "A 20-year-old student was wounded in the parking lot of Skyline College after an argument between him and other men. The college campus was placed on lockdown. Three San Francisco residents, 18-year-old Germaine B. Benjamin, 20-year-old Dimaryea J. McGhee, and 18-year-old Jacori W. Bender, were each arrested and charged with felony firearm offenses.[384]",
    "coords": {
      "lat": 37.6304904,
      "lon": -122.4110835
    }
  },
  {
    "Date": "000000002009-10-16-0000October 16, 2009",
    "Location": "Conway, South Carolina !Conway, South Carolina",
    "Deaths": "0,000,0011",
    "Injuries": "0,000,0010",
    "Description": "16-year-old student, Trevor Varinecz was killed by a school resource officer after allegedly stabbing the officer.[217][385]",
    "coords": {
      "lat": 33.8360034,
      "lon": -79.0478143
    }
  }
]